[
  {
    "reviewDescription": "Oh my God.\nIn row 11 but in last group to board.\nWhat Moran thought this up."
  },
  {
    "reviewDescription": "Forced to register my small suitcase when the whole idea was to save time when arriving at destination… the reason was: packed flight… but aren’t you suppose to calculate that before sending people on your planes? You sell seats and create rules on suitcases weights and numbers without anticipating anything? Once again, poor service, cheap."
  },
  {
    "reviewDescription": "Flight delayed twice for safety reasons, we were well looked after and compensation was paid very promptly with no fuss."
  },
  {
    "reviewDescription": "Internal uk flight canceled with 5 hours notice, accepted a later flight that day, that was then canceled.\nOffered a flight next day.\nTried to get refund, on a £70 ticket, was offered £11 after admin.\nTried to talk to some one, and got call centre in india. Very polite, but has no authority except to apologize, again and again.\nNot able to transfer to any one else who could help.\nNo offer of accommodations for the night.\nI did not have funds to pay out and claim back.\n\nTotal rip off mercenary company.\nDred to think if I was in another country.\nDo not use ever.\n"
  },
  {
    "reviewDescription": "Second time we've been waiting an hour plus at Heathrow baggage carousel for our bags without any announcements or staff to be seen. Only this time they've managed to lose a whole crate of bags ours and about 14 other families included. Accidents happen but the customer service department was so incredibly rude and unhelpful i actually feel really upset. No idea when or if we will get them back. Definitely NOT flying BA ever again."
  },
  {
    "reviewDescription": "Terrible online experience. Website hardly ever works and app is almost useless. Can't check in or apply for seats etc. Then once finally checked in after an hour of trying, can't get boarding pass to download or through app"
  },
  {
    "reviewDescription": "Flights cancelled twice, 2nd cancellation was after being invited to check in 24 hrs before, then cancelled 2hrs before flight, staff very helpful despite the inept management if company, however that was face to face either at airport or on plane. Landed at Gatwick instead if Heathrow to avoid an overnight stay & possibly a 3rd cancellation. BA have become bog standard, in fairness quick to pay compensation for our exspenses to get from Gatwick to Heathrow"
  },
  {
    "reviewDescription": "Over 2 years since our flights were cancelled due to covid and we're still battling to get our money back. We've been lied to, told several different processs and still we're no further forward.\nAbsolutely appalling service that has caused nothing but stress."
  },
  {
    "reviewDescription": "This company is really making a significant step in the right direction. People care, food is superb, credit to them, good to see our national carrier back in the game!"
  },
  {
    "reviewDescription": "On 6 December our flight to Geneva was diverted from landing due to high winds at Geneva. This caused an hour and 45 minutes delay. However the following was bad planning. A refueling truck and bus for the passengers to disembark at the diverted airport were not organised until we arrived there - causing an unnecessary delay. BA could also easily have given all passengers Internet access to communicate to their loved ones waiting in Geneva. None of this was forthcoming."
  },
  {
    "reviewDescription": "I use BA at least twice a month for business. I pay with Corporate card and therefore, they take a small fee. If you want to make a change that involves another fee there online system does not allow you to select a corporate card in the drop down box and hence you cannot pay with the corporate card and have to endure the call center saga. My last change to a Business class seat from Atlanta, available on line, but I had to call the call center who by error changed the booking to Premier + without advising during the call. A week before the flight BA want £3000, reduced from £5000, to change the booking error they made. Not sure what planet the manager's are on but I cannot get any sense and they cannot add corporate card to allow changes online. So I paid for business but will sit in premier. Will I Book again? no way."
  },
  {
    "reviewDescription": "This was my worst experience ever, My flight got delayed by 4hrs and then on then, no clue was there for our missing baggage. After 4days they are saying it will come within 21 days."
  },
  {
    "reviewDescription": "A British Airways spokesperson explained: \"We are a large global airline with hundreds of flights operating every day, and on the rare occasion that baggage is delayed, it is returned to the owner within a few hours in the vast majority of instances.\"\nWell Mr British Airways I am still waiting for mine ! it went missing on the 20th of May this year. I have made two complaints through your online system and had one reply in all this time, your out of your depth it seems, you cant handle existing customers, your more interested in making new ones, and finding ways to make more money, but your business is the pits, you do not care for your so called executive members, or any of your members for that matter.\n\n'British Airways lost every bag on our flight – ruining dozens of holidays'\n\nA reader's trip to Corsica was ruined when their bags were mislaid – and BA failed to offer compensation or assistance\nJust one of many headlines from this joke of a company. Another company hiding behind the internet, who sends you round in circles online, so you give up. I for one will not be giving them another penny of my money....\nAn update on my lost luggage, which has now been found and returned to me after 3 months. My bag apparently spent two months in Madrid ! The correct procedure for this bag would of been to send it back to London after 7 days. This being a British Airways flight that it was placed on to Madrid, means BA staff do not follow the procedures for their company policy. So again what are these people doing ? A very poor service overall..."
  },
  {
    "reviewDescription": "Absolutely disgusting service from the worst airline in the world. We have had our flights booked with BA for 9 months (London Gatwick to Faro) and last night we received an e-mail informing us that the return flights were cancelled. No reason given, just \"hard luck, your flights are cancelled\". We tried to amend our booking online, but you can't amend 1 leg of a return trip, so it tells you to contact them - which you can't because all the phone lines don't connect to a human. The online chatbot directs you to the website, which directs you to call them, which you can't do, so you go round an round in an endless loop. In the end it was easier to cancel the entire booking and book with EasyJet. British Airways don't care about their customers, they care about getting your money, then they couldn't care less about you. When they finally go out of business I'll dance on their corporate grave."
  },
  {
    "reviewDescription": "Holiday to Rome in April, heavy flight delay and lost baggage. one bag back halfway through holiday, second one arrived unannounced at airport when back home.\nDelay claims twice closed with no feedback, raised complaint - ignored, contacted Executive Club - they could do nothing.\nImpossible to speak to anyone about the claim.\nWill never travel with this airline again as no human customer service contact!"
  },
  {
    "reviewDescription": "Flight cancelled 2 hours before, shocking customer service & over £1,800 additional cost for our trip\nHad our flight to Belfast to see family cancelled whilst en route to the airport with our two toddlers on Boxing Day, discovered this whilst checking the terminal on the app (text did not come in until over 30 mins later).\n\nOnly alternative flights offered were days later and from a different airport. Was given two options to either accept or refund, so clicked refund and found an alternative outbound flight with EasyJet. Then had to travel from London Heathrow to London Gatwick, in taxi with no car seats to get that flight. Discovered on arriving in Belfast that in fact BA had refunded the full booking, not just the cancelled flight so this left us with no return flight back to London.\n\nWhen I called customer services, even though they had cancelled the flight just a few hours before it was due to take off and on Boxing Day in peak holiday season, her answer was “it’s your fault because you refunded the booking, you should have read the small print which said to call us if you only want to refund one part of the booking”.\n\nEverything I asked her response was just computer says no, no opportunity to speak to a manager and no flexibility. The refund value was £500 total, the cost of replacement flights both ways of over £1,800. This was a total dampener on our trip to see family and unaffordable but did not have an other option as we needed to get back home to go back to work. I have raised a compensation claim but not even had an acknowledgement so far. Absolutely shocking service"
  },
  {
    "reviewDescription": "I used to rate BA as being one of the best airlines in the sky. Not these days. Wow, have they gone downhill.\nFlew premium economy to Japan but should have saved my money and gone economy instead. Staff clearly needed more training - shouting at each other across the aisle. “What’s the name of the spicy stuff you put in bloody Mary’s??”\nRan out of both chicken and beef options and I was in the second row! Obviously could have saved money printing menus… no snacks, when I asked for water was given half a plastic cup full (this is a 14hr+ flight). Staff obvious -\nLook and sound like they’re on a Club18-30s jolly. Entertainment disappointing, hardly anything new or particularly interesting. Totally underwhelming. Won’t fly again.\n\nBy the way I flew out with Japan Airlines which was probably the best flight I’ve ever had. Absolutely superb. BA feels like Ryanair in comparison.\n\nWould have been 1 star but flight was on time and I received my bags."
  },
  {
    "reviewDescription": "Shocking service from British Airways - becoming increasingly disappointed that their technology platform is so bad and you can never get through on the phone. Airport customer service is shocking and staff are not empowered to make decisions. I feel sorry for them. Up your game British airways or I will take my business elsewhere!!"
  },
  {
    "reviewDescription": "Have you come across the situation that you received flight booking confirmation but actually not the case? Yes, BA gave me such a \"unique\" experience!! We traveled to Namibia 14th Aug - 27 Aug 2023 via Johannesburg. Despite a different landing time of the 1st leg outbound (1.5 hour later than confirmation email) which made us miss connection flight, we did not realise that the worst was yet to come! On way back, just a few hours before returning flight from Windhoek to Johannesburg, I realised that I could not do online check in and the leg from Windhoek to Johannesburg disappeared from my BA booking details. There is no email no text, nothing to inform us. I had to make international calls to BA and South African Airways. SAA told me that they could not see my booking at all! I was panic as it was only a few hours away to our flight! I finally got hold of BA customer service and was told they could not book me and I had to find my own way to Johannesburg...what? Why? I booked my round tickets 4 months before the trip! I called SAA again and they told me it is impossible for me to catch the transit flight from Johannesburg to London: since it will be a separate connection flight, we had to go out immigration, check in at BA counter and go through immigration again....we were soooo sick about BA and decided to buy a new return flight back transit Frankfurt with Lufthansa as they had 4 seats left that day....There was one more detail: there is no BA counter at Johannesburg airport and no sign of BA at all. If you have to do anything with BA, you have to find their agent by asking around ground staff. So basically, BA sells their product which does not exist! Yeah, we had a lot of \"fun\" that trip. Now I am in process to argue with BA about refund but guess what, their response is we can not refund because you have to follow reschedule by BA if due to any flight disruption. Wait a minute, it is not due to flight disruption as I put down clearly, it is due to BA's negligence or misconduct as a business! So clearly their relevant department does not read my complaint, does not bother to understand what was the situation. I am not surprised as they must be handling millions of odd cases! We have been a loyal customer to BA for many years but now looks like I should settle my case in court."
  },
  {
    "reviewDescription": "I had paid £58 for 2 selected seats on Tuesday 15th November (departure is on the 18th). The seats I paid for were 8F and 8D. 24 hours before check in I got an email that check in has opened and so I decided to check in online on the 17th. At the time of the check in a random selection of 2 seats on row 18 got allocated to me instead of the seats I had paid for. I tried to change them to seats originally paid for but row 8 was not even visible on the seat selection chart. I then called the customer service team who said these seats are not available anymore but I can allocate other seats of your choice (which were available to anyone who checks in 24 hours before departure). I asked for a refund for the seats that I paid for as those seats are not being allocated to me and after 28 minutes on the phone I got told that those seats are non refundable and so I can't get money back. I am extremely disappointed by such unfair business practices of BA. This is something I may have expected from some low cost airlines but not BA. For a lack of better analogy, it's like saying, you have paid for Nike shoes but they are not available so just pick any that are, but you are not getting your money back for the ones you have paid for even though they are out of stock!\n\nAbsolute cowboy service which I did not expect from BA. had better and fair policies at Ryanair, EasyJet and other so called “low fare airlines”."
  },
  {
    "reviewDescription": "Due to fly to Newark but delayed by an hour due to a fault with the aircraft. Once onboard a further delay was announced due to the jet bridge not being able to detach from the aircraft. After another hour we finally left.\nOne hour out of Newark , we were put in a hold which lasted three hours due to a thunderstorm.\nFlight diverted to Philadelphia due to the storm. We spent about 4 hours on a taxiway waiting for a gate to become available as the airport had closed and was full of diverted aircraft. Original arrival time into Newark was 14:55 , by now it was 21:30.\nCabin and flight crew were excellent and did everything possible to keep us comfortable. Due to the time spent on the aircraft , half of the toilets were out of order, water was running out as were snacks!!!!! The aircraft Captain actually said he was embarrassed and ashamed to have to leave us with no help.\nNo assistance for onward travel from British Airways was provided , in effect leaving us stranded late at night over 100 miles away from New York in the wrong city.\nRude and totally useless ground staff in Philadelphia wearing BA uniform were an embarrassment to Britain as they did not want to do anything to assist with sorting out the problem. Cost s of hotels were spiralling and with no help from the staff we were left to sort it out ourselves to arrange onward travel to New York. Too late to book trains so a taxi was the only option. BA first of all said that reasonable expenses would be met but have now backtracked on that by saying £20 per person for meals, reasonable hotel costs with cheap onward travel all to be arranged by us.\nDid the two hour delay on the ground at Heathrow contributed to our late arrival to Newark where we would have arrived before the storm started?\nCost of taxi to final destination was less than values Captain and email quoted as equivalent compensation.\nWe finally got to our hotel at 0130 the next day. Thank you for your service BA.\nTrying to get anywhere with the customer service team is nigh on impossible. If you are suffering such a large amount of complaints take on more staff and have a good look at yourselves.\n"
  },
  {
    "reviewDescription": "BA is the meanest and most badly run of airlines. From their website to their terrible, terrible planes, there is simply nothing to commend them:\n\nLegroom - awful - a class action on DVT’s should be a thing\nWebsite - awful - also non functional, crashes etc etc\nIn flight care - awful\nInflight food - inedible - I mean, revolting.\nTime keeping - awful - every single part of my journey was late\nEmbarkation - awful - shouty, aggressive and rude\nCustomer service - non existent. Clearly they don’t care enough to even pretend\nApproach to service - think aggressive bouncer and you’ve got the idea.\n\nAll in all they don’t deserve a single penny of anyones money. Go elsewhere you’ll thank me."
  },
  {
    "reviewDescription": "Very good service for money. We flied from London to Barbados. Good communications throughout and flexible baggage allowance"
  },
  {
    "reviewDescription": "They charged >£5000 for my flight and this is the service level of they racist employees\n\nI was at the boarding gate. I heard my boarding group number was called and I tried to ask a person named \"Wendy\" if my group was ready for boarding. Wendy stood about 1 metre away from me and gave me a side look then ignored me, I asked her for a second time, \"Wendy\" answered \"no\" without even looking at me. She was extremely rude. Whenever there was a white person asking the same question she came close to them and answered nicely. She seemed to be extremely racist against Asian looking people. I asked for her name for making a complaint, she said I was rude because how I tried to get her name. She then went to get the supervisor \"Monserrate\". Monserrate immediately accused me of being rude without considering Wendy's behaviour, and started being extremely rude to me. At the boarding time, I was trying to get Monserrate's name, another supervisor named Michelle told me I HAVE TO scan my boarding pass before I can talk to\nMonserrate, After scanning my boarding pass, Michelle stopped me from going directly to Monserrate to get his name. Instead she started interrigating me, before I finished explaining the incident, she turned away from me without giving me Monserrate's name, when I tried to ask for her name, she asked me to step back in an extremely rude manner. I asked for Michelle's name again, she said she already gave it to me which is obviously a lie and extremely rude, she then pointed at her name badge without saying her name. While knowing I was behind him, Monserrate kept me waiting and ignored me for a few minutes and then without any valid reason, he asked for my passport and boarding pass which was already been scanned, obviously he was intentionally trying to make the process as difficult as possible for a passenger who's trying to make a complaint. After unnecessarily checking my passport and boarding pass again, Monserrate pointed at his name badge and turned away before I could recognise what was written on the badge. I had to ask him multiple times to get him stay still so I could record his name correctly. While I was noting down names, Michelle shout out loudly \"hes now trying to get everyones name\" and tried to humiliate me in front of all passengers.\n\nI'm completely speachless and shocked by the level of services done by your employees. How the extremely rude and racist behaviours from all of them."
  },
  {
    "reviewDescription": "Trying to book an experience trip using my AVIOS points on British airways executive club , the booking service is absolutely awful, get to the final passenger selection page and it won't let me choose my child on the drop down, even though her details was already inputted in my account profile and on the booking page.\nTried to call today , Friday 3pm and the line is busy and auto cuts you off. However, managed to get through after 5th attempt finally, but unfortunately, wasn't able to resolve the issue, as its a technical glitch with child bookings and I was told to try again in a day or two. Would have given one star if it wasn't for the friendly customer service and conversation had with the helpdesk lady at booking team."
  },
  {
    "reviewDescription": "I put in a compensation claim for a delayed flight which ruined my 40th birthday and have been getting emails saying \"sorry for the delay we appreciate your patience\" so after 3 months I called BA and was told my claim has been resolved but I have received NO emails or compensation?? The person couldn't help or pass me to someone who could help and said he would get them to call me...no call! So I called today, he was useless, done an online chat, she was useless and I've been told to fill out yet another form which I'm sure someone will read and totally ignore! It's a joke!"
  },
  {
    "reviewDescription": "I am horrified at the level/lack of customer service. My elderly mother flew to London, they lost her suitcase (which I appreciate happens) but now that I want to speak to someone the call center keeps hanging up on me and sending me a text to link to the website. Of course I've tried the website first with no joy, of course. The lost luggage reference number she was given is incorrect and I cannot get updates through the website. All her medication is in that suitcase and I'm very concerned."
  },
  {
    "reviewDescription": "BA cancelled the last leg of return flight. Their suggested option was a connection 14 hours later which had to be booked by calling customer services. 7 attempts to get through where mostly the call wasn’t answered. One successful connection where agent appeared to hang up. Passenger is 82 year old lady travelling on her own who needs assistance, BA knew this.\nBA left her in the airport to find her own way to complete the journey, shocking service.\nIf your travelling BA beware, any issues your on your own"
  },
  {
    "reviewDescription": "The last 3 flights I've had with BA have been terrible. Not because of the delays and cancellation, but the way the airline just doesn't care when things go wrong!\nThe first flight (3rd Sept 2024) was delayed for 3 hours 40 mins and we were just left at the gate without even an offer of a glass of water and no one to talk to for information. The second 10th Sept 2024) was the same but only an hour and 30 minutes delay.\nThe third flight (26th Sept 2024) was cancelled, after boarding and sitting on the plane for 90 mins at which time we were told there would be no representative for BA to talk to and we all had to make our own arrangements for hotels and transport. In other words, we were just left high and dry!\nThe replacement flights offered were so impractical, being the next day and involved transfers at other airports we could not take them and when we finally got through to the so called customer service the attitude was \"you'd be better off getting a refund, good bye\"\nWe were lucky enough to be in business class and we were treated with total disregard so if you are traveling with BA, you really need to hope nothing goes wrong as you will be left to fend for yourselves!\nNo customer service, I do not recommend this airline."
  },
  {
    "reviewDescription": "As a frequent flyer I've used, and preferred, BA over many other airlines until quite recently.\nOver the last 4 or 5 yrs there has been a steady decline in quality most noticeable in their short haul (which I stopped using some time ago) but now, sadly, long haul as well.\nA recent flight from Joburg to Heathrow was a classic example.\nAmongst the failings, our tickets had not been put onto the BA system properly which only became evident when we spent over an hour trying to check in, despite having booked 6mths beforehand. The BA staff were unhelpful in the extreme and once aboard my entertainment consul failed to work despite several attempts to reset it by the stewardess.\nI wrote to BA setting out my complaints and received a proforma reply offering me a £50 voucher, despite it being clear that whoever sent the email (probably a computer) had not read my letter at all! Incidentally I replied that I had no interest in a voucher but would like to think that some action was being taken to address the issues that I had encountered for the sake of future customers. I have heard nothing whatsoever since.\nHopelessly unprofessional service in every aspect of their business from start to finish, I will now use other airlines whenever possible."
  },
  {
    "reviewDescription": "British Airways service is abysmal. My mother and I flew from Frankfurt to Heathrow last week and British Airways lost our baggage. Despite making a lost baggage claim and being promised our lost baggage in 24-48 hours we have received nothing. The only time they tried to deliver it was the wrong bag, despite the fact that during the the lost baggage claim being made we scanned on our distinct boarding passes and check in codes. The Airport Team at Heathrow refuse to answer the phone and the lost baggage team do not brother to send consistent or regular updates. I have had to ring everyday to get some kind of movement and still have yet to receive my baggage."
  },
  {
    "reviewDescription": "What's the point of paying at least 30% more to fly BA when you get the same rubbish service as cheaper airlines. If wanted long queues, delayed flights, no amenities included in the price - I would fpaybfor a cheaper flight. Really poor - definitely a waste of good money!"
  },
  {
    "reviewDescription": "i traveled twice last week, round trip from London to Amman Terrible service no meal no entertainment on a 5h flight"
  },
  {
    "reviewDescription": "Disappointed with British Airways this time, my wife is 7 month pregnant and hence I contacted to airlines to book and pay for the seats where there will be no recliner seats in front of her and I was told that all the basinates seats were not available for booking and nothing available however I saw in flight that seat 30 DEFG all seats were taken by young and healthy adults, it's a shame that British airways declined my request even though I was happy to pay the seat charges, this type of response is not expected from a reputed airlines."
  },
  {
    "reviewDescription": "One of the worst flights/airlines I have ever experienced. The cabin staff couldn’t be bothered and there was a definite feeling that passengers were an annoyance and not paying customers. Food was appalling to the extent that I queried where the bread roll and plastic cheese was at lunchtime. Tea was a joke consisting of one slice of bread and a two finger kitkat. On the return it was dinner (identical to the lunchtime outward flight) which produced the elusive roll and cheese. Breakfast!! What a laugh! A roll with a slice of cheese and a piece of processed turkey along with a yoghurt. The children we were travelling with were not supplied with any entertainment packages as they had been in the ‘olden’ days. Check-in at Orlando was truly abysmal. Two check-in staff for the entire plane but they didn’t mind ‘there’s plenty of time, it’s hours until the flight departs’. The whole thing beggars belief."
  },
  {
    "reviewDescription": "Worst check-in experience I have had in decades.\nArrived af Lyon with 2hrs 20 mins before flight.\n1hr 30 minute queue for check in, staff spending 10 minutes to check in each group, seemingly finding it quite amusing how stressed their customers were getting. Queuing system a complete free-for-all. Staff did nothing to stop an unofficial side queue forming with people turning up and shamelessly pushing in at the front. Starving children bursting to urinate and when finally being able to do that, had to run through the terminal building as soon as leaving the check in queue. No time for lunch or to sit down for over 2 hours.\nNever again using BA, absolutely awful."
  },
  {
    "reviewDescription": "Flight delayed from Dubai by 6 1/2 hours...\nSo BA rebooked the Heathrow to Houston sector as I'd have missed that flight by three hours. They found a fifteen hour plus alternate route. Despite the very late notification of the delay, I was able to get the travel agent to rebook for 24 hours later, and cancel the ridiculous nonsense rebooking offered to me. Lost my pre paid seats and now, today's flight is 50 minutes late....\nOn the plus side, just saw Royal Brunei is flying again from Dubai to Heathrow... Great little airline. That's trips home sorted from now on.... I gave two stars as I have used BA for the forty years I have worked in the Middle East, and they were not bad at all years ago. Based on the last two days of late notifications, uncontactable phone operators and lost bookings, they'd get zero stars. Smarten up BA...."
  },
  {
    "reviewDescription": "BA website on every device is down yet again, no maintenance page to confirm or apologise."
  },
  {
    "reviewDescription": "Worst airline to travel on , cabin crew are disgusting horrible people avoid these dinosaurs at all cost !"
  },
  {
    "reviewDescription": "Booked window seats from Mumbai to Heathrow , £31 each .\n10 hr flight . When we got on the plane we were facing a wall and no window . We couldn’t move any where else as the plane was full . When we booked the seats it said “window seats “ .\nI emailed BA they were not interested .\nWe always pay for a window seat what ever plane we’re on , we would not have booked those seats had we known they were not window seats .\n10 hr , day flight not being able to look out of the window , not nice\nBA are scammers ."
  },
  {
    "reviewDescription": "Booked a long weekend at Disneyland Paris with BA.\nBooked Business Class for 4 adults and had to pay an extra £192 to select seats. That's a joke in itself but prior to going they changed where we were sitting about 4 times - so what's the point in charging for it...\nThey outbound flight was cancelled and put back so we lost half a day. The 10.00pm return flight was cancelled on the morning of the flight so we had to panic, pack our bags and leave straight away to get a lunchtime flight and miss our last day. (We could not stay on another night as we actually had work the next day - not that BA would appreciate that)\nWith priority boarding at the airport we expected to go through quite quickly but it was chaos and we had to wait an hour for others to check on through our priority channel.\nWe had 3 hold cases - we were allowed 8 so no problem there but they would not let us take our cabin bags onto the plane with us and they had to go in the hold - despite having various medications and things we needed in them. in the end with a lot of arguing at check in we actually were allowed one\nbetween the four of us.\nWe paid for bloody Business Class for goodness sake.\nWe lost a third of our weekend away because of BA and would strongly recommend you book elsewhere until they get their act together again.\nPS our friends just had their we in Rome cancelled 2 days before departure and wasted their works holiday allowance."
  },
  {
    "reviewDescription": "Flew return from Heathrow to San Francisco on an A380. Despite paying slightly more for better seats it turned out we hadn’t got anywhere near paying enough for actual human being sized seats and were squashed together for 12 hours of cramped claustrophobic misery (both ways). BA seem to have increased the number of upgradable seat types so they can justify reducing the size of “normal” seating to the same stuff you’d get on a short haul flight. No legroom at all, and seats waaay too narrow. On top of that climate control didn’t work properly on way back and cabin was stiflingly hot. One of the toilets broke mid flight. My seat tray was broken on BOTH flights, touch screen TVs looking very dated and didn’t work properly on either journey. Plane felt a bit grubby and tired.\nSeriously check what seats you have booked as this was just about the most cramped flight Ive ever been on anywhere. And it was a 12 hour flight, feel like BA are just dropping any pretence of customer service these days."
  },
  {
    "reviewDescription": "Just tried to check in to tomorrow’s flights after getting Verifly ready to travel. BA states check in not available because COVID documents haven’t been loaded. Verifly state it might because we made a mistake on our name date of birth etc. - we didn’t. This just adds to the litany of cancelled flights etc from BA. They need to get their act together now!"
  },
  {
    "reviewDescription": "Horrible airline left multiple customers at the gate gave us the run around when trying to rebook. Illegally had us bypass security to take us to another desk so that they could forgo assisting us."
  },
  {
    "reviewDescription": "British Airways was extremely inflexible and wouldn’t let me change my flight to a day earlier. Then, my original flight ended up getting canceled. It was absolutely ridiculous. The worst. Horrible."
  },
  {
    "reviewDescription": "Don't ever pick British Airways!\nFlight from Miami to Heathrow. Entertainment console not working ghastly food and surly stewards. Was given three tiny drinks.\nWhen I complained they offered me a voucher towards another flight. Will never go with B.A. again!"
  },
  {
    "reviewDescription": "2 delays and 2 missed connection flights, ruined what shouldve been a good trip from the UK to US. Will avoid for the future."
  },
  {
    "reviewDescription": "I travelled from Mumbai to UK on Friday 30th September by BA. I would like to thank Mr Meherzad Marker Mumbai based cabin crew for giving us excellent service, well mannered polite and very helpful. I wish him all the best\n\nRegards\nPriti Davatwal\nSlough"
  },
  {
    "reviewDescription": "Like so many others, I’m shocked at how awful BA have become. Perhaps I’m an old cynic, but isn’t it amazing that they couldn’t arrange my flight departure on time, yet had no trouble ensuring it took off before the magical three hour delay trigger time? My flight from Heathrow to Pisa took off 2hrs 40mins late. I’d prepaid for car hire at Pisa, but by the time we got there, the car hire office was closed. Stranded at Pisa Airport with a severely sight impaired wife. We got to the car hire office as soon as we could the following day, only to be told we were a “no-show” and we would have to pay for a new hire. I’m £1000 down and nobody gives a flying fig. BA thought it was really clever in its ability to cut costs and abuse Govt COVID support schemes at the expense of its staff, but now it’s apparent to everyone what a disgusting excuse for an airline it is. AVOID."
  },
  {
    "reviewDescription": "Going to Detroit, from London - British Airways failed to put my checked bag onto our connecting flight in Dublin - (luckily I happened to see it on a carousel). Then on the return flight they did the same thing and I arrived in Heathrow without my baggage. When the bag arrived a day and a half later, they had cracked it to the point it cannot be used ( hard suitcase). They refused to replace it because I failed to report this within 7 days....Computer says no. to think they were a bastion of customer service years ago. I'd expect this off Ryan air."
  },
  {
    "reviewDescription": "I had a flight delayed on 9th of December from Shanghai to Edinburgh, this delay made I miss my connection from London to Edinburgh, I had to pay all the expenses and they assured that it would be compensated, I raised the complaint requesting the compensation on 10th of December, it's almost 2 months now and I didn't receive anything, not even an email with an update, I have urged more then 3 times and nothing! I'll never use this airline again!"
  },
  {
    "reviewDescription": "It was my husband and my first holiday with baby aged 8months from LHR to Istanbul, service was terrible and staff mostly incompetent.\n\nOn the way to Istanbul we were given a baby extension belt to use, we weren’t given any instructions on how to use it so used it incorrectly the whole flight, it’s only on the way back the flight attendant noticed and showed us how to do it.\n\nWe asked for hot water for babies formula milk, staff were rude about this and huffing and puffing commenting that they’ll have to put the aircraft seatbelt signs back on so no one comes to them requesting anything!\n\nWhen we reached Istanbul our babies stroller was supposed to be at the aircraft door but for whatever reason it wasn’t there, we went searching for it on the conveyer belt with our suitcases but it wasn’t there, after searching for nearly an hour we found it chucked recklessly outside the lost and found office!!\n\nTerrible service."
  },
  {
    "reviewDescription": "This started with an email stating that my return flight from Barbados had been cancelled. No explanation and no offer of help. The advice was just check their website to rebook or claim a refund. Three weeks before I was supposed to fly out, a refund was of no use due to expensive accommodation bookings. The only flight on offer was 24 hours later. When rebooking, they even made me pay for seat selection again when I had already done this on the original booking. This was later refunded.\nOn my return home I lodged a claim for reimbursement of additional expenses, hotel. food and taxis but the website is not easy to navigate to find out what they pay and how to lodge the claim.\n10 weeks later the status of the claim is simply ''received'' in other words no-one has progressed the claim. 10 weeks of inaction.\nGeneral customer service cannot access the claims process, all they say is that the team are very busy. They cannot provide a contact number to speak to the team so the customer is left entirely frustrated at the complete lack of customer service and accountability.\nLike some of the other contributers, I think I have made my last booking with BA.\n"
  },
  {
    "reviewDescription": "Emailed me to say my Sunday morning return flight was cancelled and wanted to put me on a flight at 9.15pm the same day. I clicked on the button to see what alternatives there were and chose what i thought was another morning flight to another london airport. There were no dates at this stage so i presumed it was for the same day (Sunday). As i was out and about i clicked through on my phone and only realised i had chosen a Monday return when an email confirmation was sent straight afterwards. I phoned back immediately and was told that i could not switch back as i had ‘chosen’ the Monday flight and it would cost me £800 to revert back to the flight they had put me on only minutes before. At this point it just cut me off and i had to go through the same process again (on hold for 40 mins) only to be told the same and cut off again and it was my fault.\n\nI understand it was my mistake when i clicked on an alternative but it was an easily made mistake and i tried to rectify it within minutes. The inflexibility and wait times are awful and i deeply regret my decision to use them to fly to America later in the year."
  },
  {
    "reviewDescription": "One star is too high for this sham of a company. It’s a shame because their crew are excellent and perform surprisingly well given the disastrous state of their management. Essential as a client you’d never realise they had any personnel older than 6yrs running the company. They lost my luggage on a flight to Malaga, then found it and sent it to Barcelona. The live chat was as useless as the chat bot who spent an hour repeating what I’d just told him. Getting hold of anyone living was impossible. Never ever use this company."
  },
  {
    "reviewDescription": "How can a major company have such a bad website, for so many years. It's been terrible for years.\n\nIt's almost impossible to actually book a flight on it. It's like pulling your teeth out. Just spent an hour trying to book a flight and have given up. Booking with virgin now..\n\nWhat has their CTO being doing for the last 15 years?"
  },
  {
    "reviewDescription": "What a pity one cannot give zero stars! Arrived in Heathrow on 11th December and checked in for an onward flight to Edinburgh. Admittedly, it was foggy but they did not actually cancel our flight until we were airside. Essential to get home so took train north and were told that baggage would be forwarded. Had to speak to a real person to actually file a report re baggage. A week later, one of two cases arrived but it was not ours. So refused to accept it from the courier, who actually said it was not the first time this had happened to him. Some idiot at Heathrow had wrongly labelled it even though it did not in any way resemble the description filed with BA - wrong colour, wrong bag type, wrong receipt number. Second case arrived five days later (and it was badly damaged to the extent that it is no longer usable). We still do not have the first one. However, baggage tracing system still thinks that it was to be delivered by courier on 19th! Tracking round the BA site is tortuous and pointless. It seems to be just a circular journey. I am beginning to despair that I will ever see the case again. What makes things even more disappointing is that the two cases were checked in together and were identical even down to the same pink baggage security strap. Coupled with the quality of flight menus and cramped seating on our original outward flight two weeks earlier, even though we have been members of the Executive Club for more years than we care to think, we are vowed never to use BA again if we can avoid it."
  },
  {
    "reviewDescription": "Money money money....\n\nThats all that British Airways want and they will not give you it back easily....\n\nThe customer service is next to non - might as well not complete any customer service training as non of them have a clue or can think for themselves.\n\nMy flights got cancelled, I wanted a refund, BA repay money to an account that was closed 2 years ago and the Credit Company confirm that no payment has been received. Will they continue to fob me off for another 2 months and say they have made a payment.... YES, almost definitely.\n\nCompletely useless"
  },
  {
    "reviewDescription": "BA must have the poorest information technology platform of all airlines. They do not seem able to maintain a stable platform to deliver a seamless and hassle free customer service. They probably hired the same IT-team that wrote the disastrous MCAS software for the Boeing 737-800 who’s credo was “crash and burn”.\nBritish Airways needs to get a grip and drag its half-assed IT system into Century 21."
  },
  {
    "reviewDescription": "Baggage did not arrive at flight destination until nearly 48 hours after we did, told by the lost baggage helpline to buy whatever we need to as we had nothing but the clothes on our back. All receipts for purchases sent to BA and they offered us a refund of around 15% of the total we needed to spend. Will never use BA again after years of loyal custom with 2-3 flights a year."
  },
  {
    "reviewDescription": "Do never think to fly business or first with BA they really don’t care about you and your luggage. They lost my luggage and when I arrive to the destination they didn’t even apologize I got to the police they gave me the number of BA customer service guess what when you call the number you will never reach them they will say email us at bla bla bla!!! It’s an emergency is that a joke ??? Anyways I reported to the lost and found and they told me stay at the airport don’t leave until we find it I stayed 6 hours no food vouchers or any compensation provided I waited until the next BA flight come with my luggage anyways I took it and I go to the airport I felt the bags are not heavy but I was tired to check at the airport I got to my hotel I opened the bags and both are empty all my Loro piana open walks, all my jackets my clothes are gone they worth nearly 20K£ anyways I make a claim online contacted my girlfriend to send me the invoices and I open an investigation they told me to wait at least 30 days for an initially investigation anyways from June I waited until November to get an email from them saying we are sorry we couldn’t compensate you you should have put your valuable items in hand luggage ??? Is that a joke????? Now my lawyer sues them according to the Montreal Protocol all airlines should refund you anything is lost while is with them it’s their responsibility even if they offer you 10% of what you lost you should never accept it and sue them to 3rd party and go to court this people are big scammers making millions from us. I hate BA forever!!!\nAlso all insurance company’s and Amex won’t help as BA never respond to them! BA you are the worst go learn from Emirates, Virgin Atlantic and Airfrance how they treat their platinum passengers"
  },
  {
    "reviewDescription": "The flight to Milan costs as much as going to New York basically. I have paid to bring my hand luggage to the place and told I couldn’t as the flight was full. Boarding is finished and the flight is actually pretty empty. Easy jet way better than this. Probably last time on a BA flight."
  },
  {
    "reviewDescription": "If you can get through to someone on the telephone, then problems usually get sorted out. However, I am currently waiting, after being put on hold, now for 40 minutes. Despite being cut off 3 times this afternoon, I am still hanging in there. You cannot say that for BA - they have cancelled three separate flights over the past 5 months, their food has deteriorated on board and they blame all of this on Covid. Still waiting for them to get back to me after being put on hold .....(44minutes and 39 seconds now)"
  },
  {
    "reviewDescription": "Tried to pay balance of holiday via website, payment kept failing. Called customer service, was keep waiting for 20 minutes, eventually spoke to a polite young lady who after a tortuous verification session politely told us to call another number - It would be much faster she said - The number has been engaged for the last hour and a half - British Airways customer service are a waste of space - I only wanted to pay 5k to pay off our family holiday - what a joke."
  },
  {
    "reviewDescription": "Absolutely furious with how we were treated by BA at Gatwick. Pre booked and paid not shy of £300 for our outbound seats to Punta Cana on 20th July. BA had changed the seats once to free seats but we logged in to change them back and did so successively or so we thought! No further communication from BA over our seats. When we were about to board we found to our dismay that our seats were not available and we all got split up! We tried to explain to the BA ground crew that our son has hidden disabilities and we needed to sit with him( long flight) the staff member was very dismissive and told us nothing he could do and we had to take it up with BA!\nAbsolutely disgusting service and shocking lack of communication from BA. Will never fly BA again."
  },
  {
    "reviewDescription": "Compagnia imbarazzante\n\nSu un volo internazionale cancella l’ultima tratta e ci fa aspettare 8 ore per prendere l’ultimo aereo\n\nSiamo in giro per aeroporti da più di trenta ore seppure abbiamo pagato profumatamente un servizio completamente diverso\n\nVergogna!"
  },
  {
    "reviewDescription": "I booked a return flight and reserved seats three months in advance to Spain.\nI had to cancel this trip, I went onto my booking and the refund option came up so I clicked on it.\n\nI then received an email stating this flight is non refundable I lost about £600\n\nIt’s in the small print.\nUnfortunately I have now heard this story many times\nIt’s a big Conn\nYou do have the right to get vouchers or change the flight however the site is very misleading calculating and devious."
  },
  {
    "reviewDescription": "Much improved"
  },
  {
    "reviewDescription": "Was forced to check my bag on a flight from Pittsburgh in May, and they destroyed it, but still haven’t compensated me. They admitted responsibility, then lied and said I didn’t lodge a claim within seven days (it was less than as day - I have their confirmation email as proof). You’re not allowed to speak to a human being. All I can think of is to sue them."
  },
  {
    "reviewDescription": "We flew on Concorde with BA and used them regularly until they started mistreating their staff, not taking care of our data and having a website that is not fit for purpose. Not being able to check-in online until 24 hours before takeoff is an example of the last thing they think about - their customers! So we end up with a Ryanair Fying the Flag company. We flew Business Class as part of a tour of Jordan which reminded us of why we didn't use them. Check-in, Fast Track (not available in Jordan), Club Lounge, Food and the Staff were good; but on the plane it was a con. Same seats, same leg room, no films on a 5 hour flight - you have a middle seat between you but this is no consolation; this is the principal thing you upgrade for. A tall Canadian guy in Economy had to have his legs in the aisle and wasn't allowed to move to empty seat at an Emergency Exit which provided more leg room. So no more BA!"
  },
  {
    "reviewDescription": "Two months ago I flew from Cape Town to London and upgraded my seat due to a back injury. I was downgraded at check in and TWO MONTHS later I still haven't received a refund despite following all the protocol.\n\nOn the return journey I pre paid for an extra bag only to find it didn't appear on the system at check in which is all automated.\n\nTerrible customer service, horrible automated processes and only interested in taking your money but not refunding it.\n\nI won't use BA again - disappointing"
  },
  {
    "reviewDescription": "Another triumph from the fallen angel. This morning the alarm went off early for a 7.40 flight to Brindisi. The first issue was the queue to check in luggage. For Business Class. The queues for Economy weaved round the departures hall but amongst the sea of whirling screens and closed lanes, it still took 20 minutes and some kettling for those who had paid serious money or were foolish, captive regulars to get to baggage check. The man at baggage check smiled when i suggested this was sub optimal and thanked me for my joke. The bags were checked and new boarding passes issued. I had been moved seats, closer to the front. As we headed to Fortnums to spend some money, i asked my wife whether her seat had changed too. It hadn't. I checked my new boarding pass again. It was for a different name and a different destination. Bizarrely it had worked at security as did my wife who, it turned out, was using my boarding pass. It crossed my mind that i and or my bag might not be able to get to Brindisi and so i sought assistance. I finally tracked down a \"Customer Experience Lead\" who, to be fair, worked hard to move the bag to the correct flight and reissued new boarding passes for me and my wife. Armed with these new boarding passes in correct names, we both passed through the automated boarding gates. I had thought that we were being tracked through the airport for, amongst other things, security purposes. But now i am not sure. Both our documented identities had changed twice from correct to wrong to correct on this passage through Heathrow but at no point had these changes impeded our progress. I shall ask the appropriate people the appropriate questions on my return!"
  },
  {
    "reviewDescription": "If there was an option for a 0 star rating, I’d have opted for that!\n\nFlew from JFK to Heathrow where we were meant to get a connecting flight to Manchester\nThe original flight I booked was changed to an earlier time by BA and while I thought the new flight time was cutting it fine to disembark, go through security , get the connecting flight etc , I thought BA have changed the flight and have given us a new time .. so they MUST know what they are doing! How wrong was I.\nWe were still on the JFK plane at Heathrow when the gate for the connecting flight closed.\nBA staff at Heathrow were less than helpful. The terminal was full of unhappy passengers trying to sort out new flights.\nI was in a queue to enquire about getting new flights when someone from BA was walking down the queue wafting some papers and calling random surnames … mine happened to be one of them.\nI was handed 4 tickets for the next available flight and 4 x £10 vouchers for food and drink .. the time of the voucher was printed before our flight had left !\nThe new flight was 12 hours later than the one we should have been on.\nThis was unacceptable, especially after we had just done a night flight and we had 2 kids with us.\nWe decided to get the train home instead and paid £276 for 4 tickets.\nWe went to reclaim our baggage that should have automatically been put on the Manchester flight. The BA person we spoke to located our bags, well 3 of them. We have no idea where the 4th bag is … and as I type today that bag is still missing since 1st June 2023.\nMy husband has tried in vain to claim for his lost bag but the online forms are not the easiest to complete and often fail once the submit button is pressed.\nI have logged a compensation claim for the flight as advised by a BA staff member at the airport, who told me we should get £200 each back. But, to date I have not had a single reply to anything I have submitted re this.\nI thought booking with BA we would have had a great experience, how wrong was I !\nI can honestly say, I have never known a company as bad as them for customer service and I will never fly with them again.\nMy best advice to anyone considering booking with them is to avoid at all cost!"
  },
  {
    "reviewDescription": "Just had 2 flights cancelled on me at last second! I’m trying to call BA to ask for help and they have put the phone down on me multiple times sending me text links of things I’ve already seen and doesn’t solve my problem! THIS IS SUPPOSED TO BE BRITISH AIRWAYS NOT RYANAIR!!!!!!!!!!!!!!!!"
  },
  {
    "reviewDescription": "Although I have experienced a few delays before take off, the crew have always provided a Fantastic service at check in and on board. Thank you for your help and assistance 🙏🏻"
  },
  {
    "reviewDescription": "Worst customer service. Customer care advisor was so rude and inappropriate, and not resolved issue on my changing my travel dates. I have raised complaint on their portal. I have been a BA customer past 15 years. My next travel tickets will not be through BA."
  },
  {
    "reviewDescription": "Absolutely disgusting behaviour from a Manager stewardess on a BA flight from London to Las Vegas last week, the way she spoke to me was sheer arrogance and on a major power trip, and I had to sit there and take it, or i was threatened with being removed from the flight prior to take off all because I wanted a drink, as we sat there for 1 hour delayed, i also reclined my chair to see how far it went back, and the cow behind me complained, now I will tell u if she spoke to me the way she did outwith the plane she would have known about it, the first and only time I will ever fly with BA I hope the Stewardess sees this comment."
  },
  {
    "reviewDescription": "I paid for 2 particular seats in Business Class on 20th October 2023 for a trip in September 2024.\nOn 6th July 2024 BA changed the seats for operational reasons. I have requested a refund as\nI have had to rebook 2 unsuitable seats, but BA refuse to answer my emails sent on 8th July, 3rd August and 16th August. I also find it impossible to reach them by phone to speak about this matter. Just the usual automated replies.\nLesson:- Do not pay for Business Class seats in advance, because when you are moved, they refuse to communicate. So BA, upon notification of this review, sort out your appalling customer service.\n\n"
  },
  {
    "reviewDescription": "Had to be on hold for 40min + HORRIBLE STAFF. Called them to change my flight since my son lost his passport, in the middle of the call the lady accused me of lying and won't listen to me when I give all the correct details and reference number because \"my name is Asian and I don't sound Asian\", then started screaming and ended the call suddenly without warning. Very unprofessional and just plain rude. Never ever using British Airways ever again in my life"
  },
  {
    "reviewDescription": "Every single time I have refrained from writing a bad review thinking the terrible bad experiences with BA might change! This time I realised they don’t care about their customers. Today the kiosks for self check in have stopped working . The staff are extremely rude . 2 hours to fly and there is atleast half a km line for manual check in to fly to Chicago . This is prior to boarding and don’t even get me started on the actual flight time !"
  },
  {
    "reviewDescription": "I've been waiting 2 months now for an update on my compensation claim (flights cancelled, costs incurred etc) and BA have shut their phone lines and do not respond to online follow ups. I'm a longstanding customer (Silver status) and it's just not good enough."
  },
  {
    "reviewDescription": "Appalling. Club class costing a fortune, special occasion, bag lost, no communication, having to chase endlessly. Web and app facilities useless. On phone a lot. Fly with someone else. So disappointed as they have ruined this holiday."
  },
  {
    "reviewDescription": "An acquaintance had a recent bad experience with BA and I have been trying to resolve on his behalf, so far without success. Basically the transatlantic passenger was told in Heathrow that he would have to wait 7 hours for another flight to Manchester because the BA flight he was booked onto was full. The only compensation offered following formal complaint was a £50 e-voucher which is totally unsatisfactory. A month after my detailed response to the complaint outcome, using the correct method, still nothing back from BA despite a chaser. The event was unacceptable, the response has been unacceptable. If BA is your only option I am tempted to recommend not travelling. In the continued absence of any response I have now emailed Sean Doyle (CEO) and Calum Laming (Head of Customer Experience) directly. I still have no response."
  },
  {
    "reviewDescription": "I have applied for one of the BA roles.\nWhat I have experienced has shocked me....\nMy application form was accepted, I passed the assessment test and the next stage is an interview. I booked my first one. We couldn't proceed it as I didn't have a code from Home Office ( I was informed about getting it few minutes before the interview) but I got a link to book my next one. My second interview.....well no-one has joined me. No cancellation before, no apology after.\nStraight away I emailed BA on both available mails\n( one is incase of any technical problems, another incase of questions during the recruitment process - sounds like both in emergency). Two weeks later and no response. Finally I emailed the guy I had my \"first interview\" with. He sent me a link and book my third one. It should be 20 minutes ago. Once again - no links to the meeting, nothing.\nI have lost my time and money ( I am self-employed and every day off is an unpaid holiday). So UNPROFESSIONAL and DISRESPECTFUL."
  },
  {
    "reviewDescription": "I am very displeased with the service and unfair treatment I have received from British Airways.\n\nI had a flight from Heathrow to Accra on 17/09/2024 at12:40 pm which I was refused boarding due to delays in my connecting flight from Belfast city Airport to Heathrow Airport.\n\nI ended up leaving Heathrow on 17/09/2024 at 18:10pm and arriving in Accra on 18/19/2024 at 5:00am. I was delayed for 5 hours, and I wish to claim my due compensation.\n\nMy return flight on 27/09/2024 from Heathrow to Belfast City, scheduled at 09:40 to arrive at 11:00am was cancelled. I was booked on an implausible journey from Heathrow to Dublin, Dublin to Manchester and Manchester to Belfast City.\n\n\n\nI was extremely stressed and stranded so I had to find myself another means of transport home. This has cost me so much and a lot of inconvenience.\n\nIn summary, I was involuntarily denied boarding and my flight arrived more than three hours later than the scheduled arrival time.\n\nMy return flight was cancelled within 14 days of departure.\nAnd I have received an email after two months of claiming compensation that I cannot be compensated. I really need help as soon as possible from BA.\nThanks\n\n\n"
  },
  {
    "reviewDescription": "If I could give zero stars I would. Clearly, this airline has underinvested in almost everwhere. Technology platforms being one of them. I wonder how many people are being scammed and losing money as there system is out dated and full of bugs.\nCanceled a ticket with the 24 hour window, expecting a full refund. But their system, even though I have email evidence shows it outside the window. How can your emails have one time stamp and your system another. BA is an embarrassment to being British.\nCalled, emailed, they keep saying they have escalated to some team and I never hear back. How other airlines have not taken this company down is beyond me. Proboly as they own lots of airlines slots and have a monopoly. On top of customer data breaches, you would think they would be more on top of the tech stack."
  },
  {
    "reviewDescription": "Your booked and confirmed seat.. disappears without notice when BA wants to extend business class seating because some passengers go for an after-booking upgrade. So, BA promise and confirmation cost nothing, zilch, when 100-200 quid is involved. Very British, eh? Need to report to Trade Standards."
  },
  {
    "reviewDescription": "Delayed flights and an old and uncomfortable plane on the longhaul leg of our journey. The moment we boarded the longhaul flight the people in front decided to go to sleep and reclined their seats, so when the evening meal was served shortly after take off we didn't have enough space to eat it. When we complained to the staff the first two said they could do nothing about it as they weren't willing to wake up the people in front of us. Luckily another member of staff was much more helpful and asked the people in question to sit upright until the meals had been served. Once we landed at Heathrow there was a delay while they found buses to take everyone to T5. Just to add to the joy our next flight was also delayed. A grim end to our holiday."
  },
  {
    "reviewDescription": "had future travel vouchers to use, took several weeks and many phone calls to book flights, often after waiting on the phone for an hour plus and moved from one operator to another and always being told that someone else had the ability to book flights using travel vouchers none of whom were competent enough to apply travel vouchers to a flight booking.\nWhen we made a complaint apart from the standard sorry to hear/we will get back soon as we can message we never heard back from them, dreadful service and useless phone operators that obviously are not british based and are not capable of doing the simplest of tasks and on several occasions were extremely rude to my wife who was only trying to book a flight\nWorst airline I have ever dealt with"
  },
  {
    "reviewDescription": "BA Non-Existent Customer Service: Booked packaged Holiday Nov last year (a rebooking of a cancelled 2019/Covid holiday) BA have cancelled the return flight and offered “no alternative”. Despite signposting you to phone or manage booking to make a change you simply cannot on either! Ive made several attempts on all call options and you simply get cut-off! They say they are dealing with higher call volumes … They must all be talking to themselves as no telephone call option is viable. Ive tried all of them! Absolute disgusting customer service (which they say on their telephone recording they are prioritising) HOW exactly? Now I am simply at their mercy waiting for some miracle return flight fix. Holidays & Travel used to be fun :("
  },
  {
    "reviewDescription": "As always an exemplary pleasure to fly with BA, prompt boarding, flight attendance, provision and services as per usual.\nBA1334, left a little late, due to congestion at Heathrow but made up for lost time in the air. Baggage services struggled to keep up with the ship shape readiness of the flight crew and steward staff. Great service on board, attentive in the air and proactive with due care and attention upon takeoff and landing, great connectivity throughout, staff showed an especially personal touch, in keeping with BA’s name and reputation\nGreat flight as always, keep up the good work British airways Joie de vivre\nMerry Christmas and Happy new year. X"
  },
  {
    "reviewDescription": "Bad bad bad.\nWebsite - bad.\nCustomer service - bad.\nChances of booking flights with earned Amex Avios points - bad."
  },
  {
    "reviewDescription": "Sad to write this. Trying to book my first post-Covid trip, impossible to find out where I can fly to from Heathrow on which days.\n\nI'm asking search engines for any day in a specific month, direct flight from Heathrow. I get wrong airports, multiple stops, wrong dates.\n\nBA impossible to contact online, just phone, phone, phone. I want to see my options clearly laid out visually so I can choose, not blethered at breakneck speed by someone whose accent is so thick I can barely understand a word.\n\nNo e-mail address, no online contact form, even an email to the Chief Customer Officer went unanswered. Social media messaging just connects to a useless bot and cycles round pages of useless FAQ's.\n\nAs a result, my expensive airfare next month has gone to a competitor.\n\nWhat a mess, does BA really hate its customers so much?"
  },
  {
    "reviewDescription": "Awful experience, cancelled our return flight and left us stranded. Seeking compensation that they're avoiding now too! I will NEVER fly with them again EVER. Been a 10 year customer of theirs too. Rest of the group will do the same. Seeking airhelp online lawyers to claim from them now."
  },
  {
    "reviewDescription": "Their website and app crash so you can't check in early to select you seats. Their check in kiosks crash making you que to get bags checked and boarding pass. You can't get hold of online customer support, you call the phone number and are summarily dismissed and you have to talk them into doing their job. And their gate agents announce the boarding group then don't let you through. Your checked bags will be ruined. Dumpster fires operate with more efficiency."
  },
  {
    "reviewDescription": "I hope British Airways reads and passes on reviews but I am sceptical. This one is for the pilot of BA 212 departing 31/12/24 BOS-LHR. The landing on the morning of 01/01/25 at LHR was immaculate. And I mean immaculate. I have flown millions of miles. The wind was treacherous, the wings seesawing up and down right up to the moment of touchdown. The pilot timed his touch down so perfectly the wheels all touched at the same time and the plane stayed straight as an arrow (787 is not a small plane!). Barely felt a thing. No bumps at all.\n\nPilots do not get enough credit. This Captain executed to a standard he should be proud of.\n\nBritish Airways have ruined their product over the past decade and have hurt their staff with contract changes, however they manage to retain well educated, well spoken and highly competent pilots. Well done and thank you to our pilot."
  },
  {
    "reviewDescription": "I bought tickets with BA trusting them that I could use a voucher any time if my plans changed. Guess what? The voucher codes BA gave me don't work. I've been trying to call them for months, at times staying over three hours on the phone, and no one answers. When someone does answer, they tell me I need to speak to someone else... who does not answer. I've tried writing: they do respond, and tell me to call. It's ridiculously infuriating. I'm not asking for a favour. That is MY money. Why does BA refuse to let me use it?"
  },
  {
    "reviewDescription": "We were due to fly from Manchester to New York via Heathrow on 27 December. The flight from Manchester was delayed by nearly 4 hours. Given the number of people who were flying on to Newark, BA should have delayed that flight to enable people to transfer. All it needed was a 20 to 30 minute delay to get people through. Of course, that was beyond BA and trying to sort out an onward flight was a very painful experience. BA staff at Heathrow had no idea what to do. As national carriers go, BA must be the worst and we will never travel with them again."
  },
  {
    "reviewDescription": "During a period of poor weather 6th Jan 2025 ( this is me being generous ) - although the flight was not disrupted - I flew from NCL to LHR arriving on time and made my way to the baggage reclaim hall in T5.\n\nI had made sure that I had sufficient time to catch my connecting flight from T2, which I fly regularly each month, upon arrival I was forced to wait 2 1/2 hours for my bags to come from the carousel.\n\nI approached the baggage service desk and was told that we are busy, it's very busy and nothing can be done.\n\nI made my way to T2 after eventually getting my bag but I had missed my connection, I had to book an alternative flight to reach my destination, book a hotel for the night, feed myself and travel to and from the hotel I had to book all because because of BA I had missed my connecting flight.\n\nI was dismissed from BA service desk as \"they couldn't help me because I wasn't flying with a partner airline\" and upon contacting them through their complaints/claims channel I have not received any response whatsoever!\n\nAbsolutely atrocious customer experience!"
  },
  {
    "reviewDescription": "I had booked two business class tickets on British Airways between Heathrow and Cairo I bought them five months ago paid in full and arrived at the airport to see that my seat was business class my partners was put in economy, despite the fact they were both business class tickets . (Is it anything to do with the fact that he’s black?) It is impossible to speak to British Airways office and the staff at the airport are beyond rude and this is the fourth BA flight where that I have taken in the last year and everyone there’s been a problem. The fact they do not let you choose your seat when you book is very telling because you never get seated together, even if you buy the tickets for the same time. The only reason I use this appalling airline is because some of the places I go to they are the only carrier. I usually buy my tickets from Trailfinders first and business , and they have also let me down. I phoned them and they just told me there was nothing they could do, despite the fact that I paid them for these tickets\nBA customer service is a disgrace. It should be illegal for airlines to overbooked flights and to sell more tickets than they have seats"
  }
]