[
  {
    "reviewDescription": "Hopeless, delayed due to lack of staff. Hire car booking office closed now. Same old useless BA"
  },
  {
    "reviewDescription": "After a delayed flight 28/09/2022 case number (23812023) we were informed by BA that we would receive £260 per person compensation, there were 4 people in our party booking , BA told us we would receive this compensation within 14 business days we are still\nYet to receive anything. After around 30 emails and many phone calls we are still waiting 5 months later , the customer care from British Airways has been dreadful , ranging from staff members on the phone been extremely unhelpful, informing us that you can’t discuss compensation claims over the phone , majority of our emails are ignored by British Airways also ! This company is a disgrace and I hope for it to be resolved very soon . Neil Simpson"
  },
  {
    "reviewDescription": "Having flown home from Jordan 18 months ago when BA hadn't loaded breakfast so for the whole early morning flight there was nothing - no hot drinks, no food and the staff decided to hide rather than face their customers.\n\nWe thought we would try BA one more time having flown both Virgin and Emirates most recently and had exceptional service.\n\nBooked and PAID for flights to Portugal back in February. Three days before we are due to fly BA change carrier and offload us onto DAT. If we had wanted to book DAT we would have !!!\n\nIf I treated my clients with this same lack of service and respect I would not have any. Will not be flying BA again if we can avoid it\n"
  },
  {
    "reviewDescription": "What has happened to BA!? It used to be a quality airline, now not even on par with the lowest budget airlines. In flight entertainment doesn’t work, inflight meals are absolutely disgusting with no alternative options unless you state dietary requirements (I’d sooner have had military ration packs - they’re edible) and the grotty pillow given with that hideous cheap scratchy cover - just awful!\nFlew Heathrow - Dubai and back on BA (10-20 Sep) we were delayed in aircraft on the way out, entertainment broke within an hour of take off - we were advised an email would go to head office for our cabin section and we’d all be comp’ed as it’s a known issue - I won’t hold my breathe.\nOn the way back I was told there were absolutely no sweetners on the flight at all - twice, so I skipped it, we asked the other girl on the same trolley on the next drinks round and she handed me 2 sweetners from said trolley. Seems trivial but I just desperately wanted a cup of tea and have blood sugar issues and the first girl just couldn’t be bothered to check her own trolley for some.\nAll passengers then got a text to advise our bags ‘may not be on flight’ ours were not - waited at the carousel for a hour until we had to give up and head home.\nTook an unbelievable amount of faff over BA app, website and external websites as well as a call to BA to log our lost baggage. How can you be getting your online service so wrong!?\nTook 48hrs for both of us to be reunited with our bags, it’s just dire.. BA let us down in so many ways just a truly horrible experience."
  },
  {
    "reviewDescription": "The worst airline by far. Had a 3 hours flight to land in Heathrow instead because of rain we have been diverted at Stansted ( ok this happens) a they took us to Heathrow we’re we seas locked for 55 min due to luck of staff . No one could tell why and when . They kept saying someone is coming. The worse part when they came the somehow managed to brake the Jetty that connects to the terminal. No love updates when will this be fixed . Don’t fly BA the worse experience of my life"
  },
  {
    "reviewDescription": "Hopeless Customer Relations. Completely useless and probably breach every single official guideline.\nI have had an outstanding refund claim with BA since March 2023 and concerning a small amount of money connected to seat bookings.\nBA have agreed and upheld my claim in writing, but still no action/refund. Nothing.\nI suspect that I will have to wait another 18 months before anything useful happens.\nEven thinking of going to the small claims court (or whatever it is called these days), just to make them listen.\nIt is a small amount, but a matter of principal now.\nThere was a time when BA was a premier outfit, sadly it appears they simply do not care.\n"
  },
  {
    "reviewDescription": "Terrible experience with BA. Went to cairo that was a 4.5 hour flight and provided no food except a packet of crisp and a small bottle of water. No menu provided, hardly anything to buy to eat. When coming back from Cairo, we were forced to book all our hand luggage because there aircraft 'was full'. Aircraft also was late for take off both ways. AC was on in the aircraft but BA still cant afford to give blankets and we were freezing. I think easyjet and Ryanair can compete well BA. Atleast they are able to provide a menu for food you can buy and actually have decent food choices. BA can't afford that. Sorry but it's better for me to be honest."
  },
  {
    "reviewDescription": "I recently flew to Tokyo and back with BA and found everything to be excellent. Although there was a slight delay in taking off from Heathrow, I found both journeys to be unexpectedly enjoyable for a long haul flight. I couldn't fault the staff on board who were friendly, polite and helpful throughout. I think people generally only leave reviews here if they are dissatisfied, hence the low scoring, but there are some very good experiences too."
  },
  {
    "reviewDescription": "I had a business class flight to Delhi from Manchester via Heathrow cancelled 10 hours before departure in July this year. After chasing my compensation for 5 months, I last week received my very first communication from customer services denying my claim. My flight was cancelled due to ‘bad weather’ (it was a glorious 21 deg, calm summer day) and so the cancellation was out of BA’s control and compensation is not due. I did suggest the reason for cancellation I was provided with was a mistake, especially as a colleague travelling on the same flight has already received his compensation however this again was denied. BA have now closed my complaint as they stand behind the decision and there is no further dialogue necessary. I have been patient, courteous and calm so I can only conclude this is now BA’s MO. Keep denying, openly communicate untruths, and eventually the customer will give up. I’m embarrassed this organisation is our flag carrier. If you can use an alternative, even if more expensive, it’s a much better choice."
  },
  {
    "reviewDescription": "Scum of the skies.\n\nBooked flights to Zanzibar, had to cancel due to health reason. Told non refundable but terms never sent or explained at time of booking. Won’t even offer a voucher, so they’ve effective stolen £2k from us despite 4 months notice of cancellation. Avoid at all cost.\n\nPreviously they also issued vouchers for flights that we paid for but to the passengers, rather than to us. That was another £500 we lost due to their incompetance."
  },
  {
    "reviewDescription": "What do you get as a premium economy ticket holder on BA. On my flight to Tenerife, my outward journey. The wifi service which you are required to use to purchased refreshments did not connect. When I requested assistance from the flight attendant, I was told to keep trying. After an hour of trying, they sold me a drink (by-passing) the system. On my return flight the same thing happened but I was told there was nothing they could do and I was left without a meal. There was also an argument between 2 passengers and the attendants where nowhere to be found. I pledged not to use BA year ago and this is a reminder why. I didn’t want to use a budget airline because I wanted good service. Over priced and still after all these years, poor service. I will only use BA if there is no alternative."
  },
  {
    "reviewDescription": "Avoid flying with BA. Was told I would get a full refund on the phone for my cancelled flight from Amsterdam to London.\n\nThey then sent an email saying that they were not going to refund me as the weather was bad and they couldn’t fly.\n\nI managed to get to London on the same day with EasyJet. Clearly states on their refund policy that a full refund will be given of the flight was cancelled 24 hours before take off.\n\nLol they sent a notification on the app 3 hours prior to take off. Absolute joke of an organisation.\n"
  },
  {
    "reviewDescription": "BA lounge at Edinburgh airport opened Kate. Ladies toilets a disgrace filthy floors and sanitary equipment overflowing and bagged. Toilets coming away from walls.... really terrible standards!"
  },
  {
    "reviewDescription": "Service on plane from Barbados was excellent today however we are having to wait over an hour for our luggage when it is supposed to be priority which is just unacceptable - it appears it is only the priority bags that are delayed - this is not the first time this has happened at Heathrow so my advice is remove the priority tag on your luggage if you want your bags early - clearly BA have no influence over baggage handling at terminal 5"
  },
  {
    "reviewDescription": "My flight was cancelled so I contacted the call center wait an hour to be told go to website. Went on the website to be told to phone the callcenter how ridiculous."
  },
  {
    "reviewDescription": "Worst experience flying on British Airways flight and Heathrow staff. Not recommend anyone flying on British Airways from USA and from London. Please use a different airline to fly into Hyderabad, India.\n\nInflight services are horrible … would not recommend to anyone"
  },
  {
    "reviewDescription": "Flew from London Heathrow to Marrakech. BA changed our pre paid seats at the last minute and charged us to select other seats. Customer service was appalling. Boarding was chaos. Staff demanded some passengers put their hand luggage in the hold. I had one small bag and this rude member of staff was ignoring others who had 2/3 bags and many with large bags that were obviously too big for hand luggage. Flight was late taking off, the snack was a measly tiny packet of cheese pretzels. This airline is rapidly going downhill."
  },
  {
    "reviewDescription": "booked flight to india canceled in erroor phoned ba within seconds flight could not be reinstated lost 2000 pounds told i could re book origional seat at a cost of 7000 pounds appaling service robbers"
  },
  {
    "reviewDescription": "I am completely shocked at how this is being handled. Our flight was cancelled 1 hour before take-off, with no explanation of why are what to do. As it was late in the evening everyone panicked and spread out to get a nearby hotel and grab their luggage. Our replacement flight given was for 6:30am the following morning and had gone from a direct flight home to now stopping over in Madrid. But I understand sometimes flight cancellations are completely out of control and we went along with the adventure. The replacement flight we were given when trying to check-in said “Check in status unknown - we could not get your e-ticket number so are unable to determine your check in/boarding pass status. Refresh the “my bookings” sceen and try again.’ We only had 3-4 hours sleep as we had to be at the airport for 4:30am, we had tried several times to check in through the app and were unsuccessful, we then went to the check-in desk and were met with VERY rude staff who told us there was nothing we could do and that we were not showing up as on the flight, and that we would have to ring BA to solve the issue. Bearing in mind it was 4:30am and the British Airways phoneline was not open until 9am. If you think this is a fair flight replacement, making us wait 5 hours in a foreign country waiting to speak to someone on the phone to then probably having to wait another 2 hours to be re-booked onto a flight, then British Airways customer service has completely lost all value and meaning.\n\nI do not accept the response from BA, making me go through my insurance. This was your fault, your system failed us and this needs to be looked over again. They keep saying we were offered a replacement flight, BUT WE DID NOT EXIST ON THE FLIGHT WHEN TRYING OT CHECK IN. So NO, you did not meet your own terms and conditions, we had no choice but to purchase our own flights just to get home after already dealing with a cancellation before.\n\nThe response of “If you decide to make other arrangements the contract of carriage between you and British Airways is terminated. This means we’d no longer be responsible for the expenses you had as a result of your original flight being cancelled.” This statement would be valid if our check-in had work and the replacement flight had been processed correctly, but in this case where your system and your staff left us in a position with no help, what on earth where we meant to do, I would have loved to have been given some guidance by your staff other than ‘sorry you will have to ring BA we cant help you’. I know for a fact this is a British Airways error, as there was other families with the same issue, one man had to repurchase the same flight, there was also a family of four that could not afford to repurchase 4 tickets so in result were left stranded for god knows how long. So I cant imagine you will be saying the same that there was “nothing you could do.”\n\nOnce we had eventually landed back in England, I spoke to a lady at the BA customer service desk and she agreed at the horrible situation we had dealt with and that we were completely entitled to a full refund. Why the hell would I purchase two flight tickets for the same bloody replacement flight, theres absolutley no benefit for me doing that. You did NOT uphold your promise in getting us home, so you will reimburse us.\n\nIt’s now been over two months since the cancellation and the back in forth i’ve had to deal with through your customer service is a joke. We were not looked after as customers after booking a BA holidays package, the panic and stress we felt at the airport when we told we did not exist as passengers on the replacement flight was unaccepatble.\n\nBe warned, if you think you are covered just because you’ve booked a BA holidays, you are not. They do not care one tiny bit. I am now down £1100, but I will continue to shout and fight my corner."
  },
  {
    "reviewDescription": "This airline is a disgrace. I had a simple return trip from Aberdeen to Paris with one connection through London each way, and every one of the four flights were either delayed or cancelled for various reasons. Standards in this company are worse than budget airlines - better off taking the risk flying with them, I'll never choose BA over any alternatives in future."
  },
  {
    "reviewDescription": "BA overbooked the flight from Rhodes to Gatwick by atleast 9 people. Our family of 4 were split down the middle. I paid for business class flights out of our life savings because our son was representing England in a major event. BA just didn't care about how much we paid, what we did for our country or who we are as people. Totally Totally disgusted. Sean Doyle just another sociopath for his own financial gain.\n\nHorrible and remote people who have no respect for customers. Don't bother with any Avios because it is a total scam.\n\nIf anybody has a problem with this review I will gladly take it to court"
  },
  {
    "reviewDescription": "My husband and I booked a holiday via British airways- we felt it was not described properly and had lots of issues whilst there. Upon returning we have complained via email and online booking form as there isn’t anyone in the customer services team to talk with over the phone. We did this 2 weeks ago and are yet to hear a response. We feel that this is disappointing considering this is the first time we have booked with this company and the fact it states they have an award for customer service on their website. I feel there should at least be a person to discuss things with and be more personal than email or online forms. I think we will stick to virgin for our future trips."
  },
  {
    "reviewDescription": "I took flight from Istanbul to london by BA. flight was 4 hrs delayed. every time I use british airways flights are delayed. pathetic service. rude air stewards. avoid at all cost."
  },
  {
    "reviewDescription": "Just more awful service from BA.\nThey cancelled our flight from Barcelona to Heathrow but didn't bother informing us. Luckily we checked just before getting into cab to go the airport.\nObviously late notice means alterative are limited and expensive.\nContacted BA who just can't force a 'sorry' out.\nThey really are just a sad imitation of their old self"
  },
  {
    "reviewDescription": "Horrendous service from British airways customer service Dept. After 9 separate calls to the call centre each putting me on hold over 40mins and then to be told you have the wrong dept! Then to be given the same number to call again!!! All I want is my refund for my evouchers British airways!\nI am a single parent and £1800 is alot of money for me not to worry about! Can I please speak to someone in the UK that can actually help me!"
  },
  {
    "reviewDescription": "Flight from London Gatwick to Doha in business class.\nThis was my first time flying business from Gatwick airport and the experience from BA was fantastic. I love the lounge in Gatwick, which had a great atmosphere and I love how it is over two levels with views of the runway.\nThe flight was during the day and landed at 23:45 in Doha. The seats were very comfortable and the service by the flight crew was amazing. Keep up the good work BA!"
  },
  {
    "reviewDescription": "Website and customer service are just shocking, even the budget airlines with a bad reputation are miles ahead of the so called 'flag carrier' airline."
  },
  {
    "reviewDescription": "Ever worse. App doesn’t recognise flight. Website takes 11 (!) minutes to check in but won’t send boarding pass to wallet. I think they’ve decided to abolish all customer service. Fly elsewhere!"
  },
  {
    "reviewDescription": "Used BA to fly to Egypt for a two week holiday. We left on 18th December but our suitcase never left Terminal 5 Heathrow. Did not see it again until it was delivered to our home on the 9th January. After an enormous amount of inconvenience, frustration and expense BA will offer us nothing in the way of compensation. We now have to go to the trouble of making a claim through the CEDR Foundation. British Airways used to be a great company, but no longer. I just hope that their plane maintenance staff have a better attitude.\nThey should not be allowed to use the word 'British' in their name, it just brings more shame to our country. They also changed our seats, which we had booked and paid for, without a word of explanation or apology.\nWe have flown with many airlines, hard to think of a worse experience than with BA."
  },
  {
    "reviewDescription": "Flew Edinburgh to Barcelona via Heathrow. Worst experience ever. Vowed never to use BA again but unfortunately was part of a cruise package. Waiting 2 hours to check bags in London despite online checkin beforehand. Then lots of us told gate was closing!! Staff nonplussed despite all connecting travellers. Will very use again and still have evoucher that won’t be used. No apology and sour faced, overworked ground staff"
  },
  {
    "reviewDescription": "I specifically booked a long haul flight to Singapore with British Airways because I thought I could rely on them to provide good and reliable service.\nUnfortunately this wasn't the case hence this review. And seeing their rating at 1.3 on Trustpilot makes me understand that I am not the only unhappy customer.\nKnowing I would be able to fall asleep watching movies or TV shows on their in flight entertainment system was something I was looking forward to on this overnight flight. However, my console didn't work and instead I had a loud screaming toddler in the seat behind me that kept kicking my seat and some babies in Front. Only two hours into this already hell of a journey were we told that we should buy the WiFi pass for which we will get fully reimbursed.\nI followed up several times throughout the flight with the cabin crew who assured me they will take a note of my seat number and someone from customer service will contact me with reimbursement. This wasn't the case. After waiting for several days I contacted them myself and instead of the 21.99 reimbursement that I can use towards a nice meal on holiday they've given me 5000 AVIOs... What actual BS. I never want to fly with them again so why give me service points when I was told my cabin crew I would be erfunden...the only reason I even bought this WiFi pass as it's not even good enough to watch anything with because the connection quality is so poor. What a waste of a flight and £22. These are 14 hrs of my life I will never get back and forever remember. I will remember BA as the brand that once was that no longer is. Their cabin crew seemed overworked and overwhelmed and even when you pressed the attention buzzer no one came. If you can avoid booking with BA go ahead. Fly with the competition."
  },
  {
    "reviewDescription": "Usually avoid BA because of past experiences and that they have a high cancellation and poor customer service record. Just tried to book a seat, happy to pay but that’s irrelevant. You have to wait until check in 24 hours before when BA allocate you a seat. Only then can you pay to change the seat subject to availability. Useless to us as we’re a party of 4. This is why we normally fly Virgin Atlantic to Miami as you can choose seats free of charge as soon as you’ve paid so months before. I detest BA."
  },
  {
    "reviewDescription": "After a year if trying to get money back from ba for a cancelled flight from munich to gatwick they finally responded with a classic the weather was too bad to fly.Funny British Airways- no other flighs were cancelled the sun was even out. After phoning for hours with no answer im 800 pounds out of pocket.Last time ill ever use BA again. Bunch of thieving amatures."
  },
  {
    "reviewDescription": "An utter disgrace of a company. I don't have the energy to give any further details. It is virtually impossible to speak to a human being to sort out the mess made by BA."
  },
  {
    "reviewDescription": "BA cancelled our Orlando to Gatwick flight due to some crew availability issues!! We did get put on the next available flight the next evening but we had a connecting flight (still BA) that would need changing seeing as they cancelled our first flight but they said they couldn’t transfer that flight and made us pay which we should get refunded. They are now trying to blame the global IT outage for the cancellation and won’t give us a refund. Extremely bad customer service. AVOID AVOID AVOID"
  },
  {
    "reviewDescription": "Sono stufa di non riuscire a fare check in on line, sono diversi mesi che il sistema ha problemi, il sito non funziona.\nIn qualche caso riesco a farlo all’ultimo momento, oggi ad esempio non funziona nulla quindi dovrò fare il check in aeroporto, quindi debbo arrivare prima!!! Nessun altra compagnia ha questo problema. Ne terrò conto."
  },
  {
    "reviewDescription": "Customer service is non-existing. If you have a problem, forget about having anyone helping you solve it. You are left by yourself. You can try contacting them, but you could as well talk to a bot. Why bother calling and waiting long time to talk to a human when all you can get is someone who can only repeat vague sentences written on their site. Stay as far as you can from them or keep in mind that if anything happens, your time and money are irretrievably wasted."
  },
  {
    "reviewDescription": "What an absolute joke - email states £39 flights to Europe!! For example, a return trip to Malaga from London starts from £700+!!!!!! Get a grip BA or you will suffer the consequences when we all abandon you or is it the ‘woke’ green lobbyists who just want to stop everything and close all air-related businesses and put our country into even more of a financial mess!!"
  },
  {
    "reviewDescription": "For such a so called “prestigious” airline they have fallen VERY short on my experience from St. Lucia. Cancelled our flights back to the uk due to “lack of staff” put us up in a horrible hotel till they could get us back. Never had any clear answers on what was going on with the return flight home, or when they plan to get us home! Finally from originally leaving Saturday pm we leave Monday am. Make it back to Gatwick and they completely destroyed my suitcase!! Worst flying experience I’ve ever had with any airline"
  },
  {
    "reviewDescription": "BA used to be the best airlines in Europe but now it's slipped to be one of the worst. It has the most outdated IT system which is prone to booking and check-in errors, they have non existent customer service, poorly trained staff, luggage goes missing and flights are always delayed.\n\nWe flew BA recently to Naples from London for a honeymoon and will never fly BA ever again. We arrived for check-in 2hours 30min before the flight and queued for over an hour until there was only an hour left before boarding. Once we were prioritised at the check-in counter we then found out the flight was oversold and we would not be getting on the plane. A cascade of errors would then ensured we would miss the next standby flight 6 hours after our original flight. So we waited for another 3 hours to be put on a flight 9 hours after we were originally scheduled to fly. We had paid deposits for restaurants, taxi pickup, hotels in Amalfi coast which all had to be cancelled without refund. I submitted a claim for compensation given the delay, as is my right in the UK, but the case was closed as the system showed incorrect information: it showed the flight we ended up boarding rather than the original flight we were originally supposed to board. It showed a delay of 84min rather than showing the full picture of us being denied checkin, refused standby for the next flight and having waited over 9 hours at the airport. It seems BA is refusing to accept responsibility for their own error and is also refusing to compensate us. Absolute disgrace of a national airline. Never flying them ever again."
  },
  {
    "reviewDescription": "I fly more than one BA long haul flight on a monthly basis. Being an Executive Club member you would think BA will actually appreciate the business. Every time I fly there is a problem with the update of my points onto my Executive club account. I constantly have to phone, provide copies of my boarding passes ext. Most frustrating of all is that every time you speak to someone they say it will be fixed in 7 - 10 days.\nIt seems as just another scam and way BA try and entice people to fly, they don't really care about their customers or keeping regular customers happy.\nWill just need to take my business somewhere else.\n"
  },
  {
    "reviewDescription": "Terrible service. Flying back to London from Heathrow on the 19.05. BA messaged that morning to confirm that the flight was cancelled and would not be until 10.40 the next day! No offer of support just a note to inform us that we MIGHT be able to claim for expenses. Had to book our own accommodation for the night. Next day the flight was further delayed. Finally got to London at around 23.00 . Had to book another hotel. Delayed luggage got to an hotel at Midnight. No one on BA assistance desk. We missed our train to Cornwall and had to hire a car. BA not interested in any consequential loss. Terrible airline that should not be allowed to carry the flag. Not even British owned. BA no way. Avoid"
  },
  {
    "reviewDescription": "BA changed the time of my international flight from Johannesburg to London to one hour earlier and just cancelled my internal connecting flight at 18:45pm. I had booked the internal flight at 18:45pm because I could then get a JHB Flight back to London at 10ish pm. I booked premium economy the BA changed the JHB to London flight and just cancelled my internal flight. I called them and they said they could give me an 11:15am flight from Durban to JHB I said no I had booked a 6pm internal flight to give me as much time as possible in Durban. They said no other flights. I said there is a 4:30pm flight they said not on their system. I called again and said I don’t understand why could not be on the 4:30pm internal flight they said no flights available. I then did research and phoned them up and said I would like to cancel my internal flight and book with Safair then they told me I could book an internal flight at 4:30pm for £180. I still do not understand why I had to pay any money to change a flight when they just cancelled my flight then misled me by telling me that there were no internal flight available when in Fact there were and I only discovered this after paying money to the BA customer services person."
  },
  {
    "reviewDescription": "Recently flew home from Malaga on the rented Finnair wreck. This was the worst plane I have been on since the demise of Dan Air. Filthy dirty, uncleaned tray tables, seats with so much gunge down them that any bacteriologist would have a field day. If BA are in such dire straights that they have to rent planes surely they can make sure that the planes are at least clean rather than totally unfit for use. We flew Business Class but got cattle class. I've raised a complaint with BA but they've got so many complaints they can't deal with it."
  },
  {
    "reviewDescription": "Hideous experience with British Airways trying to order an online meal. First of all trying to do it online. I couldn’t. Every time the screen said enter your Flight number it wouldn’t allow me. No explanation.\nI phoned up using a number of press this press that options until I got a human. After taking my details and verifying them, he said he couldn’t take payment over the phone and suggested that I do it in line. I gave up. What a pile of crap."
  },
  {
    "reviewDescription": "BA service I received is absolutely disgraceful! I had a flight booked and confirmed back to UK from Nairobi. I was one of the first three people in the queue at check in. I was advised I've been out on standby and would not be getting on the flight because BA overbooked. Long story short I was advised I have to get on a flight 24hrs later. When asked what do I do now I was asked to wait. I waited from 6pm until 12.30am in the airport for the staff to arrange somewhere for me to stay. I asked if I could go sit in a lounge as I had been waiting but I was told to wait or go find a seat in the airport. I asked for water as it was a hot country and there were no shops inside the airport to buy a drink...I was told we can't provide this. So you left me standing for over 6 hours with no seat or water. Now I have tried to claim compensation which I was advised to do by the BA staff I have not heard from BA for two months despite contacting them several times and asking for an update on my claim. I was advised call back next week if you don't hear anything but I should get an email...I didn't hear back. I called customer service and they keep telling me they can't do anything."
  },
  {
    "reviewDescription": "Website freezes or ‘oops something went wrong’. Trying to book a long haul flight and once I’ve put the details in and selected my flights all I get is a permanent ‘give us a moment, we’re calculating your price’ or ‘oops something went wrong’\nI have a voucher I want to use and I’m an executive club member so would rather use BA.\nCome on BA - if the website won’t let me book, things are seriously bad."
  },
  {
    "reviewDescription": "I flew with British Airways to Zurich with a Samsonite suitcase that was in excellent working condition, when I received the case at the airport the telescopic handles was completely smashed off.\nThe damage sustained was extremely severe and has been sustained through extreme force caused by the negligence of the process and / or the operators and as such the case is now deemed as unrepairable and scrap. This resulted in me having to carry a 20kg+ case around to 4 different hotels, as well as trains and airports. I submitted a claim and they offloaded me to K2 Global who offered a poor substandard replacement. I accept that my case was not brand new, but I explained that my case was good for another 10 years, so why should I accept a non like for like case. Their response was to suggested I claim via my travel insurance! I directed my complaint back to BA and was met with a similar lack of ownership. I asked for the replacement case to have a non zip locking mechanism same as my previous case which would have cost them an additional £16 - they refused! Again when I rejected this they directed me to my travel insurance to underwrite their incompetence and negligence. Their customer service team lack any grasp of the concept of customer service, do not read e-mails correctly and would rather antagonise a customer rather than take an easy solution of paying an extra £16."
  },
  {
    "reviewDescription": "Constantly late, running out fuel, flights cancelled without explanation or apologies"
  },
  {
    "reviewDescription": "BA cancelled my flight 3 days before it was due. Did I get a refund automatically? No, I have to call them. I tried several times holding for up to half an hour each time. Finally, I got through only to be disconnected. No one called me back (and many decent companies do). Disappointing"
  },
  {
    "reviewDescription": "Booked Heathrow to Cape Town World Traveller Plus (Premium Economy) was told at airport we had been downgraded due to the Cabin being overbooked by 9 people! We booked the flight 11 months in advance & Executive Members. This should not happen to any passengers regardless of the Cabin booked, no one at BA could or was willing to explain how they select passengers to downgrade. Won’t use them again, better service from other European & particularly Middle East airlines."
  },
  {
    "reviewDescription": "Great flight experience - love their staff, they are always so helpful and polite. We upgraded on the way to Vegas and they were so good to deal with.\nOne star down because you cannot get hold of the right people to speak to on the phone if you book a BA holiday - it's an hour of your life you don't get back, and often they can't help. Wish you could manage your holiday better online -then I would travel more."
  },
  {
    "reviewDescription": "I had to cancel a flight booking in April, due to possible covid exposure. A month later the requested voucher had not been issued and I had no choice but resort to calling the airline to book a new flight.\nIt has taken two and a half hours on the phone to complete this process. My email address and registered address were checked twice, my card details also taken two times. I had to ring about 15 times to speak to someone, since in most cases the queue was deemed too long and the connection dropped.\nAll this could be avoided if their computer systems and website simply allowed me to rebook with a voucher code.\nDon’t companies want us to do things online and save on call centre costs???"
  },
  {
    "reviewDescription": "Having lost our golf bag whilst on a golf holiday contacting BA’s customer service was terrible. Everything is online and even when we eventually spoke to customer service agents they were hopeless and not very helpful and hung up. We asked to speak to someone in charge And they could not escalate. We are now into the 11th day of our golfing holiday and BA have still not located our golf clubs. Very poor don’t care attitude and the inability to speak to a supervisor or someone in charge is frustrating and not what is expected from what used to be a first class company and UKs so called flagship airline"
  },
  {
    "reviewDescription": "After I entered my credit card the BA website said \"Unable to process transaction, please try again\" So I started again,entered credit card info again and get the same message at the end. I looked at my card account and the fare had been charged twice. They have taken two identical bookings. There's helpline available after 8.00pm, so I use the chat function. After waiting about 20 minutes, I get asked a series of questions which make it look like there's a scammer at the other end (eg asking for email and credit card info) I get put in a queue. Finally, almost 40 minutes later, I'm down to no 3 in the queue and then it stops moving and then logs me off. An entire evening wasted. Swimming across the Atlantic would be more pleasurable than engaging with BA."
  },
  {
    "reviewDescription": "Booked to fly with BA from heathrow to san francisco and they delayed then cancelled both the outward and return flights! Try to rebook flights was a nightmare and their so called customer services were totally useless. They caused us great distress and anxiety and we will never fly with them again. I have flying for over 49 years and this was the worst experience ever. Ended up flying with united and virgin. Terrible airline who has zero accountability or regard for passengers!!"
  },
  {
    "reviewDescription": "I have not travelled yet but am heading off to the USA business class in March. The flights are not cheap! I went in to book seats to find out that even in Business Class you have to pay extra to make sure you can sit with your partner. This is outrageous."
  },
  {
    "reviewDescription": "Finally managed to get through - after multiple attempts!\nMy Mum was due to fly and she had a heart problem. BA instructed me to cancel and receive a £176 refund (from a £400 flight) or send a Drs note in for a 'credit note'. The Drs note didnt arrive in time, so I then had to cancel, by which time they reduced my refund to £49?! I sent an enquiry as to why and they simply ignored me. This was 3 weeks ago.\nJust shocking...I will avoid BA in future as this is the second time they have given me non existent customer service."
  },
  {
    "reviewDescription": "Two connecting flights. First cancelled, replacement delayed; overnight in terminal; second leg delayed 4 hours.\nClaim submitted one month ago; website gives no help as to timescale \"Telephone numbers\" directs you to a screen which states \"to make a claim fill in the online form\".\nAbysmal \"service\". Would give zero if that were possible."
  },
  {
    "reviewDescription": "Have now been waiting for over a year for compensation for halving to wait for 24hrs to get a flight from Heathrow to Newcastle , was denied boarding on 3 flights in one day."
  },
  {
    "reviewDescription": "I had booked a flight for us four family members in January to fly from Heathrow at the end of July to LA with British Airways. Now I received an email that my flight got cancelled and I can rebook online or via phone +443444930787 at this number. Now this phone line says we are too busy, call us another time. How cruel, unprofessional, and profit-driven this airline is... ?? Very sad for us. Dont know what to do?"
  },
  {
    "reviewDescription": "Nada funciono como deberia. Saque mis pasajes con un año de anticipacion. 6 horas antes del vuelo de ida Buenos Aires-Londres, nos avisaron que cancelaban el vuelo. Nos reprogramaron para el dia siguiente con otra aerolinea y con escala en Roma cuando yo habia pagado por un pasaje directo. Cuando llegamos nos perdieron el equipaje, una parte aparecio a los 3 dias, otra parte nunca llego directamente. 24 hs antes del regreso intentamos hacer check in on line y la pagina web no lo habilitaba, llegamos al aeropuerto y estaba sobrevendido el vuelo, nos dejaron abajo. Nos enviaron a un hotel espantoso sin agua caliente y ni aire acondicionado, y nos reasignaron para volar al dia siguiente. Nunca me senti mas maltratada en mi vida. No viajen con British."
  },
  {
    "reviewDescription": "Joke of an airline. I would give no stars at all. Book with BA at your peril! Flight cancelled on day of departure for a 3 night stay in Rome. Alternative indirect flight offered meant we would have only had approximately 36 hours in Rome due to return flight times (assuming of course that they didn’t cancel that too on the day). Zero help from ‘customer service’ on phone or at desk in terminal. To top it all off we were then approached by a BA representative & asked to not swear in the terminal! Let me tell you I really wanted to swear at the person on the desk for their complete non help & attitude, especially when told that this happens to many people frequently & we just need to deal with it- wow just wow, but I did not swear once at him, I’m appalled, disappointed and disgusted at the service from this airline. Since found out this has happened to SO many others & seems to be becoming more frequent. Lack of any responses to messages on here speaks volumes."
  },
  {
    "reviewDescription": "Booked a 6 day dream vacation with British Airways Holidays in Andalusia. They put me on a Vueling Flight. The outbound flight from Gatwick was delayed 4 hours while we waited for inbound flight. No apology or emergency refreshments offered. Arrived in Seville at 9 pm to find that they/Vueling have lost my luggage along with 10 other family groups. I sit in my hotel room in my boxers. Goodness knows what I’ll wear tomorrow or whether my luggage will arrive. Dream holiday for wife and I ruined but BA Holidays need to take responsibility for their partner airlines. Vueling appear to be a shambles.\n\nNext day our hotel rang Vueling late afternoon and discovered cases had arrived but Vueling said they would not deliver to our hotel and we had to go to airport to collect. Anyway bags arrived albeit 24 hours late. OK for us as we had hired a car but what if we had not?"
  },
  {
    "reviewDescription": "There is an sudden reschedule of my original flight which made my journey so horrible. Had a worst customer care experience when I checked about my flight delay.No proper response from Customer team.\n\nDon't travel in British Airways"
  },
  {
    "reviewDescription": "A disgrace. The customer service does not care. Cancelled my expensice flight to put on the cheapest one of course after waiting more than 3 hours at the airport and gives me 10000avios (equivalent to 50GBP) for a price difference of more than 100GBP. Nothing for the delay waste of time ... 4 weeks later still no reply."
  },
  {
    "reviewDescription": "Paid £20 to reserve seats. Booked the flights the following day and was told the £20 would be refunded. It was not refunded. Several phone calls to customer services resulted in a similar promise but no refund materialised. Made a complaint which after 2 months got closed with the result saying I have been sent an email. Of course no refund and no email. Appalling customer service"
  },
  {
    "reviewDescription": "Shocking, cancelled a flight, no customer services, no one to answer a call, no care no concern.\n\nThey can book us on to alternative flights that mean we loose a day of holiday, and if you don't like that they don't care. So change the air port, change the air line, change the times, throw all plans in the bin, even flying back to a different airport so can't park there, and BAs response is NOTHING.\n\nDon't like it? don' t care. Doesn't suit you? don't care. Spent your money, don't care.\nCompletely contemplable, I wondered why they stopped advertising as the world's favourite air line but never expected to find out first hand in such a horrific manner.\n\nAnd can't even tell them because THEY DON'T CARE"
  },
  {
    "reviewDescription": "I was shocked, stunned and then really angry at the so called business class flight from Heathrow to Istanbul SAW on weds 21st Jan.\n\nThe cabin area was grubby divided by an awful piece of cloth from economy..\n\nFlying out .No cushions . No blanket. No video screen. Disgusting toilet. The most awful tasting food ( breakfast time). Service was not good. No tray in the middle seat. Wi fi did not work\n\nIt was just bloody awful.\n\nWhen we came back from Istanbul ISTA on weds 31st Jan at 14.55 PM local time, it was a much better service level and a completely differrnt experience.\n\nThere were blankets. Cushions. Service levels much better and as expected. Food was better. Drinks offered more often. Table on dividing seat ..\n\nIf u got proper business class then it wud of been a good deal but only got a different service 1 way instaed of 2 ways.\n\nVery disappointed. I have to go again in may but am now apprehensive to us BA"
  },
  {
    "reviewDescription": "We booked a flight from Heathrow to Nashville on Friday 22nd September using BA's own Avios scheme to pay for it. We duly arrived at the airport, checked in and went to the gate when flight was called. No plane on the apron! They made a few announcements that the plane had a technical problem then, an hour after the flight was due to leave, the flight was cancelled.\nUnder the current legislation BA have to get the passengers to their destination as soon as possible, even if it means using a rival airline. So, for the passengers who paid for their flights in currency they found them split flights using BA on the first leg into the USA and their Americal Airlines partner to fly them on to Nashville on Saturday 23rd September. However, if you paid by Avios they completely ignored the regulations and said we had to fly on the first available BA direct flight, which was on Sunday 24th September, a day after everyone else.\nClearly if you collect Avios then use them to pay for your flights you are a third class passenger, at the bottom of the pile.\nAdded to this my wife and I are both in our 70s yet BA decided to sit us on separate rows, one behind the other, on a nine hour flight. Totally unacceptable.\nI tried BA's so called customer services department to make sure we were sat together on the replacement flights. Surprise, surprise they don't deal with that, I have to call the executive club. I called on the number shown on the link they sent. THEY AREN'T TAKING CALLS!!!. It would appear that they have been too busy to take calls since before the Covid epidemic. BA's treatment of customers is abysmal."
  },
  {
    "reviewDescription": "I've been trying for months to phone BA with a query that can't be solved on-line. Do they ever answer a phone?"
  },
  {
    "reviewDescription": "Travelled business class to Boston in April and tried to claim by miles at airports. No can do. So tried via online when I returned. Still trying. Messages say too busy to respond, I have booked recent trips with competitors, as most airlines like loyalty. Shareholders should be aware of this. When I do call, I get told they are very busy. This doesn't interest me as a consumer spending lots of money on flights. I think chairman AND ceo Sean Doyle believes it is best to emulate Ryan Air"
  },
  {
    "reviewDescription": "We booked a flight 6 months in advance to find out 6 weeks beforehand that they cancelled it - no reason whatsoever. Instead they automatically put us to a flight the following day in the afternoon thus losing us a day and a half of holiday and considering it was a Thurs-Mon trip this messed up our plans. We’re disappointed with the service and the late cancellation, we feel we’ve been mislead."
  },
  {
    "reviewDescription": "Stress, anxiety, last minute rush, 2 cancellations, panic...that should have been an holiday so to get back to work re energised..\n\n\nManchester - Bridgetown on 4th July was cancelled 3h ahead if departure by a text that woke me up at 2am...I wonder why such a last minute, and regardless , it effected my peace and haelth\n\nThis created extreme panic, lack of sleep, a taxi to get replacement plane (i found a way around it, after a good hour on the line), and consequently ruined my first 2days of holiday in barbados\n\nSimilarly, on the way back a text cancelled the London- Manchester portion of the journey. Similarly as before, whikist on board on my first leg of the journey.. .rebooked to that day after...I would have stayed a day more at barbadis instead of stranded in an airport if I was told earlier\n\n\nSame feeling. And needed to buy another train ticket for that new arrival time.\n\nOnce arrived in Manchester, they lost my bag, probably cause they rushed with re- arranging us cause of the cancelled flight.\n\nIt had on all my belongings I needed for work and outings etc.\nSo lots of panicking and now I really don't know what to do next...\n\nIt is just not fair.\n\nIt is OK to mess it up a bit...but so many times and in so many ways...\n\nI am left paying the bills in terns of costs as well as in terms of well-being.\n\nCan anyone do something about this?\n\n\nDetails\n\nManch - Bridgetown ba1387 + ba0255\n\nBridgetown- Manchester ba0254 + ba1394\n\nMissing bag. Manba25331"
  },
  {
    "reviewDescription": "I’m actually angry that I have had to leave a single star. There should be an option to leave nothing. Worst customer service I have ever encountered.\nA super wise choice of British Airways not to have a single customer service phone number, when the service is so appalling."
  },
  {
    "reviewDescription": "after our holiday, we had an issue at Heathrow airport. Luckily a very kind Border Force person helped us out. As BA desk did not really know what was going on. So BA put us up in a nice hotel for the night so we would fly the next day.\n\nSo even though the plan was cancelled, it was all ok."
  },
  {
    "reviewDescription": "Booked a holiday with BA. Our luggage did not appear at orlando airport. Had to purchase clothes shoes etc for. 14 day holiday. Told our luggage had not left UK. Low and behold 3 months after trying to claim.compensation BA advised my case had arrived and been stolen and they will not compensate me as it has nothing to-do with them. No help advice or even apology"
  },
  {
    "reviewDescription": "Having saved for a trip of lifetime, booked flights to Japan in business class as it’s 14hr flight, Now a day before returning to uk , got email , flight cancelled but rebooked on JAL in economy class. Paid business class fares , I really don’t know how I m going cope in economy seat. I’m thousands of miles away in a land where English is not first language.\nPhone calls from mobile is ridiculously expensive.Thank you BA for ruining my holiday, This review is ofJAL after our flight back on JAL. Jal were absolutely brilliant from beginning to end , fantastic service on plane and the economy seats were so comfortable. 13 hrs just flew by and there was so much interaction with JAL flight attendants, they were brilliant. BA you just lost 2 customers who have been flying with you for years."
  },
  {
    "reviewDescription": "I made a complaint and a compensation claim for me and my party of 8 on 9th September 2023 following a very poor customer experience both on the journey to new york from heathrow and following our return from JFK to Heathrow. To date I have still not received any form of communication update. If you do the live chat the service is poor and limited and trying to get someone on a call to check the status is ridiculous."
  },
  {
    "reviewDescription": "My issue is with British Airways Executive Club. I have been saving Avios Airmiles for years with the aim to take a dream long haul holiday with my wife once we retired. BA took over Avios and recently decided to delete all saved airmiles points if there was no activity. Unfortunately, due to having cancer and undergoing months of chemo and radiotherapy as well as 2 major operations, I was unable to react in time. I have emailed BA, BA Executive Club as well as the CEO on several occasions explaining my situation and asking if they could reinstate my airmiles. Unfortunately nobody cares enough to reply. I suppose my situation isn't important enough or BA doesn't care enough to reply."
  },
  {
    "reviewDescription": "Absolute Flodges do not fly with them ever stuffed us around for over 2 and a half hours, provided no accommodation and sent us to Canada instead of Singapore."
  },
  {
    "reviewDescription": "A joke of an airline. Over the years everything about it has gotten worse and worse in every way. Today has been no different."
  },
  {
    "reviewDescription": "Wow!\nI’ve always been a big BA fan.\nUntil Now!\nGiven my experience today I shouldn’t be surprised to find they have such a low trustpilot rating!\nI called customer support to rebook a flight that we had to cancel due to my companion suffering a horrendously painful injury that has taken months to partly recover from.\nWe had paid over £800 for flights a few weeks before departure. I was told we would get full credit to rebook within a year with no fees or charges.\nThe new flights, exactly the same flights as before are currently £525 online on BA.com.\nBA wanted an Extra £400 + each= £800\nIn fare differences. More than the cost of new flights. Meaning we would be paying £1600 for £525 of flights!\nAfter much “discussion” they dropped it to £90 each =£180. But with the more than £800 I have already paid that would be over £1000 for a £525 fare!\nWhen their customers have had a horrific injury, have had to cancel a hard earned holiday and are at their most vulnerable….BRITISH AIRWAYS CHEAT THEM ….by charging double the price to rebook a fare!\nWHEN THEIR CUSTOMERS ARE DOWN THEY KICK THEM AND THEN RIP THEM OFF!\n"
  },
  {
    "reviewDescription": "booked 4 flights and one of the passengers was told not to fly due to health tried for weeks to get a refund or a credit was told that we are not eligible for a refund or a credit.\nthe flights are in september so they could re sell those tickets . have use BA for years will not be using them again."
  },
  {
    "reviewDescription": "BRITISHAIRWAY AIRLINE PNRS- VTV4TD AND VTESH4\nThanks for rinsing OLD Disable people. we purchased 4 tickets through BA Due to some medical reasons we can't reach on airport on time and we missed the flight. so we have to buy more tickets of different airline from airport as its urgent to fly. Now 3 disable passenger return date is on 5th of dec and i have spoken to british airways and they saying as you become NO-SHOW on outbound flight because of this reason your all 4 tickets are voided and passenger even cant use return tickets. its means they have to buy new tickets to travel. look guys people are already struggling for surviving in this current economical chaos and you guys are making it worst for disable people who purchased there tickets from life time savings. its not a small amount its almost £4000 and we cant afford that kind of lose. Its understandable if u say customer is no-show on airport and they missed out bound flight , but what about inbound flight which we already paid? that £4000 going straight into BA pocket and they can still re-sell Inbound flight tickets to some body else making double triple profits. we need some official people from BA to contact us and sort this matter out as these disable people cant afford that kind of time to lose and ultimately they have to take loam from some one to return back which they cant afford to pay back. so please cooperate . thanks"
  },
  {
    "reviewDescription": "Can’t rate as zero stars so have to settle for one - the lowest possible.\n\nTrust pilot is an oxymoron for British Airways. Based on recent experience I would not trust them with any of my belongings let alone me or my family again despite flying with them since 1979.\n\nBA lost one of our bags on our outbound flight to Geneva in December. It’s never shown up. Geneva said it was at Heathrow, Heathrow can’t find the bag. We have a lost property filing from Geneva from December - it’s now nearly May and still cannot get resolution from BA.\n\nI cannot actually speak to anyone. We Submitted the online claim form process which seems to have now stalled despite uploading all information and receipts.\n\nThe agent clearly hasn’t read the case file properly.\n\nWe can’t claim on our travel insurance because BA cannot / will not issue us with a correct letter.\n\nIncompetence at every level from what used to be the world’s favourite airline.\n\nSad to see what was a national institution end up like this…"
  },
  {
    "reviewDescription": "Travelled club to Tenerife. BA don't mention when booking that they charge extra - even in club - if you want to choose your seat. We wouldn't pay the extra £52.00 per person each way they wanted so we ended up right at the back. On both outgoing and incoming flights the only food left when they got to us was the vegetarian option. One of the meals was vegetarian sausage - completely inedible. Rotten service, rotten company. I won't travel with these clowns again."
  },
  {
    "reviewDescription": "I am named as a third party nominee on my partner's account. When I call the helpline and endure a 45 min wait to get through, they tell me I am not a third party nominee, despite being able to see my name has been added on my partner's online account. When I question this they hang up on me rather than helping to troubleshoot. Honestly makes me want to move to another country with a better national carrier."
  },
  {
    "reviewDescription": "This company is racist and discriminates against black families and black couples. They're adverts discriminate against black people. I tried to apply for a job and the people that they only require in their ads such as bi racial families and couples for models are offensive. They are not genuine at all. It's really offensive that they are saying black people are not good enough. They don't do it with any other race but they always like to split black people apart.\nThey think that all of us come from broken homes and and sit on the porch eating water-melons or something. They think black people are beneath white people."
  },
  {
    "reviewDescription": "Appalling!!! I left Heathrow at 11.50am this morning on flight BA340 to Figari, Corsica. The pilot said that he could not land because of wind and diverted to Nice. After an hour on the plane we were transferred to the airport terminal al, that was 4 hours ago and we have heard nothing since. I called BA customer services in the UK, after 15 minutes waiting I was answered by David, I explained that we appeared to have been abandoned in Nice with no information, he asked if I could give him a minute to find out what was happening and could I hold. I did hold but after 15 minutes I was cut off! Absolutely disgusting service or lack of service!!!!"
  },
  {
    "reviewDescription": "The manager at the Abuja airport on 19.10.24 @ about 5.30am is incompetent. He refused me boarding when I have the BRP and share code. Also, ticketing lady closed my ticket to waist my flight ticket.\n\nI had to travel with the same documents through Lagos Nigeria with another airline.\n\nI lost huge sum of money because of incompetentBA management at Abuja airport."
  },
  {
    "reviewDescription": "Honestly - i have no idea why anyone EVER travels with BA anymore. Surely everyone is now aware that you are risking your travel plans/holidays/business trip when you book with these chancers. I boycotted them a year or so again. Won't ever fly with them again - usual reasons, cancelled flights, rubbish service etc. I cannot for the life of me understand why anyone would ever want to travel with them again. They deserve to be, and presumably will be shortly, shut down as more and more people realise what they are; useless!!!"
  },
  {
    "reviewDescription": "I have flown 5 times in the last month and EVERY trip has had an issue. From cancellations to delays to lost luggage and getting sent to another airport six hours after my original flight was cancelled (after a 14 hour flight from Hong Kong to London). I’ve been flying with them for 30 years and it’s never been like this."
  },
  {
    "reviewDescription": "The worst company I ever book a ticket, they don’t wanna change little things in my ticket but they wanna change a small thing and they don’t want the refund, I am really upset because my account is in 0 and for nothing they want to me be ok losting a 650£ for nothing they don’t know how I have to work for make that money the only I want is a small change in my booking just the name 🤦🏻‍♀️ People can die for this RKLEXB"
  },
  {
    "reviewDescription": "I wanted to share my recent experience on the BA2814 flight to Egypt on the 12th of January, return 19th January 2024. As a regular BA traveler, I have occasionally flown business class in the past, and I must express my surprise at the level of service we received despite paying a considerable amount extra for our upgrades.\n\nDespite multiple attempts to get the crew's attention for beverages, my requests were ignored. On an early morning flight, there was no offer of tea or coffee, and our meals came with jam and butter but no croissants. When I asked one of the flight attendants for one, she provided it without an apology for the initial omission. However, when I requested another for my friend, I was informed that none were left.\n\nThroughout the flight, my attempts to get the crew’s attention were often met with them talking amongst themselves or engaging with other customers, seemingly avoiding eye contact even after pressing the blue attendant button.\n\nIf this is the standard service in business class, I may have to reconsider my choice of airline for future bookings. The duty-free service, in particular, felt rushed, and the attendant appeared uninterested in whether we placed an order or not.\n\nI hope my feedback helps in maintaining the high standards BA is known for considering we have several other flights booked, this experience is unacceptable and only seems to happen with Gatwick crew.\n\nThe lounge on the way back was disorganised, we got there at 2:20, the system was down owing to us waiting 15 minutes to get through.\n\nThere is a certain level of expectation when travelling business class, none of which has been met. In addition there was only 1 toilet in the lounge for women. You were once the UK’s number one airline and from what I experienced I understand why it has been lost, how does BA maintain quality control?\n\nIn a time where we are experiencing a crisis not everyone has the affordability to fly business class. I would like to be compensated for the inconvenience caused and would like to know how you plan to restore my faith in your brand??"
  },
  {
    "reviewDescription": "If I could give zero stars, I would.\nAbsolutely appalling company ‼️\nNot even British. It’s owned by a Spanish Group, IAG (International Airlines Group)!\nFlew Heathrow to USA for my son’s wedding in early August. My luggage sadly, didn’t join me until the following evening and when it did, my new case was damaged. Submitted a claim on returning home for delayed, damaged luggage, hotel and food costs. Not heard anything at all and no way of communicating with them.\nThis is a company happy to take your money but, actually couldn’t care less about its customers.\nAVOID ‼️‼️.\nFly with an airline, who actually values its customers."
  },
  {
    "reviewDescription": "Currently in Tenerife due to fly home tomorrow and BA just cancelled our flight home. No other flight offered for two more days!! Apparently they also don’t pick up the additional cost of airport parking, accommodation, car hire, dog kennels etc. we also need to be home for work commitments. We booked with BA because we mistakenly thought they would be reliable. Phoned the helpline over 10 times and it just states they are busy and try later. Appalling customer support and service."
  },
  {
    "reviewDescription": "Date of experience: June 11, 2023"
  },
  {
    "reviewDescription": "Delays no apology"
  },
  {
    "reviewDescription": "I cancelled my booking due to unforeseen circumstances, this took months for someone to actually cancel it and at least about 20/25 phone calls as got told someone would call me but never did so had to chase again and again and explain the whole thing again then got told different reasons why it hadn’t been cancelled, but then eventually just a few weeks ago someone from refunds called to process the fully amount of the flights and to an account that I gave details of and told this would be refunded in next few days, I then got a refund to an account that had closed and not the account I had given details of , and not only that but only for £239 of a £1089 booking, I raised a complaint and they responded with only you only get part of your ticket refunded, I emailed back with an attachment of the email from British airways as proof of the full amount and account number that I was to be refunded to! This has been one of the worst and horrendous experiences of my life that should have been straight forward, even after all these months of getting this refund processed, with email of confirmation I am still having to deal with getting it sorted and getting my full refund to the correct account, no one has taken to consideration all these\nMonths of dealing with this and now once again having to deal with the refund and getting the money back, I actually cried when the email came back saying you got the refund, it was as though they did not read my email!! HORRENDOUS CUSTOMER CARE THAT ACTUALLY JUST TOCK BOXES AND SAY THEY WILL SORT AND ACTUALLY DO NOT DO ANYTHING!!!!!!!!"
  }
]