[
  {
    "reviewDescription": "BA have lost it, I will do everything in my power even pay more to travel with another airline.\nI paid for rear seats in order to be near toilet because of my medical condition.\nBA changed my seats to the middle of the aircraft WITHOUT rolling me until the day before.\nI understand that due to operational reasons they can do this, so I moved my seats back to 2 rear seats that was available rather than being in the middle of the aircraft.\nOn arrival at the airport I checked with a check in agent to see if there were any other seats available. He then without listing to me changed my seats back to the middle of the aircraft, I said no don't do this if there are no other seats available I will stay where we are at least I am somewhat near the toilet, he did not listen and he lost our seats at the back of the aircraft leaving me in the middle of the aircraft. I then had to explain to him and his supervisor why I told him not to move us again in front of a crowd of people causing me great embarrassment\n\nI paid for these seat and have tried to get my money back but I keep getting we are getting high calls/ emails at the moment.\n\nI am a BA executive member but not for long."
  },
  {
    "reviewDescription": "The crew working flight BA0557 were very sweet. Even though there were minor faults concerning the flight, the staff continued to make the journey feel relaxing. They had all signed a card wishing me a happy birthday which I didn’t expect so it was a lovely surprise. Much appreciated!"
  },
  {
    "reviewDescription": "Excellent customer services from Kim at Special assistance!!! Highly recommend"
  },
  {
    "reviewDescription": "Very frequent flyer. Poor value for money. Shabby service, especially BA889 Belgrade to London - business class is a woeful joke and the lounge a pitiful attempt - next door is Air Serbia lounge where it is clean and has competent staff. High propensity to cancel flights especially, Cairo route (twice in three return flights!)."
  },
  {
    "reviewDescription": "I have a 'hidden disability' which severely limits my ability to walk or stand for long periods as I am in intense pain. I had arranged wheelchair assistance at Seville before the trip but was refused it when arriving at the airport \"you can walk - it's a small airport\" When appealing this I was told I could get a chair after security. After struggling through this I was told none was available. I eventually arrived at the gate in a cold, sick sweat and in tears. The pain was horrific. I couldn't go any further and so was shouted at by three members of staff for not being able to walk any further. I don't know how anyone could be so cruel. It was awful doing 'the walk of shame' onto the aircraft. I don't have long to live and this was my last holiday. I'm heartbroken and humiliated. British Airways response was totally inadequate...they offered me some vouchers which are useless as I can't go anywhere again. I wanted to know that no-one else would have to suffer like this again but they brushed me off. They don't care and are acting illegally not facilitating travel for disabled people. Steer clear."
  },
  {
    "reviewDescription": "I really don’t know what’s happened to this company, right now it takes me back to the early Covid days where you simply couldn’t reach anyone… It’s very much like this now. I’ve been trying to get hold of them all week, they just cut you off - Ultimately this is down to leadership…the CEO is a joke…he’s lost, Clueless, with no idea of which direction to turn. He needs to go get a job delivering newspapers… Something more in line with his ability.."
  },
  {
    "reviewDescription": "Hotel experience was not great! British Airways confirmed resort fees were waived and we requested connecting or adjacent rooms for disability. However, when checking in, we were allocated rooms on different floors. This issue was rectified and given rooms on the same floor (still not ideal). We provided paperwork to Hilton to show resort fees were waived, but still had to pay $400 per room for mandatory security deposit (British Airways did not inform us of this!) we paid this and it was refunded, but we have been charged the resort fees after checking out, even though we used no facilities during the stay and being told we would not be charged these fees. Beware"
  },
  {
    "reviewDescription": "Donot use this Airline on our return we had 3 flights the first flight was delayed due to a problem with the plane which was changed this meant we wouldn’t get our BA flight in Johannesburg BA customer service advised us to move our flight to a later one which we did on there advice we where told there would only be an Admin fee they then charged us over £3000 for 2 people 2 flights home bearing in mind we had already paid £1500 return.\nWhen we complained about the expense they were not interested profit before customer Care shocking."
  },
  {
    "reviewDescription": "Awful airline that doesn't care about its customers at all. Started with their dated website not letting me check in and saying my covid documents couldn't be verified, even though they actually were. As a result, I couldn't check in online and had to do it at the airport, where I got an awful seat. My flight was one of many many delayed BA flights today. I was told it would leave 4 hours later by a staff member. As I knew I would miss my connection, I tried to rebook myself in Heathrow as advised by BA staff. First thing I discovered is that BA don't bother staffing their customer service desk on the B gates side of the terminal. Nice 10 minute walk for me to the other side of the terminal to queue up and try to rebook. Agent tried to contact the ticketing team but no answer even though he tried for 10 minutes. Either they were all at lunch or busy trying to sort out the 10000s of people their shoddy management has screwed over today. Was then told flight was actually leaving in half an hour and had to run all the way back. On the plane I was promised ground crew would meet us when getting off the plane and help sort out connections. There was nobody there. I had to go through immigration and then make my own way to the American Airlines ticketing desk, seeing as I'd booked through them. They could only rebook me on a flight leaving the next day, which is exactly what I didn't want and why I was trying to rebook while still in the UK. As the operating airline, it's actually BA's responsibility to look after me and they did absolutely nothing at all to help, even though it was their fault. I am now missing a wedding, which is the main reason I am in the US in the first place. Instead, I am stuck in a cheap hotel in a city I don't want to be in. You pay a premium price but you get low cost service with BA. Choose another airline if you're going to pay that much. Maybe you'll actually get decent service."
  },
  {
    "reviewDescription": "BA must have the poorest information technology platform of all airlines. They do not seem able to maintain a stable platform to deliver a seamless and hassle free customer service. They probably hired the same IT-team that wrote the disastrous MCAS software for the Boeing 737-800 who’s credo was “crash and burn”.\nBritish Airways needs to get a grip and drag its half-assed IT system into Century 21."
  },
  {
    "reviewDescription": "Our experience started on arrival at Gatwick airport. Firstly the ba check in gave us 2 seats so far apart that we may as well been separated. On arrival at Gatwick we were treated like cattle and it was almost a game show to complete a series of check in within a few minutes.As we boarded the plane the crew were rude and did not Give a toss. As the sour faced crew moved up the cabin they handed out breakfast. This existed of a bottle of water and a cheap cereal bar. There was no food on the flight and you had to pay £3.29 for a cup of coffee. If passengers wanted to use the toilet that had to wait behind the sour faced attendant who refused to move. Passengers who were desperate for the toilet were angry that they were told to wait until the trolley was at the other end of the plane. This trip made Ryan air seem like luxury. Cattle were treated with dignity. Passengers were constantly told to put things under seats. The seats were cramped and everyone looked miserable. What has happened to this formerly fantastic airline."
  },
  {
    "reviewDescription": "What a bunch of crooks! I purchased a return flight from Johannesburg to London for around R27000. I used my outgoing flight and wanted to cancel my return flight. They told me I would receive a refund of R2647. I wasn't happy with the refund but cancelled anyway as that was all I could get back. Then they refunded me R141. Absolute theft! What happened to tax I paid on the ticket? Did they pocket that too?"
  },
  {
    "reviewDescription": "My husband died suddenly in March 2022. I contacted British Airways on 6 April and was given an email address to send a copy of the death certificate. This was acknowledged and I was asked to phone the following day when I was promised a refund in 7-21 days. After waiting a month, I have tried several times to contact by phone, only to be cut off after being told their lines are too busy. I tried emailing but a reply was sent addressed to my dead husband and not me, and I was told to phone! I used their on line form but have had no acknowledgement of this after 3 days. I am going round in circles and cannot cancel my husband's credit card as I was told the only way they will refund me will be to send the refund to the card it was originally used to pay for the flight. The service is despicable for someone suffering with bereavement and I could do without all this additional worry. I do not know if and when I will receive the money back."
  },
  {
    "reviewDescription": "Flight back to UK cancelled at midnight after 7 hours waiting. Notified by email of change in flight details. No BA support available. Helpline number given by BA not operational, apparently it is switched off in times of crisis and they can only be contacted by email. Absolutely appalling customer service."
  },
  {
    "reviewDescription": "Terrible service and scamming customers out of money just to get them to buy more expensive tickets.\nI placed return flights from Glasgow to New York on hold through their \"helpful\" option of paying a small deposit and paying the full price within 72 hours. 3 hours before the deadline I got home from work and tried to complete the booking, to find that the website is not working - the page continues to load for 40 minutes. At this time the phone lines are closed so I sent a message on Twitter and an email. After trying for 3 hours, I received an email to inform me that I ran out of time to make the payment, therefore the price I reserved the tickets is no longer available. The same tickets are now £170 more expensive.\nI phoned customer service 8 am and after waiting for 20 minutes to be transferred to anyone, a very unhappy and tired lady answered. I've worked in cs before and can empathise, so I tried to go about it nicely. However, I was told that there is nothing she can do and that it is MY fault that I didn't phone them before the lines closed. I AM SORRY THAT I EXPECTED A FLAG-CARRYING AIRLINE WOULD HAVE A FUNCTIONING WEBSITE. Clearly, I expected too much from BA. Even after I explained that I did nothing wrong and was trying to make a payment well before the deadline given by the company and clearly the problem was on their side (especially since there are other people online complaining about the same thing for months now!), she insisted it was my own fault and there as I didn't make the payment, I lost the price I wanted and my deposit.\nIt seems like British Airlines have decided they are above everyone and can continue charging huge prices while scamming people out of their money twice - taking a deposit for a service and then not providing the service and leaving the customer with no option but paying the increased price or going to another airline. This was the first and the last time I planned to use BA."
  },
  {
    "reviewDescription": "The most laggy airline website I’ve ever seen, makes it impossible to check in and when you call them, none of the agents are available."
  },
  {
    "reviewDescription": "Idiotic clowns. Should be renamed Bitchy Airlines.\n@Trustpilot, please allow for no stars."
  },
  {
    "reviewDescription": "I'd like to call out Abby Cla... of BA Holidays. Incredible service over the last 24 hrs. Abby realised there was an issue with the booking of a room for a BA Holiday we had recently made online so when we called in a spoke to her, she clearly explained the problem and worked hard to get a successful outcome for us. She is a testament to BA Holidays and we are thankful and lucky to have had her work on our issue. We now look forward to our holiday in April so much more. Thanks Abby."
  },
  {
    "reviewDescription": "A comedy airline. I pushed back my flight a month. They took payment + sent me an email saying flight had changed.\n\nNew flight details... were the same as the current one.\n\nCalled up and the message says they can't take the call and hung up."
  },
  {
    "reviewDescription": "If I could rate this less I would….!\n\nTerrible customer service experience start to finish. Call centre calls regularly drop out and LONG wait times!\n\nI was issued vouchers back during covid and have had various hiccups along the way that have meant I needed to change bookings. This has always lead to giving BA more money than my vouchers were worth, even though numerous times I saw flights on the BA website for X price and then expecting to pay only the difference plus a small admin charge but nope. Basically lead to paying full price all over again. Vouchers seemingly worth nothing!\n\nI got to the end of my tether recently and requested a refund instead (loosing over £1,000 as part of the process!!) as I couldn’t deal with BA anymore and have just been told that money has gone back to an Amex - I’ve never owned an Amex.\n\nNo consideration or discussion to send the money back to the card I had used multiple times during my multiple bookings. No refund emails received. Asked if I could raise a dispute, I was swiftly told no.\n\nNo thought for their customers, no flexibility. I will never fly BA again. Will be telling everyone I know about my experience!!"
  },
  {
    "reviewDescription": "If I could I would give British Airways 0 stars I would. My parents booked with British airways with reserved seats both ways due to their age and wanting to be near toilet facilities. When they checked in they were told their seats have been changed and no other changes can be made. The seats were awful and nowhere near toilet facilities. Their seats were given to much younger people. On the way back the same thing happened. British airways is an awful company which has no respect for bookings. They also appear to treat elderly customers badly."
  },
  {
    "reviewDescription": "Terrible online experience. Website hardly ever works and app is almost useless. Can't check in or apply for seats etc. Then once finally checked in after an hour of trying, can't get boarding pass to download or through app"
  },
  {
    "reviewDescription": "I have flown both British Airways and Emirates recently. Difference is chalk and cheese. BA are horrendous at communicating. Simple issue. I wanted to upgrade from World Plus to Business class and rang for a price to do this. 40 mins on the phone and eventually informed that they could not tell me how much it would cost. But they would email me with information. I asked if they could ring me and was told they are not allowed to ring customers! Next day received a cost for the upgrade and rang to pay. Took 1 hr 2 mins to get through after speaking to 3 people. Gave my credit card details and the gentleman disappeared for over 10 mins. When he returned, he started to speak and then got cut off!!\nAppalling service and communication. Would not advise anyone to fly BA if they have an alternative. It is embarrasing! Still don't know if I have managed to upgrade!!"
  },
  {
    "reviewDescription": "The worst airline in the history of aviation. DO NOT EVER BOOK A FLIGHT WITH THEM!!!!!! Managers do not even come to the phone, they let their associates take all the s**t from unhappy customers. Pathetic company. Poor employees who have to take customer calls. Shame on the management."
  },
  {
    "reviewDescription": "Shocking airline, rude staff, below average comfort, avios points are a debacle to obtain....fly any other airline if possible unless you desperate and feel like you want to be treated as a child, I have wasted thousands of pounds hoping they would get better but sadly no, I have and will be continuing to use a competitor for my quarterly long haul flights and for flying my family."
  },
  {
    "reviewDescription": "There customer service is horrendous due to their computer systems. I tried ringing them from the US on my phone and then they couldn't hear me. I rang on the hotel landline and I got half way through the call without the advisor finishing my enquiry and the line went dead. Ive been trying to change my flight for 3 hours. It won't left me do it online."
  },
  {
    "reviewDescription": "Simple the worst customer service I’ve ever experienced. Can’t book flights to US in December. Enter all the details online, choose seats, validate card payment - then get a message saying there was a problem booking the flight and to call customer services. Have tried multiple times, different payment cards, etc. As everyone knows, calling BA is currently impossible. Whatever call menu options selected I just get the message saying ‘we are prioritising customer so can’t answer your call’ - seriously!! This company has major problems. Will it survive?"
  },
  {
    "reviewDescription": "We are entitled to compensation for a long flight delay. Application went in about 5 weeks ago and all we get are automated emails apologising for the delay. Others in our group have received payment but there seems to be no pattern in how BA deal with these claims. There is no ability to contact a human to discuss. Very poor service."
  },
  {
    "reviewDescription": "UNBELIEVABLE.\n\nFlight cancelled and rebooked to different airport in destination Country 12 hrs before takeoff. Annoying.\nReturn flight then cancelled and rebooked with both different starting and destination airports just a couple of hours before scheduled takeoff. Notification from BA by text and email came through after replacement flight had taken off. Luckily my egencia app was faster on notifcation. This was very annoying. Then on reporting both to BA for regulation compensation no communication possible with actual staff and no reply in 3-4weeks."
  },
  {
    "reviewDescription": "I flow with british now the first time after very long time and after this flight i had i will defilntly fly again in the future it was amazing service the studest was very nice and kind\nthank you for the crew flight BA705 vienna to london heatrow\nits end abit long due no staff on the airport were wait 30min in the plane but i cannot blame british on it"
  },
  {
    "reviewDescription": "The slowest most clunky IT of any airline I have used. I have the app and blue “Executive Club” membership. Both the app and website are excruciatingly slow and constantly kicking me out. Linking membership benefits/Avios points to a booking does not work.\nBA IT department should employ someone from EasyJet or Jet2 to show them how to build a customer friendly IT platform. If these “budget” airlines flew across the Atlantic I would use them in preference to the terrible BA booking system.\nAnd why does BA only open on line check in 24 hours before the flight. The budget airlines manage this so much better"
  },
  {
    "reviewDescription": "Very disappointing customer service, as bad as a low cost airline. I was told about 3 different things in one conversation m, none of them seeing to be true. No clear guidance. How disappointed m, always held BA to greater standards."
  },
  {
    "reviewDescription": "I’ve flown BA on a few long haul flights and I’ve always been very happy so when I decided to go to New York I booked with BA this time the seating was so hard and uncomfortable for a long flight I would of expected the seats to have a bit of padding and comfort to them which they have in the past. So for me having never again it’s left me in so much pain! Which isn’t what you want at the start and end of your holiday.\nThe only good thing was no delays."
  },
  {
    "reviewDescription": "They have removed the customer relations phone number from their site so you can’t actually speak to the customer services team at all. They do not respond to emails or even send a confirmation it was received. So instead of dealing with the extra complaints they’ve had recently by assigning more resources to handle them, they are just hiding behind email addresses and making customers wait an unreasonable amount of time before responding, if they do at all. The actual flight was delayed over 3 hours and that legally entitles passengers to compensation, but they won’t even speak to me about my claim that I submitted over 3 months ago and haven’t heard anything on.\nUseless customer service"
  },
  {
    "reviewDescription": "Arrogant and rude BA staff at the gate in Heathrow demanding to forcefully hand over cabin luggage which is allowed onboard threatening to take people off the flght, delay the flight or cancel the flight altogether. Customer experience has reached new levels. Perhaps training for the BA gate staff nowadays organised by ex-mafia personnel. Even refused to tell their names to raise a complaint despite already wearing name tags. Probably should give them number tags, a bit like the riot police officers. I had to give one star since there was no option for zero. Trustpilot overall score ‘bad’ tells it all, doesn’t it. BA world’s most arrogant and rude airline."
  },
  {
    "reviewDescription": "I booked through a third party (Budgetair), I was travelling from Dublin to Montreal via LHR, Dublin to LHR was cancelled and was rebooked for the following day with KLM via Amsterdam, I cancelled the booking via budgetair and was told they were working on a refund, after a week of no response I contacted Budgetair who told me British Airways has refused to refund me, So I contact British Airways directly and tell me I am entitled to a refund and must be done through Budgetair.\n\nAt present I am £300 down for a service I never received.\n\nOn top of all this everytime I ring British Airways directly I cannot understand what the call centre operators are saying.\n\nI am so stressed with all this."
  },
  {
    "reviewDescription": "I bought British Airways tickets for myself and my daughters. The ticket clearly shows that each of us is entitled to one hand luggage and checked in luggage (making it 3 hand luggages and checked in luggages in all). We however had just one checked in luggage to be shared by all of 3 of us just because I chose to travel light. I was shocked when Alaska airlines said we needed to pay $75(cad) for the luggage (just one despite being entitled to 3) despite agreeing with me that our ticket shows that we infact could have 3 without having to pay. By the way, Alaska was acting on behalf of BA because there is no where on my ticket where Alaska appears except the inscription “British Airways operated by Horizon”. All efforts to get them to let me go without paying failed with them asking that I reach out to you as you are already aware of this. I called BA so many times to advise on how to get me refunded as advised by Alaska but I ended up being passed around. A staff member by the name Navneet responded to me days after saying “ I would like to inform you that every airline has their own policy and the charges that we charge for excess baggage may differ from other airlines. As your flight AS2105 was operated by Alaska Airlines, their baggage allowance will apply on that particular route. Therefore, for any applicable refund, I'd request you to contact Alaska Airlines directly on their website”. How does this make sense? Operated by Alaska airlines acting whose behalf?To say the least, be this is the most terrible experience I’ve had travelling as I had to wait in line for a long while with 2 little kids having make explanations that I thought I would avoid by choosing to fly a so called reputable airline like BA. I would tell this story to as many as would give me listening ears. Very sad\n\nOluwasina."
  },
  {
    "reviewDescription": "Dont bother....Does anyone work at the help centre? I go away tomowwor and cant check in online and cannot get through. Ive been trying for 3 hours. Had the same problem last year out in the states to change my flight and took 3 days to answer.... Think I will go with Virgin next year....Never had this with them."
  },
  {
    "reviewDescription": "I’ve been loyal customer of BA for many years - frequent business trips helped with that! After taking a break from travel for a couple of years, I cannot recognise the company! Their online experience is painful and the customer support at the call centres appalling!!! I made 3 calls to the centre in the last 2 months - 2 times I got male reps and they were incredibly rude! While the first one apologised and came back to the issue. The second one told me he solved by problem and that’s all that matters. He refused to connect me to the manager and did not give me his full name. It is so disappointing to see the flag UK airline having such a terrible service."
  },
  {
    "reviewDescription": "I was booked on a business trip from EDI to LHR, LHR to PVG for 7 days and due to air traffic control, BA delayed my first connection by an hour which caused me to miss my second connecting flight. BA rebooked me on a flight at a completely different airport and ended up losing my checked baggage. I contacted their staff and they wasted 4 hours of my time and told me to wait. I was handed £10 food voucher and was given no support for transportation. Due to how long they were taking with my checked baggage, I had to end up leaving LHR and had to get a £200 taxi to LGW. The taxi was too late, resulting in me missing my newly rebooked flight. I blame BA for this and the fact that there was zero support from staff who seemed to be more concerned about their welfare rather than those of the passengers who were stranded and affected. I ended up having to pay for a hotel, flight, and transportation at my own expense. I have lodged a claim but if BA do not compensate me back for what they have done, I will be taking this further."
  },
  {
    "reviewDescription": "I have been a loyal member of BA's one world for many years. A few months ago, I booked a flight in Europe for myself and a friend. Two days after I booked my friend cancelled the trip, leaving me to pay the full cost. I rang BA, asking them if I can change the name of the traveller, as another friend offered to go. I was prepared to pay for changing this. They would not allow me. They offered to give my friend the credit for the unused flight, despite my insisting that she had not paid for the flight.\nI was encouraged to cancel but they kept 95% of the original fare. This is despite them sending me an email saying that I would get a refund of about 90% of the fare.\nI have made numerous calls and I get referred to their website, which does not cover the matter."
  },
  {
    "reviewDescription": "For more than 9 months I have been trying to add my granddaughter to my Avios household account. Despite receiving invitation emails, the BA Executive Club software simply cannot complete the process. I have spent ages on the phone to customer services, sent messages on X and numerous emails. I was told it was a “known issue” but nobody could solve the problem. Promises to get back to me never materialised. Most emails elicited no response, and others issued an acknowledgement but nothing thereafter. Messages on X were also ignored. I am at a loss for words to describe this airline's incompetence"
  },
  {
    "reviewDescription": "BA return flight London to Amsterdam. 90 minutes late on the way out and two hours plus on return. Shocking. But typical of BA."
  },
  {
    "reviewDescription": "My son booked a holiday of a lifetime with British Airways to Universal Studios Orlando Florida for May 2023 and he paid for his 2 little children 3 and 8yrs and myself to go. We had to reschedule the holiday to Sept this year due to illness but British Airways are refusing to transfer the theme park passes so my granchildren wont be able to go to them now and my son has not only lost them but over £2000 on park tickets that we cant afford to purchase again. Its disgusting because they've been paid for but never used. I rung Universal and they would of gladly changed the date if we had booked with them but British Airways won't budge. Its a waste of time going without the theme park passes."
  },
  {
    "reviewDescription": "Not a great start to the holidays. Short queue at check in but extremely slow. Waited 15 minutes at the head of the queue whilst a family were having problems checking in ahead of us. Meanwhile three other queues next to us were getting through very quickly. Not one attendant offered to take us next when they could clearly see we had been waiting ages.\nVery poor customer service to date. Will see if it improves over the coming day."
  },
  {
    "reviewDescription": "I recently had a disappointing experience with British Airways' customer service. I requested an invoice for insurance purposes six days ago and have yet to receive any response. In contrast, when I made similar requests to Ryanair and easyJet on the same day, both provided the necessary invoices promptly.\n\nThis lack of responsiveness from British Airways is particularly frustrating, especially considering that other airlines managed to address my requests efficiently. Such delays can cause significant inconvenience, especially when dealing with time-sensitive matters like insurance claims.\n\nI hope British Airways will take steps to improve their customer service response times to better meet their customers' needs.\n\n\n"
  },
  {
    "reviewDescription": "What has gone wrong with BA? Flight back from Venice was delayed by fog at Heathrow. We are now landed - 2 hours late. After 70 minutes sitting on the tarmac in Venice, now we have been sitting on the tarmac at Heathrow for 20 minutes waiting to be directed to our airbridge which the first officer has told us is available. The EasyJet flight just ahead of us in Venice left on time."
  },
  {
    "reviewDescription": "Flew to Cape Town on the 3rd March and flew back to Heathrow on the 19th March 2024. On both occasions I was upgraded to First Class (I do not know why but I was travelling by myself). What can I say? This trip was my number one on my bucket list and these two flights added icing on the cake as it was definitely ticked and very fond memories have been made. I was extremely well looked after, the stewards and stewardesses were extremely helpful, courteous, chatty and nothing was too much of a problem for this first class novice. The food was really, really tasteful and the drinks were plentiful I think! I even asked to keep the menus so I could brag to my children but to the stewardess on the flight BA 054 on the 19th March 2024, thank you for the bag of Lindor chocolates and my daughter does as well! Give credit where credit is due, thank you all."
  },
  {
    "reviewDescription": "Really really unhelpful customer support.\n\nIt is a real shame as I have usually had good experiences. But the mixture of a weak/poor product (which meant I needed to call to find out how to use my companion voucher) & someone who simply did not want to be speaking to me made that experience pretty poor. Will most likely look away from avios points and BA in the future."
  },
  {
    "reviewDescription": "SHOCKING! the stole money off me back in May and still haven’t resolved the matter! Also sold me a flight that was. Oversold and I still don’t have a refund or answer! Worse than any budget airline atm! Infact the hey are making budget airline look better than ever because at least you know what you’re getting. Then try to call and they ‘too busy’ and cut you off."
  },
  {
    "reviewDescription": "So far so good. I’ve been using British Airways for over 15 years and while there has been some hiccups and delays overall they have been a very reliable airline to use. The staff I have interacted with have been generally very friendly and the pricing is fair as sometimes you can get a very competitive deal."
  },
  {
    "reviewDescription": "Flight BA2675. 3rd July. 20:35. I’m 60 years old and have travelled quite a bit in my time. Have recently took early retirement as lost a kidney, this return flight from Cyprus to Gatwick was probably the worst I’ve ever had. Boarded late, finally started to taxi out to be told by the captain that we are returning as they have a sick member of staff!!!!!!! The medical staff came on board, we were left sitting in the heat with no offer of water. (Remember I’ve only one kidney so not very good for me). Then because a passenger was getting irate we was allowed to go back into the departure lounge where after another hours we were told the flight was cancelled, this is probably about 23:30 ish by now. We were taken to a hotel in paphos, no food or drink still and about 00:30 by now. Was not told what time to be ready for pick up so awoke early so not to miss the coach and flight. Finally took off around 13:30 ish. I put in a claim for drinks, sandwiches and for being delayed. It took them months to finally reject my claim and also said my recipe for food and drinks was not clear lol. Will never fly with British airways again. Ps I gave it one star as can’t leave less."
  },
  {
    "reviewDescription": "If you thought that the BA human service was bad, try their BOT service, which does not answer any more than the humans used to. An intentionally awful web site can take hours to navigate and no matter which direction you take the dreaded BOT becomes your only option. This will lead you through an equally confusing list of answers until it gives up and refers you back to a \"live agent\", who of course does not respond. BA....Bloody Awful"
  },
  {
    "reviewDescription": "Canceled flight from Heathrow after a long transatlantic flight. I was rebooked for a flight with extra transfer arriving 10 hours later. Customer service is nonexistent at Heathrow! Zero help or support. Helpline doesn't work, online chat is completely useless. Totally sleep deprived I have to spend time at the airport. I will avoid British Airways at any cost."
  },
  {
    "reviewDescription": "Cancelled my flight and gave zero help afterwards. Now some 3 months later not a penny in refund and customer services are purposely setup to delay and mislead so you cannot claim. Absolute joke of a company!!!"
  },
  {
    "reviewDescription": "I'm giving British Airways 1 last chance to resolve my issue before I join the 78% of other customers who 1 star (but I imagine would like to zero star) this Airline for it's arrogance in clearly not caring less about customer relations.\n\nOutsourcing customer services where there is large sums of money involved tells me exactly what I should think of British Airways.\n\nI have called and waited in two long queues and spoke to two people who clearly speak poor English as a second language. The .gov.uk website asks people who are travelling between England and Dublin to check with their airline for what suitable photographic ID is.\n\nOnline they were twice hopeless. One told me what I wanted to hear, when I reconnected as I had little faith, I was told something different. When I called, the Advisor didn't have a clue and attempted to give me Manchester's checkin telephone number but then got cut off. I subsequently called again, waited in another long queue and again, as soon as the Advisor attempted to put me on hold, the call was cut.\n\nI have tried Tweeting- no response. I have tried calling a number for Manchester British Airways and it just rung out and disconnected me.\n\nIs this what you think of passengers full stop and what about those of us with disabilities who are first time flyers and need someone competent to give us initial advice to get things right? You'll be quick enough to refuse to compensate us if things go wrong and yet there is nobody competent enough to ask!\n\n1. Will the UK citizencard be suitable for travel from Manchester Airport to Dublin and vice versa?\n\n2. Will be it OK on flights operated by Aer Lingus on behalf of British Airways?\n\n3. How long should I leave after arriving in Dublin before my connecting coach - worst case scenario?\n\n3. Will my Manchester City Council personal alcohol photographic license suffice? My driving license photo is quite old.\n\nNeither of us have passports.\n\nPlease would you kindly do some internal calls posing as customers to your lines to get a flavour of how serious this issue is. Your website does not answer these questions- essentially, what photographic ID is deemed acceptable and the UK government clearly expect you to be able to answer these questions. I'll be writing to my MP as well to make representations in Parliament on my behalf."
  },
  {
    "reviewDescription": "I have been a loyal (gold member) but enough is enough. Having supported BA through the pandemic I now find myself owed over £1000 of vouchers which for some reason are non refundable. I will not get to use these before the deadline as already have so many flights booked and it is now literally impossible to speak to anyone who can say anything apart from the computer says no"
  },
  {
    "reviewDescription": "Flight BA2202/BA2203. LGW to Cancun.\nJust returned home. I flew on the above flights in business class. The crew were an in all were excellent friendly and nothing was too much trouble. I did think the crew (particularly Mandy ) on the return flight seemed to offer a slightly more seamless personalised service. Negatives have to be flying them old B777 aircraft on the old club world seat. No storage hardly. Not much privacy and certainly cannot sleep on the b777 aircraft as engines very noisy. Please update your old club world product and aircraft on this route in order for me to fly this route again from Gatwick. Thanks"
  },
  {
    "reviewDescription": "I made a complaint and a compensation claim for me and my party of 8 on 9th September 2023 following a very poor customer experience both on the journey to new york from heathrow and following our return from JFK to Heathrow. To date I have still not received any form of communication update. If you do the live chat the service is poor and limited and trying to get someone on a call to check the status is ridiculous."
  },
  {
    "reviewDescription": "Flight delayed 2 hours. Eventually got airborne, and usual platitude about complimentary water and snack - probably the only airline flying to do this; don't they realise that customers actually want the opportunity to have a trolley service?\nOnboard wi-fi not enabled, so no opportunity to order refreshments until tried to request from water service stew at about 35 minutes into (half full) flight. Told that short flights don't do any service, but when queried was told that wifi now switched on and we could order.\nDrinks presented 15 minutes from landing, but declined.\nSpoke to Cabin Manager on disembarking, stated disappointment in levels of service, and was asked where we were seated - WHY?? Should levels of service not be consistent throughout? No smile, no apology, no sign of flight deck crew either.\nIt would very much appear these days that if the crew can't be ars*d, then no wifi, no service, we really don't care.\nIf there was an alternative into LHR you would lose passengers in absolute droves, and I find it disgusting that BA can use its monopoly to deliver such a shoddy, apathetic service. Shocking."
  },
  {
    "reviewDescription": "My husband and I booked a holiday via British airways- we felt it was not described properly and had lots of issues whilst there. Upon returning we have complained via email and online booking form as there isn’t anyone in the customer services team to talk with over the phone. We did this 2 weeks ago and are yet to hear a response. We feel that this is disappointing considering this is the first time we have booked with this company and the fact it states they have an award for customer service on their website. I feel there should at least be a person to discuss things with and be more personal than email or online forms. I think we will stick to virgin for our future trips."
  },
  {
    "reviewDescription": "Flight from Menorca was delayed, when I asked the staff at airport control if we would be boarding at the time it said on the board as people were still getting off the previous plane and they didnt know where our plane was they had an extremely rude attitude, there was not multiple people asking as we were sitting right beside it.\nOnce on the aeroplane the pilot apologised for the delay, it was a night time flight, the seats had the smallest leg room I have ever had on a plane, the lights in the middle of plane were off however the strip lights down the sides by the windows were so bright, I could not sleep, fine but then the blonde tall flight attendant was soo loud talking to other staff members at the back of the plane even though everyone was silent on the plane trying to sleep she was soo loud and shouting. Once we got to Gatwick we were circling around the airport for about 10/15minutes before being told that we were circling and waiting for the storm to pass below us.\nWe were given complimentary pretzel things and water which was nice and not sure if this is on every flight or because we were delayed however this is the first time i have used british airways and disappointed mostly due to the staff.\nThe date was 4th September 22 or 5th as it was early morning we actually landed."
  },
  {
    "reviewDescription": "I hardly ever do reviews and I felt that I had to review the flight I took from Heathrow to Madrid on 10/01/2025 at 7.25am.\nThe Captain (Gary) was apologetic and kept us well informed as we were 1.5 hours late taking off (due to issues in Madrid, not Heathrow). ALL of the staff were in a good mood and so polite and helpful. Diego gave me some recommendations of where to go and what to eat in Madrid. I was taking my friend to Madrid as she had turned 50 two days before and I told the cabin staff this and they opened us a bottle of champagne and gave it to us for free, in glasses. They made sure we was happy throughout and my friend and I thought it was such a lovely touch (we were only in economy) that it really set the mood for our trip. So thank you to Diego, Olivia and I think her name was Nahum for looking after us at the back. Also to Gary who came to see us at the end of our flight and shook our hands. Its not often airline staff get praise but we felt they deserved it."
  },
  {
    "reviewDescription": "Whilst waiting at the gate in Heathrow, our flight was cancelled after we were supposed to take off. Fortunately I managed to rebook flights for the following day from Gatwick airport. There were problems when checking in at Gatwick despite having received an email confirmation of the new flights. We were also advised by BA staff at Heathrow to take our duty free with us and that we’d be able to get it through customs with no problems. This wasn’t the case and it was all confiscated at the airport. Over 3 months later we are still waiting for compensation for the delay to our holiday and costs incurred. The customer service is appalling, I have requested multiple updates using the link provided by BA but to date I have had no response."
  },
  {
    "reviewDescription": "I'd like to express my gratitude to Leanne Legister for the excellent service she provided, She was checking in at Heathrow Terminal 5 at 8 p.m. on the 5th of December.\n\nHer diligence and services beyond normal duties are in stark contrast with the services of other areas of the company, which did not pick up the phone during office time (I was on the phone for over 40 minutes just listening to background music).\n\nThank you very much, Leanne Legister! You made it possible for me to spend Christmas with my 93-year-old mother."
  },
  {
    "reviewDescription": "So disappointed with BA2263\nDeparture time 14.15, exactly 1 hour later still at stand still. We're given 2 reason, for delay, the next will be, they have lost there take off slot, my poor family, who are meeting me at airport.\nMy belated 60th birthday gift to myself is a bit of a let down, the very 1st time I booked business class, which I should say, this is a slight disappointment. Meals had a very good taste but could of kicked myself order salmon starter, I now have an upset tummy. Over the years I have alway travelled by BA\n\nI believe next time, I will have to consider a different airline\nI wonder if it is flights going to Jamaica, why BA does not use it better model plane,\nDropped of 2 stairs, as I pressed bell for assistance, I was made to feel uncomfortable, I want to say sorry for disturbing you, it is my very 1st time travelling business class, so I am no familiar how things work any it is a lesson and experience learnt"
  },
  {
    "reviewDescription": "Tried to choose my seat by logging on 24 hours before the flight was already allocated window seat 30A and my husband 30B and no other seats were available for me to change the seats. Am now sitting with a blank wall for a window and a wall behind me. I have always used BA but will reconsider for the future. These seats should be offered at a discount for those who want them!"
  },
  {
    "reviewDescription": "After being experienced a cancellation of my flight for 3 people , provided hotel expenses\nAfter 6 months\nI have received an email from BA. And after a month\nMore or less I had my refound of 3 tickets and a night in a hotel all paid back\nThanks\nBritish Airways\nI am still using your service again\n"
  },
  {
    "reviewDescription": "Took a flight to New York BA0117 from Heathrow checking in bags didn’t go to plan wouldn’t work in the self checkin my Wife asked a BA female help advisor,she completely ignored our request walked straight passed us without acknowledging we were there quite a rude woman, there was a helpful man to hand who check our reservation he advised us that we had not paid, we proved that we had he then booked us in.\n\nTook our seats as we had booked them few minutes after we were seated & a steward asked us to move, I showed her my booking confirmation but she insisted we moved, she wanted them for herself & her colleagues, so we were bumped to another seat, no information showing these seats were not available online no reserve information when we arrived, once we had moved they covered the seats with a canopy, throughout the whole trip only one streward used the seats for around 10 minutes.\nAn older female steward seemed to have the hump with me becoming sharp when I spoke to her I did thank them when I left the aircraft in which they blank faced & ignored us.\nFood was ok, seating was ok\nEntertainment kept breaking down throughout the trip my wife was sent an £80 voucher off our next flight, not too sure if BA will be our first choice next time."
  },
  {
    "reviewDescription": "I wanted to book a flight to Brussels using the British Airways website.\nThe price quoted was £122. However, despite several attempts the website would repeatedly crash at the time of payment.\nI then called British Airways directly and they quoted me £220 for the same flight.\nI did not want to pay that amount of money, but I visited their website again after putting the phone down. As you can guess, the price had adjusted to £220.\nCrooks? Certainly not a coincidence.\nI really hate this company."
  },
  {
    "reviewDescription": "I had a flight CDG-NBO through LHR on 15/04. CDG flight was delayed, causing me to miss my connection in LHR.\nBA claims \"unavoidable circumstances\" for the delay at CDG without providing any evidence and refuses compensation. Multiple unsuccessful exchanges with their customer relations team who is showing a total lack of customer service and arrogant, tone-deaf behavior.\nBA also left me without any support, food or drink for the whole day at the airport before taking the flight they rebooked me on, which made me arrive the next day.\nAbsolutely terrible experience and I will never fly with them again."
  },
  {
    "reviewDescription": "Terrible long haul flight. First experience and long haul and never again with British airways.\n\nFirstly the leg room was a joke, our plane got delayed two hours and 30 minutes and bristish airways decided to tell us this last minute issue when everyone was boarded, during this delay they did not hand out anything complimentary apart half a cup of water.\n\nThe women next to me got her plane ticket downgraded from business to economy and told us she used to work for British airways and all they did was give her a voucher not telling her how much was on the card as she told them she knows she not getting a full refund back.\n\nMy connection flight was missed, they couldn’t put me back on the plane for the same day so I had to take expenses out and miss events the very next day.\n\nGetting my own money and REFUND out of them is like getting blood out a stone. British airways is full of broken promises when it comes to ‘refunds’. Everything is online and you can’t speak to a real person even though they tell you to leave your phone number.\n\nSo much stress from this company I will never be flying with British airways again."
  },
  {
    "reviewDescription": "Clear reason why BA have such a low rating on here.\n\nI flew in Club Europe and there was no food or drink available for the whole flight. Passengers were told that BA would contact them to refund for the problems.\n\nI heard nothing back so I made a complaint. The automated reply said that I would hear from them within 10 working days. This has now lapsed.\n\nI have now contacted my credit card company to recall the cost for upgrading to Club Europe.\n\n\nI am also a Gold customer."
  },
  {
    "reviewDescription": "Bought a return ticket from London Heathrow to Brisbane with British Airways. British Airways took me as far as Sydney after they cancelled my onward flight to Brisbane. I was told they had booked me on another flight but when I got to the desk I was told I was not booked on any flights leaving Sydney. I was unable to contact British Airways services on the phone due to high caller volume. My only choice was to pay for another ticket from Sydney to Brisbane because I had Family wait to see me in Brisbane that morning And an onward flight that evening to New Zealand. Once I was back home I made a complaint only to be offered a £50 British Airways voucher which I could do nothing with except spend more money with British Airways. They refused to refund me for the flight from Sydney to Brisbane that I had to pay for even though I had also paid British Airways previously for this flight. I will never book another flight again with them because I can't ever trust that they will get me to the destination I paid them for. Very disappointing outcome from such a supposedly top airline."
  },
  {
    "reviewDescription": "Awful boarding experience at T5. got the metro train to a B gate, to be told we have a gate change. Due to security procedures had to walk 20 mins back to main terminal then queue for an airport bus to bring us back to the same gate to board via steps. 1 hour of hassle because the jetbridge wasn’t working?\n\nOn the way back from Istanbul, announced an issue meaning no food service. Everyone got complimentary small bottle of water and a flapjack on a 4 hour flight, not even teas/coffees avail. Just as well I ate in the terminal!"
  },
  {
    "reviewDescription": "Shame on you BA. You don't pay for Fast Track for business class passengers at Catania. Have the accountants completely taken over?"
  },
  {
    "reviewDescription": "Terrible service. The gates for our flight back to London were closed early and we were not informed despite arriving early and even being told that we would’ve gotten on the plane if we did not have checked luggage! We have wasted our time going back and forth with the terrible customer service. They proomised us a rebooking option free of charged then went back on it after we followed all the right procedures. Call centre staff will hang up on you too to avoid solving the problem. Terrible customer service and terrible company. Avoid flying with them at all costs if you want your holiday to be stress free"
  },
  {
    "reviewDescription": "Had an issue through no fault of BA and had to change flight\nWe were travelling with 2 older people.\n\nThe staff were so helpful and understanding.\nOur flight was protected and they were extremely helpful in rebooking .\nThere was no mention of admin costs extra fees etc\n\nThe staff were friendly and competent.\n"
  },
  {
    "reviewDescription": "Terrible customer service.\n\nI booked my tickets and wanted to make a change. I called BA customer service and spoke to 3 different agents:\nAgent 1: confirmed no fare or date change penalty\nAgent 2: advised there was a fare change to which I replied I wasn’t happy to pay a single penny because the website showed me the same price I paid initially to book the tickets. She then advised I could refund the tickets for full price and rebook with the same price on the website.\nAgent 3: same as agent 1.\nAfter receiving confirmation from the 3rd agent, I went ahead with the change since there was nothing I would be paying. However BA still charged me £106 without informing me. And now when I call customer service they either do not reply or keep forwarding me to different departments. After a week of trying, I finally spoke to the supervisor Himani in Delhi office. She promised to get back to give on the same day (by 8pm) with an answer. But as usual no reply from her. I didn’t expect the management to not respond at all. The most annoying part is every agent I spoke to confirmed that the notes said I was not supposed to be charged. Pathetic and disgusting service and majorly untrustworthy when it comes to money. They have rated themselves a 4.5/5 which is so bot true. Stay away!!!!!"
  },
  {
    "reviewDescription": "Despite all the terrible feedback ba couldn’t care less to improve their service. No update on delays, im praying my 9:20 is only 3 hours delayed rather than cancelled alltogether. A piece of advice to anyone, save yourself the trouble and never fly ba. These guys couldn’t operate a bus route let alone an airline"
  },
  {
    "reviewDescription": "I’ve never travelled from London city to Edinburgh on BA without a major issue. If the flight isn’t cancelled (as it was today) then it’s significantly delayed (as it was the last 2 times) or I get treated like an inferior passenger by snooty flight attendants who act like I owe them cause I’m a single mother with a toddler."
  },
  {
    "reviewDescription": "Worse assistance to my 75 years old mother. My mother has back problems and needs a seat with space to get up and sit down. Even though we purchased a seat with more legroom, these ladies were not able to book into the assigned seats. At the end they said: “you have to decide if you are going to travel in this seat that we put you in or not, we will not do anything for you”. We'll see how she gets to her final destination. Very disrespectfully"
  },
  {
    "reviewDescription": "Third Class airlines….. CANCELATIONS is the USP….\n\nDO NOT TRAVEL ATALL"
  },
  {
    "reviewDescription": "This is my first and only negative review.\n\nI have been flying with BA for decades but never again. I have had several bad experiences with them in the past 5 years but I thought it might be exceptions, but my most recent experience has put me over the edge to boycott them.\n\nMost recently, I was denied boarding for my outbound flight, under the claim that I needed a visa for my transit location. I showed evidence that I didn't need any visa as I was transiting within 24h (I had also confirmed this with the embassy of the country in question), but BA said that it was under their discretion to decide. So I was denied my outbound flight and I had to buy a new ticket (obviously with another airline) to get to where I needed a few hours later.\n\nI speak with customer service who say they will split my booking so that I can keep my return flight, but then I don't hear back for weeks. When I call to follow up, close to my return date, and finally get through their long queues, I am told they will have to charge a fee for the change. I am put on hold while they figure out what the charge will be, and after 40 min on hold the call disconnects. I end up having close to a dozen calls with the BA customer service team (call centre in India without any real authority to support you) over the next days with contradicting information that I won't cover here.\n\nEventually, BA says that they won't be able to change the flight, and as a consequence my return flight is now invalid. The best they can do is issue a refund of some taxes of £380 out of the £1400 we had paid. So I lost over £1,000 without getting a single flight from BA!\n\nJust shameful."
  },
  {
    "reviewDescription": "Cancelled my flight from London Heathrow to Glasgow and offered no assistance whilst in London. Offered me another flight from Heathrow to Edinburgh the following day. So no hotel and no assistance to get from Edinburgh Airport to Glagow airport to collect my car a day late. Absolute shambles, I used to be a gold member with them but now they are the worst. Ryanair in my mind is better than them now"
  },
  {
    "reviewDescription": "I take the same route quite often which is either with Virgin or BA/AA. The British airways flight is terrible. Delays, old aircraft and just all round terrible experience. I know which one I'll be using from now on."
  },
  {
    "reviewDescription": "BA cancelled the last leg of return flight. Their suggested option was a connection 14 hours later which had to be booked by calling customer services. 7 attempts to get through where mostly the call wasn’t answered. One successful connection where agent appeared to hang up. Passenger is 82 year old lady travelling on her own who needs assistance, BA knew this.\nBA left her in the airport to find her own way to complete the journey, shocking service.\nIf your travelling BA beware, any issues your on your own"
  },
  {
    "reviewDescription": "Has anyone ever had BA Customer Service contact them directly following their complaints on Trustpilot?"
  },
  {
    "reviewDescription": "Very bad experience never travelling again with them 2hours 30min delayed flight and that was after we bearded the. Left my house 7 am and did not get anything to eat and drink till 6.30pm they would not even give us a drink said you will get one once the flight is in the Air was not given a food choice just was slapped with a cauliflower curry and rice not even a explanation that why we are not getting a choice.the airhostes were so rude and grumpy that on my way back my daughter waited till the gentleman who was very kind asked him for a cup of tea she said mum he is the only polite one I can Speak to the food was so bad just could not eat it."
  },
  {
    "reviewDescription": "Premium economy from NY to London - I have been advised my table is broken. This isn’t the first time, it’s not great as a frequent flyer and I’ll be looking at alternative airlines in future."
  },
  {
    "reviewDescription": "I paid for 2 particular seats in Business Class on 20th October 2023 for a trip in September 2024.\nOn 6th July 2024 BA changed the seats for operational reasons. I have requested a refund as\nI have had to rebook 2 unsuitable seats, but BA refuse to answer my emails sent on 8th July, 3rd August and 16th August. I also find it impossible to reach them by phone to speak about this matter. Just the usual automated replies.\nLesson:- Do not pay for Business Class seats in advance, because when you are moved, they refuse to communicate. So BA, upon notification of this review, sort out your appalling customer service.\n\n"
  },
  {
    "reviewDescription": "Worst service ever!!! If you don't want headache then don't fly with them! Worst experience worst crew worst booking worst problem resolution no customer satisfaction! How can you cancel a booking that was made 2 weeks ago with no confirmation and then rebook you to a different flight, making you wait, in the belief they resolve the \"technical issue\" then the same issue happens again in the next flight! I can't believe you carry the name \"British\", respect your culture with your service! It is subpar!"
  },
  {
    "reviewDescription": "Some issues with delays but I see is a common thing. That should change"
  },
  {
    "reviewDescription": "Another triumph from the fallen angel. This morning the alarm went off early for a 7.40 flight to Brindisi. The first issue was the queue to check in luggage. For Business Class. The queues for Economy weaved round the departures hall but amongst the sea of whirling screens and closed lanes, it still took 20 minutes and some kettling for those who had paid serious money or were foolish, captive regulars to get to baggage check. The man at baggage check smiled when i suggested this was sub optimal and thanked me for my joke. The bags were checked and new boarding passes issued. I had been moved seats, closer to the front. As we headed to Fortnums to spend some money, i asked my wife whether her seat had changed too. It hadn't. I checked my new boarding pass again. It was for a different name and a different destination. Bizarrely it had worked at security as did my wife who, it turned out, was using my boarding pass. It crossed my mind that i and or my bag might not be able to get to Brindisi and so i sought assistance. I finally tracked down a \"Customer Experience Lead\" who, to be fair, worked hard to move the bag to the correct flight and reissued new boarding passes for me and my wife. Armed with these new boarding passes in correct names, we both passed through the automated boarding gates. I had thought that we were being tracked through the airport for, amongst other things, security purposes. But now i am not sure. Both our documented identities had changed twice from correct to wrong to correct on this passage through Heathrow but at no point had these changes impeded our progress. I shall ask the appropriate people the appropriate questions on my return!"
  },
  {
    "reviewDescription": "I booked via BA and they put me on an American Airlines flight for the return journey. They should ask their partners to up their game.\nI paid for business class tickets and yet had a really sub standard experience - a broken seat, pre ordered meal not provided (and due to allergy limitations I couldn't eat the standard alternatives), attendants not delivering what they promised, the amenities bag is basic, all in all one of the worst business class flights I have had (and I've been on a lot!)"
  },
  {
    "reviewDescription": "Pulled out of line before security and told my carryon bags must be checked on a simple hop from london to Europe. BA then failed to load ANY bags onto that aircraft. Seat power did not work. Departed late. Arrived later. I received more apologies from BA on this flight than all others combine. I had been focused on the BA brand as I felt it a premium brand and worth the few extra dollars. They have deteriorated. How does the CEO justify the more than £1.8 million pounds when he’s driving into the ground. Easy jet treats me poorly for half the cost.\n\nOne week in - BA has yet to respond to my questions- or allow me to pick up my luggage which per the website, is found and at my local airport."
  },
  {
    "reviewDescription": "Terrible airline with terrible customer service. Been waiting 6 weeks and still no response to my compensation and expenses claim for a flight cancelled less than 24 hours due to depart! BA have left me extremely out of pocket. Number 1 worst airline! Avoid!"
  },
  {
    "reviewDescription": "Horrendous, last minute flight cancellation last June by BA Heathrow at 22.00 to catch Venice cruise after delaying us for 4 hrs earlier, no hotels available at that time of night ,no help desk assistance, so spent night on T5 bench , then given a hotel in gatwick for 2nd holiday night to catch flight out on day 3 to embark on cruise ship late.\nMissed 2 days of holiday for a lovely night on a bench and a stunning night in gatwick.\nBA then claimed flight cancelled due to bad weather so don`t owe us any compensation and only prepared to pay incurred expenses for food.\nJust received notice they have now even closed that claim without paying a bean of my meagre £75 food for 2 days bill.\nSimply awful customer service , my wife and i have been BA Flying Club members for years but honestly, never again, hope the shareholders enjoy my costs money in their profits"
  },
  {
    "reviewDescription": "We flew premium economy to NYC on the 10th of May. And what a pleasant experience that was. The plane was clean, fresh and modern, the air smelled clean, so first impressions were good. Then we were served snacks and a drink by a cheerful flight attendant. When I pointed out that there was milk in the snacks, she went and got me a bag of mixed nuts from the business class section. Then the meal came. I had pre-ordered a vegan meal for myself, my husband had a curry. The food was fantastic, everything was tasty and fresh. They even had soy milk for hot drinks. We want to thank BA and give Caroline a massive thank you as she went above and beyond to ensure the flight was a pleasant experience.\n\nWord of advice to BA, it might be time to find a better flight partner than AA as our return trip was below par."
  },
  {
    "reviewDescription": "British Airways are really bad in every terms ,customer services is the worst\n\nI was on phone with them for at least 1 hour to make sure i didn’t get no-show,so that i can at least claim for additional baggage refund,since i was not going to board the flight due to illness. After all assurance that i won’t be marked as no-show,when i tried to claim the baggage refund later,i was told that i have been marked as No-show,how unprofessional and cheating is this of BA\n\nI was avoiding to is BA due to their bad reputation,but fall for low price,but in future 200% i am not flying with BA"
  }
]