[
  {
    "reviewDescription": "Cancelled Flight without notifying us- we were notified by Heathrow Rewards at the airport approx 12 hours before flight.\nTo date we have still not heard from BA regarding cancelling the flight.\nAbsolutely disgusting way to treat passengers - they obviously are not worried about their customers"
  },
  {
    "reviewDescription": "Flight cancelled with 4 hours notice. Put on a flight over 24 hours later. No one available to speak to that could help - the answer was sorry the computer says we can’t. Total shambles. Absolutely no service."
  },
  {
    "reviewDescription": "I used to think BA was the way to go but wow they are really not anymore. Our flight was cancelled on the 1st September last minute and after a 10 hour wait at the airport my wife and child had to fly home on a separate flights. That was difficult enough but since returning we have submitted a claim, that was 33 days ago and according to thier automated chat it is still waiting to be reviewed.\n\nI have tried calling but answering their questions it’s just ends the call telling me to check the website. It does say it can take upto 28 days and they do seem to be cancelling lots of flights but really, 33 days and it’s not even been looked at, that can’t be right."
  },
  {
    "reviewDescription": "Genuinely the worst experience. Air hostess was scatty and sarcastic, there was no food to even buy on a 4+ hour flight, I had to queue with my pregnant wife for 2 hours at the airport in Las Palmas while the staff slowly worked through the club Europe line. Will never fly again with BA as the cheaper airlines are better quality at every level"
  },
  {
    "reviewDescription": "Would give zero stars. Cancelled our return flight home from Newark US which was due on 17th June??, but no reason given as to why aside from an email letting us know.. i know another group didnt even get the email and only found out this morning their flight is cancelled too\n\nShoddy service didnt even give us option to rebook ourselves on alternative flights, had to go back to agent and then pay £45pp x 3 of us.. for their rebooking/admin fee.. what a joke! Why do we have to pay when you cancelled the flight on us?? Will be writing to ABTA.\n\nBA the jewel of Britain is now the joke of the skies"
  },
  {
    "reviewDescription": "Shocking non existent customer service. After phone calls, emails, complaints I was told I would get a response in a couple of days. 2 weeks later still nothing. Wish I had read these reviews before booking. Avoid Avoid Avoid. I have even asked for a Managers email or CEO to be told they don’t have contact details! FCO travel advice changed line young female can no longer travel. But it’s ok BA have their money and no F***s to give"
  },
  {
    "reviewDescription": "Travelled for 11 hours to Johannesburg with no entertainment system working in the seat. Steward tried to fix but nothing, offered another seat but that meant separating from my daughter. The food was absolutely disgusting!\nOn return flight from Cape Town we were literally frozen to death it was sooo cold. Ate before we left the airport so we didn’t have to face the foil containers full of yuk!\nFar too many plastic bottles and cups being used"
  },
  {
    "reviewDescription": "It is so said when you see a brand lose not only their identity but more importantly their values.\nDepartments working as separate entities - resulting in time, hassle and further frustration for customers trying to locate someone to actually help.\nNo escalation on calls, a website that is difficult to navigate when you want to actually speak with someone\nProcesses that don't match or flow through the company and aim to benefit the pockets of BA at the detriment to consumers - which is dangerous in the current climate.\nLack of training and understanding of legal phrases and conversations.\nBacklog that is not due to covid (as you will be told) but clear and evident inefficiencies in being able to manage a team, prioritise workload and understanding a customer.\nI came away from this experience feeling let down, deflated, blackmailed and bullied - but when they have £1300 of your money - your hand is forced and i cannot say i am even looking forward to my holiday.\nBetter customer service and appreciation with RyanAir - a shame they don't do long haul.\nGet back to basics BA (no wonder you are in trouble)"
  },
  {
    "reviewDescription": "Check in process is such a pain. Does not store your data and when you leave the app to copy starts all over again. Can't log in to the website, which keeps changing but never improves. They never announced delays until last minute, and don't bother updating the flight time at the board. You have to come all the way to the gate to find about the 1h delay when the board says gate will be closing? No wait... after waiting for an hour it's actually another hour late! Wasting my time seating by the gate for 2h when I could be at the lounge.. thanks British Airways."
  },
  {
    "reviewDescription": "We wanted to change a passenger for our package holiday. To change the passenger on our outgoing flight with EasyJet would cost £55. To change our return flight with BA was going to cost us the price of a new ticket - over £500!!!! They would make any spelling changes, but not what they called a ‘body swap’. How can they justify this? The so-called ‘budget’ airlines can change a passenger, but not our ‘national carrier’. Shameful."
  },
  {
    "reviewDescription": "-0 is what I would like to give...\nStaff, some absolutely lovely and helped my now fiancé propose to me with the help of the captain. Some were just plain sour faced.\nMy fiancé's luggage arrived at our destination 4 days after we arrived, so we were unable to go out and enjoy 4 days of a 7 day trip. These four days were spent trying to get hold of someone who would actually speak with us. Frequently the update on the online 'lost luggage' changed, we had no idea what was happening with the missing suitcase. When it did arrive it was badly dented but thankfully still locked. I will be looking for an alternative airline next time I fly. Such a shame to have to write this as some staff went out of their way to make my partner's plan work, but overall, the general attitude of BA has left a nasty taste."
  },
  {
    "reviewDescription": "If I could give zero I would!!!\nFlight to ny: We arrive at heathrow Fork Milan and the flight is in overbooking!!! One night spent near to the airport and 1 day of vacation gone!!!!\nReturn flight: canceled!!!! They rebook a flight at 8 am instead of 6 pm and make me loose another day of vacation!!!!!\nTerrible!!! Worse than the worst low cost company"
  },
  {
    "reviewDescription": "Our flight was delayed due to the Air Traffic control issue that affected most airports and airlines in Summer 2023. That is not the reason for the low score as that was not within BA's control. What was within their control is their updates to customers. We were told to come to the airport on the usual flight time despite it showing as delayed by two hours as it may still depart on time unless we receive an email stating otherwise. I got that email at 9.31am, our flight was scheduled for 9.35am. So we arrived hours early to sit around (with young kids) and eventually the flight departed at ~12.30pm.\n\nA second issue was with the flight attendants. The plane was half empty with rows with just one passenger. There was one row completely empty so we asked if we could move one of the kids there to go to sleep but were told the row was broken, then blocked. When I queried why, I was given the most ridiculous excuse that since the plane was not full it was unbalanced and the row needed to remain empty to prevent the plane falling out the sky. Ten minutes later 3 flight attendants sit in the row and go to sleep!"
  },
  {
    "reviewDescription": "I feel I am not alone anymore, seeing so many complaints here, knowing my experience with the airline probably somehow ''normal ish''. Last year, my husband and I excited to join the post-pandemic travel chaos while Heathrow cancelled tons of flights and queues at the airports were massive everywhere. Our trip was not far, only to Milan. They keep sending us flight was on schedule until last minute the flight was cancelled. Knowing not everyone lives in London, they redirected us to Gatwick next day, which not gangrenated would take off either. Not a single customer person to deal with the issue. By this point we paid car parking and it was not refundable once we in. Too much to loose if next day flight not going to take off so we cancelled the flight and drove home. There were many flights were not cancelled but I guess our flight was just not full enough so they chose us to cancel? It was very stressful to deal with hotel, tourist attraction ticketing cancellations. After all, we have been contacted BA filled the foams, waited several months before they got back to us. Answer was : ''not under their control. ''emmm...so not met their compensation claim''. So many months later, we still out of pocket and it was worst experience with them ever. ... BA can say pandemic caused everything, but there were many countries did much better job than us during that time. For example Italy. Ask if I'd still travel with them? I would avoid as much as possible, no more long hauls, other short trips, I would find alternatives where possible. I am sure they would not care for an individual like me."
  },
  {
    "reviewDescription": "worst airlines !!\n\n\nCanceled my flight 3 hours prior and its been 3 months with no compensation."
  },
  {
    "reviewDescription": "The worst company ever! Never again."
  },
  {
    "reviewDescription": "BA prioritises greed over doing the right thing for their customers.\n\nOn this occasion they wanted to charge me for the privilege of giving up the outbound part of my fully paid return flights. This seems like an incredibly pointless way to irritate customers?? Especially when they could potentially increase their revenue even further by reselling the seat.\n\nWhen I complained about this experience to BA’s customer service team, the representative simply pretended he couldn’t hear me and hung up the call.\n\nI’m a frequent flyer and already actively avoid BA (in favour of Swiss) for my London-Geneva flights after being repeatedly let down.\n\nI will now actively avoid BA wherever possible for all future flights.\n"
  },
  {
    "reviewDescription": "I really do not understand this. Booked a business class seat online with BA to Morocco in January for September travel Paid £502. Had to cancel the flight in June. Put in a claim and only got £85 back. It’s a joke. Before I put in for the refund, I was trying to find the terms and conditions but they do not make it easy. Why do they not provide a breakdown with deductions when they give you the refund? Seems, this is how they make their money. Will take my money elsewhere in the future."
  },
  {
    "reviewDescription": "Flight from Heathrow to Reykavik.\n\nBoth flight were on time, we were kept regularly updated and the flights were comfortable.\n\nSome (only some) were a little unfriendly, but overall much better than other competitors at the moment.\n\nThe self service machines were useless if I'm honest. The check in information guides you to them and most people had challenges and ended up going to humans, which was much easier. The machines are located next to the \"meet and greet\" pod, which is manned by a human, who advised that they could not help unless I was business class - a little frustrating given that no one was even at the desk and the self service pods were within reaching distance.\n\nBased on the overall experience, I would book again for sure."
  },
  {
    "reviewDescription": "I booked return flights from Belfast to Columbus Ohio for the 01/07/23.After numerous flight changes and airline changes my flight went ahead.The night be before we were due to fly home I noticed that ba had booked me flights in which my second flight departed before my first flight arrived.after six hours of waiting I was booked new flights.Within two hours these flights were cancelled.More hours on the phone and an overnight stay in a hotel.While at the airport these flights were cancelled.Ba are refusing to consider my claim as they had passed my flights to American Airlines.However it was ba that had booked impossible flights in the first place.I will now seek legal advice.In the meantime I will highlight my case on as many social media sites as possible."
  },
  {
    "reviewDescription": "I’ve flown with Ba not had any issues until the uk lockdown in feb 2021, as a uk passport holder i wasn’t allowed to leave the country for international travel so had to except an e voucher from Ba, I can’t believe Ba have refunded for the 2020 lockdowns flights but refused to refund for January to March 2021 flights my voucher is 2 years old next month and the flight was completed for other nationals who was allowed to leave the uk Ba are refusing to refund cash I know I have lost my money because due being high risk if I catch covid 19 I won’t be travelling for many years until it’s safe for me to do so. I hope Ba enjoy my money while spending it on jumpsuits for staff, they must have made millions off people who either can’t fly due to health or now being out priced with Ba over priced seats. Ba should rethink there policy not everyone can travel abroad if health is put at risk!! Wish I could give them 0 stars very unhelpful customer service."
  },
  {
    "reviewDescription": "BA hit a new low in its decline today. As a Silver card member I can use the lounge with my partner but the reception said our12 year old wasn’t allowed in and would have to wait outside, or I could take my son in and leave my wife waiting in the corridor.\nBA has been left behind by Emirates, Cathy, Etihad, Virgin , etc but now it’s struggling against the value operators.\nThis was my epiphany to finally switch allegiance."
  },
  {
    "reviewDescription": "We’ve just come back from a trip to Mexico and Miami and flew with BA on our inbound flight back to London Heathrow today. Having had a disastrous experience with Tui on our outbound flight we were dreading the flight home but the experience we had with BA was absolutely fantastic. Darren in particular was so friendly and went far above and beyond our expectations. Nothing was too much trouble, if he didn’t have it on his trolley, he would find it elsewhere! The whole team were polite and welcoming, and were attentive to everyone on board which is a lot more than could be said for the other airline! If there is the opportunity to choose BA for our next holiday we will absolutely use them again. Thank you!"
  },
  {
    "reviewDescription": "My wife booked flights to Switzerland for this month, to attend a memorial for her brother whose funeral most were unable to attend during Covid.\nBA cancelled the flight and would not answer the phone to confirm our options, instead giving a recorded message that they were prioritising people who were flying that month (which we were) and advised to make changes via the App.\nSo she tried to use the app, and found an alternate flight, which I couldn't do but we agreed she should go ahead and just cancel mine.\nShe changed her flight - and mine changed automatically too. No function on the app allowed us to alter this. So we had to phone, and phone, and phone.....\nWhen we finally got through the BA rep implied they had no sympathy that my wife had accidentally changed both flights and thus we were no longer entitled to a refund under their 'fair use' terms. Their laughable title, not mine.\nWe asked to speak to a manager - she refused. She did finally talk about vouchers and e-vouchers and explained the benefit of an e-voucher was it would be possible for my wife to use it within the next year, the other type of voucher only I could use (despite the fact that my wife paid for the flights). So we asked her to go ahead with the e-voucher. She then told us that we now had a useless voucher - not the e-voucher - the system had decided this and she had never promised an e-voucher anyway.\nVoucher is no use at all - I will never fly with BA and I can't image my wife will too. Smug 'Gotcha' Ts and Cs from the 1980s with no idea of customer service - so disgusted with them - really feel for the staff who have to deal with customers face to face rather than shielded by a phone line.\nI will never ever use BA and will not hold back in advising others not to either."
  },
  {
    "reviewDescription": "Where are the £539 holidays to st kitts you’re advertising. Can’t find them anywhere. Put in loads of dates, airports, you’ve hidden them well. Just tell me where they are. I can even go next day"
  },
  {
    "reviewDescription": "Apart from cancelling the flight with a sort notification, the customer service was lying to me about emailing the extra luggage refund. There was no such email and then I learnt that the system does not provide such however the customer service was insisting that he was sending the email and I should check my email better"
  },
  {
    "reviewDescription": "Our flight was cancelled one minute before boarding. Luckily, after being on the phone for over an hour we were able to get transferred onto a different flight that was leaving several hours later. The man on the phone told us he would sort our luggage transfer for us, but instead of relying on him, we spoke to a lady at the airport. She told us to leave it with her and she would ensure our luggage would go onto the correct flight.\n1.5 hours before boarding the new flight, we thought we would double check with someone else that our luggage had been transferred correctly, to which he told us no, our luggage was still on the first delayed plane!! He told us to leave it with him and he would ensure we got our luggage.\nNeedless to say, that when we arrived in Heathrow our luggage was not there. We were told by the lady at the lost baggage that we would likely receive it back in 72 hours.\nThe next day, we received an email to tell us that our luggage was making its way to Heathrow. Then, for the next two days we heard nothing. When phoning BA they confirmed that our luggage was definitely with Heathrow and that we would receive an email the next day to tell us it was on our way to our home. This never happened, and BA continued to give us the same response every single day for an entire week. Getting frustrated, we phoned the airport we were travelling from who told us that THEY had our luggage and that it wasn't at Heathrow!! The next day we got another email to tell us the baggage was being sent from that airport to Heathrow, and BA continued to tell us we would then receive our luggage 48 hours later. We have never received our luggage, and BA are continuing to tell us that Heathrow definitely have it. If Heathrow have our luggage, THEN SEND IT TO US! We have literally been waiting WEEKS for our luggage that they apparently have.\nBA's customer services are absolutely diabolical. All they do is write a note on their computer that we called and they do NOTHING to help you. If you ask to speak to their manager they will deny you this. If you ask to make a complaint they also deny you this, telling you they do not deal with complaints. I am confused with what exactly they DO deal with, considering they do NOTHING apart from lie to us and write notes on their computer!\nWe fly with BA several times a month for work, spending thousands of pounds a year. We will now be cancelling all future flights and using other providers. Absolutely appalling."
  },
  {
    "reviewDescription": "Our flight has been cancelled. We booked our holiday 6 months in advance and ba cancelled 14 days and a couple of hours prior to departure, just in time for them to avoid compensation claims. They don't try to help just explain that you will have to claim a refund or another flight. If you try to call they have a message that claims they are busy and asks you to call later, it never works. The only way through is to choose an option that makes it look like you will spend money with them. If you try to complain about their service to them they have a very clever method of preventing you, you choose the 'cancelled flight' option then it asks you the details of the flight but because the flight is cancelled it doesn't recognise it so you can progress any further. We tried to cancel our car booking but it will not process it on their website, just says 'try again later'. BA does not care about their customers they have designed there whole service around not loosing money and have lost any empathy for their customers. I used to be proud to fly with British Airways but they have sunk to such poor quality that I will not risk using them again."
  },
  {
    "reviewDescription": "2nd(domestic) leg of return flight from Madrid via LHR to Glasgow cancelled approx 10 minutes before departure time without any explanation. Herded like cattle to another gate and told nothing for 30 minutes. Eventually given a letter and vouchers for overnight hotel, food, no drinks, and transport that just didn't arrive. Told next available flight was in 51 hours. No BA staff around to help, got one other pathetic email and heard nothing since, that was 4 days ago. Also had to make our own arrangements to get home by taxi and train. Truly abysmal performance from the UK flag carrier and what used to be the world's favourite airline."
  },
  {
    "reviewDescription": "So shocked by this airline. In all my years of flying with cheap and cheerful airlines, the irony is that when I happened to book flights as part of my package deal through BA, I made the mistake of thinking I would get a superior service. How wrong I was. This company is a complete con and if you need to change the name on your booking (to a different person), they force you to buy BRAND NEW TICKETS. First of all they tried to blame the travel agent, but no, let's be clear: the travel agent was more than happy to make the change. It is BA's policy not to allow name (person) changes. I have never had a problem in the past on the occasion that I've needed to change passenger details. BA seems to be the only airline that doesn't offer this extremely basic, simple service. It is so basic and frequently requested in fact that I'd go as far as to say it's one of the only functions a passenger needs to contact customer service about at all - so why bother offering a 'customer service' line if you have no policies in place to support the customer? Truly shocking. BA quite sinisterly term the simple procedure of changing the name on a flight as 'body swapping' and speak of it in hushed tones as if it is the most unspeakable request imaginable. Back to Easyjet I go."
  },
  {
    "reviewDescription": "At Las Palmas the check in only has 1 of 3 desks manned. 1/2 hour since check in opened, and no Euro Traveller passengers checked in.\nWorse by far than budget airlines. Jet2 next to us, has 3 check-ins manned and little queue."
  },
  {
    "reviewDescription": "I have booked throughout on the BA website a ticket reference number: QW8CF2 17th April 2023. It's showing a checked drop suitcase at the time of selecting the ticket, however, once I have completed the ticket the BA system automatically changes it and generates a ticket without checked baggage. Thereby I call customer service and fully processed my refund which I am still waiting for it £400. I believe that your website has an issue. Perhaps, I have to pay for more nights to stay at Lisboa hotel executive art Hotel at a rate of £138,10.\n\n\nTherefore I have decided to book ticket throughout on BA website again, in order to travel home today 18th of April 2023, unfortunately, the BA system generated the wrong destination book ref TYMFKD 18 April 2023: For instance, I selected return tickets from Lisboa to London on the 18th of April 2023 and return on 25th of April 2023, however the website generated the wrongly destination and give me one way ticket from London to Lisbon when I am in Lisboa and I suppose to departure from Lisboa not from London.\n\nWhereby, there was two attempt through my bank apps and accept the payment via secure, unfortunately, BA system did not take the payment of values of GBP £303.04. Around 1:20 pm on 18 April 2023. Nevertheless, the BA website site takes me to their payment page and requests me to re-enter my Visa card again. Perhaps on the second attempt and did went through but give me a completely different destination. I am right now in Lisboa with my family. I did not hesitate to contact customer services on 03444930787 at 13:5pm on 18th of April 2023 today. Perhaps, I did experience very poor customer service. BA member of staff made me stayed on the phone for quite long, unfortunate she did not cooperate, and she was going around a circle and creating an environmental hassle. I have requested to refund of the full amount, unfortunately, the BA staff put the phone down. However before she decided to put the phone down she was hold\nPhone without an excuse and created a reasons to put the phone down and left me behind, I have to stay in Lisbon Hotels once again. Also there a mistake with one of the passager Mrs Pereira who I brought a ticket more than five years ago has appeared on my ticket on the 18th of April 2023, it's supposed to be Princely who is my daughter, Perhaps you should delete that information. There are two attempts on my account as explained above. Whereby, BA are holding a total of £700 of my money and left me and my family behind without an option to eat and also I am running out of pocket money. It's very sad in the 21st century still has people with lack sensibility training. She was pretending procedure.\n\n\nI Do believe that BA has issues with their website (IT Errors) but they not accept the responsibility. I have look to review on tripadvisor there is a lot of people complaint about it."
  },
  {
    "reviewDescription": "I have been a loyal member of BA's one world for many years. A few months ago, I booked a flight in Europe for myself and a friend. Two days after I booked my friend cancelled the trip, leaving me to pay the full cost. I rang BA, asking them if I can change the name of the traveller, as another friend offered to go. I was prepared to pay for changing this. They would not allow me. They offered to give my friend the credit for the unused flight, despite my insisting that she had not paid for the flight.\nI was encouraged to cancel but they kept 95% of the original fare. This is despite them sending me an email saying that I would get a refund of about 90% of the fare.\nI have made numerous calls and I get referred to their website, which does not cover the matter."
  },
  {
    "reviewDescription": "My son was flying out from Manchester via Heathrow at\n7 a.m in June 2024 to USA to a new job and BA cancelled his flight the evening before by email. It was panic stations so called the number provided and they managed to book another flight with American Airlines.\nArrived at Manchester few hours before to find a massive queue and two staff at the check in. One of the staff then kept serving the business and 1st class customers first. We were starting to worry as my son could miss his flight. Later on another member of staff joined the check in, no rush mind and then another staff member announcing to customers who was catching the 7 a.m flight to be let through the queue. My son managed to finally check in but then had to rush to get to his flight. So a quick goodbye. My son now needs to get home earlier so having to change his flight. On his account there is an option to change date and time of flight. When clicked on this it says cant change on line and have to call BA. Why have this option then? There is no email address to make contact. He can't get through to customer services on the phone as it keeps saying agents experiencing high volume of calls and call back, then they hang up the phone. He and myself has been calling for over a week now to hear the same\nmessage. Today he finally got through having to wait on line for an advisor for 30 minutes. The advisor said to give him 2 minutes to advise the costs for changing the flight, only to be cut off!!! My son doesn't have time to keep trying to call them\nin his job so it may look like he is stuck there, let's hope his visa doesnt run out! This is highly stressful and frustrating. Do not fly with BA the customer service is shocking!!"
  },
  {
    "reviewDescription": "2 hours fly. 2 hours delay"
  },
  {
    "reviewDescription": "If there was an option for 0 star, I would have given zero star.I booked a flight for my wife From Manchester to London and then London to New Delhi.First flight late by an hour and because of this she had missed her second flight. After long drama, British Airways booked another flight but it took off after long 12 hours.When she reached Delhi, she could not find her luggage.Airport staff assured that it will be delivered to address within 2 days. She went to India for brothers wedding and had her jewellery and traditional expensive clothes in the luggage.She had to buy everything again as they were making fake promise everyday.After a week, when she was about to leave for London, 2 gentlemen came on 2 wheelers motor to deliver suitcase.She was shocked to see that suitcase was broken and had scratches everywhere.While coming back to UK, again first flight delayed by 2 hours and then again second flight delayed by 4 hours.This company is a joke. I have promised myself that I will never use British Airways even if I am ban by all the airways in the world."
  },
  {
    "reviewDescription": "Avoid. The website and app are simply appalling. Error after error and terrible information about the process. Couldn’t reserve seats online for my return flight so had to make a 15 min call which will probably cost a fortune. I won’t ever book BA again."
  },
  {
    "reviewDescription": "L`abandon total par British Airways.\nMon vol initial a été annule par BA pour problème technique. BA m`a renvoyee récupérer mes bagages et c`est tout et vers un service pour le logement de la 1ere nuit. A moi de me débrouiller pour la 2eme nuit, de payer mes repas pendant 2 jours. Aucune aide par BA. Que faire pour mon travail et pour les elections ?\nA fuir pour vos prochains voyages ! Très déçue de cette compagnie pas low-cost"
  },
  {
    "reviewDescription": "My account was hacked, with the hacker changing my email and password, yet not having access to my Avios points. I tried resetting my password online and was unable to do so, given my email address had been changed. There is no easy to find contact number on the website to help address this. I then called up a central line number I found, and after a while queuing was subsequently told that the issue was being investigated, but there were no clear steps for how this was being resolved. I provided my details, and was told that I could not change my email address for 1 week+, and was told I would be contacted on this, yet given my email address has been changed, the BA team did not inform me how this contact will happen! They have made this process very difficult and stressful, and this is aside from the awful customer service they provide, as well as late cancellations to flights and delays. I would recommend getting a different rewards credit card to the BA Amex, as this offers no tangible benefit that I can see."
  },
  {
    "reviewDescription": "Flew back from Cancun to gatwick on 8/3 landed on 9/3. The flight was delayed several hours. When we finally arrived I raised a claim the same day as it falls within the parameters. Still haven’t had any feedback on this dispute whatsoever from BA, received about 5 emails saying the exact same thing ‘ apologies for the delay we are looking into it ‘ . Considering we had a similar issue with Ryanair a few years back and the claim was dealt with and processed inside 48 hours. With BA it’s now been 6 weeks and no signs of a reply anytime soon. Shocking customer service"
  },
  {
    "reviewDescription": "I've travelled on BA several times over the years. BA have always been my airline of choice. My experience has mainly been of clean planes, bright interiors, helpful crews and a general less cattle class experience than low cost airlines. In past three years Ive had a number of flights cancelled or rescheduled due to covid and capacity issues at Gatwick. Unlike many on Trustpilot BA have always assisted in accommodating changes, vouchers etc (once actually get through on the phone). In my experience I'd give the,punctuality, plane crew and ground staff 4-5 every time!\n\nHowever, I'd give one based on my customer experience since April where I've been trying to get a full refund or voucher due to my having to cancel a flight on 19th April. Which BA customer care agent(s) erroneously claim couldnt be cancelled due to one of the two passengers having already 'checked in'. The two passengers being me and my 10 year old son who was waiting for his passport to arrive which didn't arrive in time hence we couldn't fly. BA have been totally disintrested never asking for any information including screen shots from when I tried to cancel in good time. Despite this apparent data breach dealing with BA for valid refund has been a nightmare. I've probably had to exchange over 25 emails with BA complaints department who ignore the specifics of my complaint and copy and paste standard text or clichés responses each time after I wait weeks between replies. BA cant confirm who or when one of us checked-in, despite the security issues relating to a seeming imposter passenger. Im now waiting BA 'deadlock' letter before the further agro of independent escalation/small claims for what is a modest sum of a voucher that ironically will be used on same airline anyway! So frustrating as if BA complaints and/or customers services (assume role is to resolve issues) where to actually look at my experience they'd see the fairness of processing a full refund/voucher without further delay."
  },
  {
    "reviewDescription": "Great flight experience - love their staff, they are always so helpful and polite. We upgraded on the way to Vegas and they were so good to deal with.\nOne star down because you cannot get hold of the right people to speak to on the phone if you book a BA holiday - it's an hour of your life you don't get back, and often they can't help. Wish you could manage your holiday better online -then I would travel more."
  },
  {
    "reviewDescription": "Disgusting, not even a service, booked on BA1337, did not find out the flight was cancelled until we arrived at Newcastle airport, and any staff wearing BA neck bands we spoke to said they worked for Swiss Air. This airline is just another example of Broken Britain. The flight should be leaving in twenty minutes and we still have not received an email or text or anything to say the flight is cancelled, and when you call the number we were given at Newcastle airport, you get a message saying ‘we are not answering phones, contact us online’ I will never use this company again! Utterly awful service!"
  },
  {
    "reviewDescription": "Cancelled flight while we were at the airport. Next flight 24 hours later to a different airport. No reason given. Additional cost both financially and in our wasted time. Put in for compensation and not had this dealt with. BA take your time and money for granted as customer service means nothing, no contact number to call and no email address to request an update.. absolutely disgusting service.. Will never fly BA again and will share our experience with others.."
  },
  {
    "reviewDescription": "Had a holiday booked for mine and my wife's 40th with our 2 young kids to Mexico.\n\nAfter flights were booked my dad was diagnosed with cancer cancer I had to cancel our holiday months before the flight\n\nBa would not refund or would give any options like open ticket or voucher for the value or anything just money was kept... Around £2800\n\nAs my dad was depending on my for scheduled and unscheduled hospital visits there was no way I could go\n\nLuckily the rest of the booking was refunded just British airways kept 100% of the money with zero help to do anything.\n\nReally disappointed and will never fly with them again the ethics of this company is so poor\n\nI literally would have accepted any help or voucher but was told nothing could be done .\n\nOn a side note the seats were resold as the flight was full as one of my friends checked this day before flight so they had no issue selling the seats with the 2 months cancellation before\n\nMy dad's health was more important to me then this holiday and money but I would have loved anything help wise form this company and can't compromise but no flat out zero help"
  },
  {
    "reviewDescription": "Oh dear - what a palava...\nit has taken us months and months to get our flight bookings right and i only had them finally confirmed a week before our trip, despite being told on at least 2 occasions that everything was sorted. Customer service has been at times atrocious and our personal 'manage my bookings' page confusing and inaccurate. i must balance this by saying the final guy we got Moné did a goo job of getting it sorted.\nhow can a company of this size get it so wrong?"
  },
  {
    "reviewDescription": "You go through to a call center the other side of the world they don't care as you can't trace them...for 7 hours I've been cut off called back told I can't change my seat then told its done when it hasn't been...now told my seats have gone....it's an absolute shambles....6 different incompetent people.....from 7.15am to 2pm.....\nYou get better service from easyjet and other budget airlines won't be booking with BA EVER AGAIN"
  },
  {
    "reviewDescription": "Had to cancel flights end Aug 2023 due to family bereavement. They offered full refund. More than 3 months later I’m still waiting for part of the refund. Totally disgusting treatment and service. Shocking !!! Made official complaint weeks ago and no response at all. So disrespectful under the circumstances. Blaming people in India for the delay. Don’t know what to believe but I’m NOT impressed at all. Behaving like a Mickey Mouse company!!!!"
  },
  {
    "reviewDescription": "Please read this, Me and my Mrs had only 10 flights in 2024 all business class and all European holiday flights, only one went on time, every excuse possible not to fly, a bird strike, a scratch on the wing, air con faulty, pilot overtime, lost slot, fog, cloudy, to windy, no one to operate the jetty, move to another airport by bus, it goes on and on and on and on, they change my fully paid for club class sets without any notification. Also 2 flights they couldn’t serve any nuts because of some nut idiot on board had preferential treatment over the remaining 150 passengers, when did this woke nut lot suddenly invent this, BA said it’s a fatal allergy lol, next time I’m taking a snickers on board, please watch Ricky Gervais nut allergy hilarious and it’s very true, the last 2024 flight which was yesterday was delayed and we sat for over 3 hours on runway for a 1.15 hour flight and then they said the food could poison us due to the delay so didn’t serve any, it was a salad lol again, they are so woke so pathetic it’s beyond a joke, the club class check in T5 is a disjointed mess out of control queue which is now much longer than euro travellers, the club bags always come off last, if you tell of your disappointment the staff look at you with horror as if you are a right wing racist, it’s bonkers, shocking clueless management from the top down, who are these people! The worlds most hated airline, we added it up, we actually spent more time on the runway in 2024 with delays than actual flying, just got back from Geneva spent 3 hours sitting on the runway 2 passengers in club after 2 hours said at least give us a drink, BA crew said we can’t it’s against policy, the 2 lady passengers then were very angry and rightfully so missing a connection flight, in the end BA served some drinks reluctantly. When I boarded this last 2024 flight the attendant said how’s your day going, I said it was ok until I got on this plane, the look of horror her woke jaw hit the carpet, I was right as we sat on the runway as stated for over 3 hours. According to some friends this just doesn’t happen with Ryan air or Easy jet they just go and we watch then out the BA window, It’s a bus nothing more nothing less. BA have taken over so many routes they now need to loose some or all of them. Is it hate speech because I hate them? I’ve got to find an alternative solution for 2025, I promise anyone who reads this there is no exaggeration, it’s worse than I can explain in this review, enjoy your vacation or business trip hopefully without this lot. I’ve never claimed compensation as I simply don’t have the time to fill it all in as they deliberately make it very difficult to talk or claim. I don’t expect a reply. Ohh I forgot they also lost out luggage on a flight."
  },
  {
    "reviewDescription": "I am not flying with this company again. Their app doesn't work, you can only check in on-line 24 hours before departure (stressful if you're on holiday trying to sort your return flight), and they forced about 20 passengers to put their tiny carry-ons in the hold, even though plenty of overhead bins later proved to be only half-full (I could actually see them). And then the cabin crew ask you if you're having a nice day as you get onboard!\n\nAn utter state. Organisation insults the customer in about every way possible."
  },
  {
    "reviewDescription": "Cancelled flight with just one days notice. Refused to pay legally due compensation."
  },
  {
    "reviewDescription": "I have been trying to get a refund on my flight because my grandmother died. They continue to hang up, fight with me, and disregard the issues that I am having. They are rude, insincere, and escalate issues instead of resolving the issue. This has been the worst experience of my life."
  },
  {
    "reviewDescription": "They really have gone downhill fast. I have flown BA for 25 years and now never again. Constant IT problems, 3 operational reason changes to a flight. Appalling customer services agents, who have no idea what they are doing. Very poor."
  },
  {
    "reviewDescription": "The criminally low general rating is very true. This company staff will not eat food, take taxi, use seamstress or anything else rated so low, because it's simply dangerous.\n\nMy nerves was seared out. I got email my flight on 03.10.23. booked on 13.03.23. is cancelled. There are no expected any problems with weather. They did offer flight one day earlier, but my hotel is booked from day after.\n\nAsk compensation for discomfort and pay for extra night stay is a LIFE LONG PROCESS AND MOST EXPECTABLE USELESS.\n\nThis travel is important to me, I started to check another possibilities and nearly bought tickets.\n\nTo use their so called \"live chat helpline\" is absolutely useless. Somebody like Chara wasted my unpaid time over half an hour and in the end cutted feedback option.\n\nWhat I asked was to ensure my flight is rebuked to BA offered changed fly. She/he wasn't even able to check is the flight renewed when I got a new email. NOTHING, what she/he is paid for? For hanging pasta on our ears?\n\nShe/he did ask me repeatedly, 3 times together with beginning my details and couldn't find NOTHING. While chating I got text msg from booking.com warning about the changes and order number. She/he said it's a wrong company(???) and couldn't find nothing using ALL my details.\n\nBA, why you are employing people(?) from jungles? Because you don't care about those on whose money you exist and comfort your own and your loved ones lives?\n\nFly to Hell one way. On your place will come respectful company.\n\nPlease don't dare insult me with useless apology. Only covered with compensation I will accept."
  },
  {
    "reviewDescription": "Terrible experience. Cancelled my flight one month out, only offering an alternative 2 days later which will not work, and have to try calling them 15-20 times before they answer due to 'experiencing more calls than expected'. Awful customer service and worth paying more to go elsewhere"
  },
  {
    "reviewDescription": "I always used to enjoy flying BA but the service has massively diminished in the past few years. I was due to fly to Marrakech on the 25th March, there was a fault with the plane so a replacement was found with too few seats, fair enough you don't want to fly on a faulty plane but the communication to customers was terrible and we only found out after a 3 hour wait when trying to board the plane we were not allowed on and there was no plan for when we would make it to Morocco, it then took a further 3 hours to get our luggage back and exit the airport with no idea of what replacement flight options were on offer, no one to talk to with any useful information. I was then put on a flight two days later which had a stop over, as I was supposed to be joining a touring bike trip this was too late, no one at the airport could help me find another more suitable flight, nor on the telephone line after waiting in a queue for 1.5 hours. When finally managing to speak to someone on the phone I asked them to refund my flights and cancel the return as I had missed the tour. After waiting 10 days I phoned to chase my refund for flights and was told this had been rejected, as my cancellation hadn't been logged correctly. I now have to wait a further 10 working days to see if I can get a refund. Other people who made the flight from my group have been paid compensation for the delayed flight, I have not have my claim for compensation responded to for missing the holiday nor is there anyone I can talk to at BA, the call operator I had was not able to help me, after spending another 1.5 hours on the phone. It's really frustrating that you cant speak to anyone at BA who can have a sensible conversation about the poor experience I've had on my missed holiday due to the flight cancellation. It feels like BA don't care about reputation and protecting future business from customers."
  },
  {
    "reviewDescription": "The worst airline ever. Website is terrible, no one answers the phone and they cancel flights and just email you, they don’t even call you."
  },
  {
    "reviewDescription": "I was going to write to BA but I really don't think they care enough.\nHere is our experience of LHR/YVR/LHR:\n\nCheck in. Told that the first class check in area was busy and to use the regular check in.\nFirst class lounge outbound: Luke warm soup, luke warm salad.\nOutbound flight: Fantastic. But, our baggage was offloaded after about a hundred other bags. We expected some sort of priority.\nFirst class lounge inbound: Terrible. Dirty seats / area. Self service and a tip jar on the counter.\nInbound flight: Brilliant.\nHowever, we have only just received our bags. 3 days after we landed.\nI'm sure that blaming the airport will feature in BA's reasons for offering such a poor service. I may be wrong but isn't BAs handling done by BA?\nNo public announcements were made until we personally asked the customer services representative. We were then told a series of ever changing excuses as to why our bags hadn't come off the aircraft until, after a 3 hour wait, my wife had had enough and requested them to be delivered.\n\nBefore you start to think we are rich people who can't be pleased. Don't. This was our honeymoon trip which was booked over two years previously.\n\nCovid intervened, which was not BAs fault, but during this time BA attempted to downgrade us on more than one occasion. We spent in excess of 5 hours on the phone to various areas of BA, arguing the right to keep the seats (class of ticket) that we bought in the first place.\nBA should be rightfully ashamed of giving this quality of service to any passenger. To offer this service to a first class passenger is an absolute disgrace.\nIf BA read this please be assured I will not be palmed off with a free T shirt or the 'threat!' of a discounted ticket. I do not want either. I just want any possible travellers to be made aware of the (lack of) service on offer by BA.\nIn future, I will not be travelling, if the only people to offer a flight are BA. It is as simple as that. I am voting with my feet. In the interim I will be using some of my retired time searching out social media review platforms to ensure that other flyers are made aware of what to expect for your hard earned money where BA are concerned."
  },
  {
    "reviewDescription": "First time i have travelled by British Airways in over 25 years. The aircrafts are old, tired and in need of upgrades. The staff are also older and more dishelved and not as smart than my experiances on other airlines.\nI thought the food was very poor and extremley small portions, seat space was considerably small for a long hall flight. We were not given enough snacks and the there was only one new release film available on the selection.\ni think when you are flying a long hall flight and dont get a warm towel it says a lot about the airline. It is also the first time in decades i have ever been delayed and usually travel much longer flights than this one.\nThis was not a cheap flight and we had to pay extra to get theseats we wanted which for infomation was only and end of an isle.\nI think my experiances with long hall flights with otrher airlines are much better and will continue to fly with them going forward.\n"
  },
  {
    "reviewDescription": "After a 14 hour flight from Hong Kong to London Heathrow, I received a message saying that my connecting flight to Glasgow was cancelled due to operational reasons. I was met at the airport by a BA representative who handed me a boarding pass and told me that I was rebooked on a flight at London City Airport. She was more interested in finding other passengers on her list than answering questions about how to do this.\nThere is no shuttle bus between the airports. I had to collect my luggage, travel across London on the Elizabeth line and then wait hours before I could check in at London City Airport. It would have been helpful if I was told that baggage from cancelled flights are placed at carousel 11 instead of the carousel for the flight I arrived on. I wasted an hour due to this. I wasn't told that I needed to take the Heathrow Express to Heathrow Central, change to the train for Abbey Wood, get off at Woolwich, trek to the Woolwich Arsenal DLR station and take the DLR to London City Airport. With heavy luggage. I wasn't told that my voucher for food was only valid at Heathrow. I had to pay for the transport myself, there is no reimbursement if I accept the rebooking.\nHere is the worse part of this, my cousin was also supposed to be travelling on the cancelled flight. She arrived later and wasn't met on arrival so she went to their desk and was rebooked on a flight from Heathrow later in the day. I wasn't even told I had a choice. The lack of information or support is staggering. After this experience I won't be travelling with BA unless I have no choice whatsoever."
  },
  {
    "reviewDescription": "7 weeks and waiting for hotel refund after plane broke down and flight cancelled in Edinburgh. Speaking to customer relations there is no one trained in customer relations to handle my question and the department that looks after this does not take calls. Asked to speak to supervisor in the call centre, I was put on hold and the call was \"dropped\" after 47 minutes. Basically if it is not on the script there is no answer and a too hard request is put on hold... According to the floor manager it takes 60 working days to get your money back... They don't tell you that at the airport... Shocking customer service and after this experience I will try my luck for leisure and business travel with another airline. At least with the likes of Ryan Air you know what to expect and don't get BS about how you love your customers and service is everything."
  },
  {
    "reviewDescription": "El día 28 el vuelo de Argentina a Londres fue un desastre. Hizo escala 2 horas y media en Río cuando tenía que ser de hora y media con la gente adentro . La azafata me maltrató y contestó muy mal cuando le pregunté amablemente si había almuerzo . Luego se olvidaron (?) de traernos el almuerzo y nos ofrecieron lo que sobró : un menú vegetariano . Una verguenza: nunca me pasó en un vuelo esto . No soy vegetariana. Me sonó a discriminación no quiero ser mal pensada.Me dijeron que por ahí nos vieron dormidos y no es así porque yo los miraba cuando pasaban y a todos les daban menos a nosotros mi marido y yo. Esto fue así."
  },
  {
    "reviewDescription": "Rude Eastern European woman who cannot speak a word of English.\n\nUnbothered and on this occasion got angry at me for no reason. She shut the phone on me.\n\nThe call was made between 1215-1229 approx."
  },
  {
    "reviewDescription": "The most unhelpful customer service I've ever encountered. I tried to confirm my (85 year old!!) Grandmother's mobility assistance for a flight we're travelling on together, because there's been issues in the past where although it's been booked, they don't have records of it at the airport. They refused to confirm whether this was booked for her (a simple yes or no answer) because I was not the named person on the booking and I didn't make the reservation. The person who made the reservation is unable to call as they are abroad. Customer Service told me to get my Grandmother to call them (her English isn't great and wouldn't be able to speak to them about it) or else no information would be provided. No doubt I'll get to the airport tomorrow and there will be issues. BA service and quality has deteriorated so drastically, it's embarrassing it's the national airline."
  },
  {
    "reviewDescription": "What a disappointment for GB flag carrier! Trip to Vegas was cancelled the same day- rebooked the same day which was good but the inbound flight that followed was terrible. Delay after delay. The 30 mins delay from Vegas took an hour, back at Heathrow, delay again in plane parking and finally our baggages were delayed again. Our supposed arrival is 1450, it is now approaching 1630 and no sign of our luggages. Terrible!"
  },
  {
    "reviewDescription": "Flexibility and great customer service from BA. I was on a business trip to Orlando and notified whilst there that a tropical storm/hurricane was on the way in. The airspace around Florida was going to close on 9th November from 4pm, so I'd presumed that the my flight out would be cancelled. BA pulled the flight forward by 5 hours, so ensuring I could get home. I was initially worried about safety as the storm was closing in, but was assured all was safe to fly.\nThe crew were outstanding, getting everyone on board on time, and I was upgraded - a total surprise and I was delighted!"
  },
  {
    "reviewDescription": "We had a flight to New York for four people from gatwick only to have the fight cancelled literally about 30 minutes before we were due to check in, by which time we had arrived at the airport. We were transferred to Heathrow and put on another flight but this resulted in an extensive delay over our original travel plans.\nWhen we got home we applied under the compensation scheme through BA and to be fair they agreed the compensation reasonably quickly. BA stated thay they would pay the compensation(£520) per person) within 21 days of the email confirming the agreed amount. Despite at least three more phone calls chasing this we are now about 6 weeks over the stated period. BA even asked to re clarify payment details which was in the original claim form. As I can see from other reviews, there is no way of contacting the customer relations team, and just seem to be fobbed off by customer services, saying they will escalate the case, but nothing ever happens.\nIts no suprise tha BA only are a 1star on here."
  },
  {
    "reviewDescription": "I had a return flight with BA from London to Zagreb.\nThe first part went well, but the flight back home was canceled with a few hour's notice (at 3 AM in the morning).\nBA booked me on a different flight the next day with KLM with a layover in Amsterdam, which was not an option for me at all.\nI canceled this booking and have had no further communication from British Airways - they only promised to review the money return for the second leg with the decision in a few weeks.\nAnd no tier points, of course, as the \"return flight\" was not finished, even because of them.\n\nI had a need to be in London this day so I urgently booked what was available that cost me more than f600 plus a whole day of traveling.\nI'm not sure if I can get back this money, but be aware - BA can cancel your important flight a few hours before with no conversations of any kind of compensation. Even with Avios points ;)"
  },
  {
    "reviewDescription": "As a first time flyer on this airline, I am very extremely disappointed. Regulations were stupid and unlike any other I’ve ever encountered, Rules weren’t clearly stated, officers were VERY VERY RUDE, DISRESPECTFUL, CRASS. My family and I don’t speak English as our first language, and the officers did NOT try to explain the situation properly and clearly. Instead they hit us with this POOR attitude and ANNOYING faces, which DID NOT make the situation any better. I flew business class with them, the space was disgustingly tiny. Was not expecting that, it was literally the same as what an economy passenger would get. Food wasn’t complete, even though my seat was at the front (row 6) we couldn’t get the meal we expected. Instead, we got served this poached egg with tomato purée that was poorly arranged, smelled bad, tomato purée splattered everywhere on my serving tray and plate. To put it simply, it looked like a dog puked all over it. All in all, WORST travel experience ever. UNDOUBTEDLY will be the LAST time I’ll ever step foot in British Airway’s plane. FIRST AND LAST TIME."
  },
  {
    "reviewDescription": "I have been a loyal customer for over a decade. Recently BA has failed to recognise the avios from a long haul, and after wasting numerous hours talking to call centre and online chat and submitting formal complaints, they still haven’t resolved what was supposed to be a simple issue. I have the ticket number, reference number and everything.\n\nBA deciding not to award me the avios that are rightfully mine is an act of dishonesty. It’s failure to comply with the terms and conditions and causes damages that are ultimately financial given points have an intrinsic value. It’s also a demonstration or the failures of this company’s management and operations.\n\nI have instructed my personnel to book through alternative airlines going forward. Once I use up the avios I collected I’ll stay away from BA in every opportunity. Congratulations for managing to lose the easiest client you had to keep."
  },
  {
    "reviewDescription": "Horrible! Horrible ! Horrible ! I booked my holidays in December , BA cancelled the flight 3 weeks before travel date and I’m still chasing for refund ! It’s been 19 months and their incompetent customer service and refund teams still can’t return my back my money ! Avoid at all cost ! They have asked me for bank details 4 times and each time I send them information they are replying with ridiculous excuse , considering strange that they cannot refund on original payment method card."
  },
  {
    "reviewDescription": "Wouldn't even give this a 1*.. called to change my flights for the end of MAY which for some strange reason I wasn't allowed to do online. First agent was happy to charge me £50 admin fee, which I bit my tongue as I should be able to do this online, was happy to proceed.. however I wanted a credit for the difference in flight price. He then decided to put the phone down on me whilst questioning this. Called back, another 35 min to get through to a RUDE agent who changed my flights, however decided to add on another £30 \"service charge\" for his disgusting customer service, and explained that the agent can decide on when, depending on time and day, who they are, if they want to or don't want to & how much service charge they wish to add on.. this is absolutely disgusting. I have complained which I'm yet to receive a response. I want the admin fee back and my credit for the change in flight price."
  },
  {
    "reviewDescription": "Would give zero stars if we could.\nBooked but wrong dates. Called to change. No cannot change date, cannot cancel, only rebook at four times original price. Tried to cancel many times. Filled in forms. Just wrote back. Wrong form. Instead of forwarding to right dept. Tried over many days to cancel via web site. Always reported technical error. And directed to forms. Complete circle. Atrocious service, zero sensibility to customer needs. Avoid BA at all costs"
  },
  {
    "reviewDescription": "Booked first class flights. Called to ask some basic questions about the services available and after 20 mins of the agent waffling asked to speak to a supervisor. Kept me on hold and then told there are no supervisors free. I gritted my teeth and tried to go through it again. 40 mins later after repeating my question multiple times and explaining multiple ways the guy tells me that he can't find the info on the website. no s##t sherlock -- that's why i called. I can read the website myself. Waste of bloody time. If this is the customer service with first class tickets then there is something seriously messed up about this company."
  },
  {
    "reviewDescription": "Searched for a flight London - Tampa and got a quote of £2882 so I went ahead to book, however, website crashed and requested me to search again BUT the price had gone up to £3590!.. My family has used BA for over a decade and this is very disappointing.\nWill look for alternatives."
  },
  {
    "reviewDescription": "Worst cabin crew ever. I have travelled to over 50 countries and have never witnessed such terrible, rude and unkind cabin crew. We flew business class with a baby and was shocked at how bad the service was. BA should take lessons from singapore airlines and Qatar. Glad I am a frequent flyer with Singapore and Qatar and not BA. Never flying British airways again"
  },
  {
    "reviewDescription": "Appalling airline. Booked via their own site a business trip to Lyon from Heathrow at the end of October. Within two days they cancelled the outgoing flight to one far later that day meaning that it was no good for the planned meeting. Why advertise a flight, let people book it and then cancel the flight?"
  },
  {
    "reviewDescription": "The customer service representative was very unprofessional. I asked her about the assistance of putting baggage in the overhead cabin and taking baggage off the belt conveyer after flight, because last flight was able to get assistance and I have a medical condition. Then, she said to hold on and when she came back on the phone she said \"I was right!\" (I do not care if you are right) and said they cannot do it because of the British Airways rules, and she was shouting on the phone. Ok, if that is that rule even though it does not help, but the problem lies in her attitude where she was very emotional and unprofessional especially as a customer service representative. I am now taking a flight that is not British Airways as I do not want to put my money into them and now have a bad impression of British Airways."
  },
  {
    "reviewDescription": "I flew return from Heathrow to Islamabad with British Airways. Overall I was happy with the experience. The only let downs were on the outbound flight the sound for the entertainment was not working (I couldnt move seats because the aircraft was full) and on the return flight one of the toilets stopped working/flushing."
  },
  {
    "reviewDescription": "BA lost my luggage 10 days ago from a Ibiza to London city flight. The online tracker has not been updated after I was informed by customer service that it had been found still in Ibiza, this was nearly a week ago now and everyone I have spoke to since still says it was missing. I can’t understand how this sort of thing happens when I checked my bag In at the same time as my partner. I have special items and medication In that luggage that I need asap. Items that are in the bag are irreplaceable and the fact no one can give me an update as to where my belongings are is disgusting. After reading the reviews I can see that lost luggage is a regular occurrence with BA and I can guarantee I will never been using their service again. I might have considered staying a customer if their communication and updates would have be sufficient but making me wait with no update for this amount of time is awful."
  },
  {
    "reviewDescription": "They keep getting worse and worse.\n\nWhere to begin ...\n\nUnhelpful and rude customer service?\nConsistent flight delays (5 hours in one of my flights quite recently)?\nLoss of luggage and no assistance in the aftermath?\nGhosting you after saying they will get back to you with compensation for a delayed flight?\nContinuing to ghost you after you reach out to follow up on their lack of action?\nStupidly extortionate up-marking of flight prices when you book it as an amendment instead of a new booking - just so they can pocket more money? (This happened to me just yesterday)\n\nThis has been my experience across multiple BA journeys over the past few months. On a level of principle, I'm never booking with BA again, even if other airlines are offering more expensive rates."
  },
  {
    "reviewDescription": "Terrible app and hard to use generally. Better than some though."
  },
  {
    "reviewDescription": "Booked a business class flight to Europe, both legs cancelled resulting in missed meetings at both ends of the trip (that could not be rebooked at short notice, outbound flight cancelled with 6 hours notice) and hence business opportunity loss. Outbound cancellation resulting in being downgraded to economy on rebooked flight with no mention of compensation. More the wording suggesting I am accepting economy for business class cost.\n\nThe fast track at Heathrow terminal 5 is never faster than the normal security gates (the security staff also happily admit this), I would even say now that bag drop is quicker at the other gates than the club world so best avoid this too.\n\nEven with Silver status, the phone lines just say phone back later and I am still waiting to hear back through twitter. Considering when I last contacted them through their twitter channel to give them positive feedback it took them 2 days to respond. I am not holding out much hope of a response. The reason I have time to write this feedback, my flight is once again delayed. Making it, I want to say 5 delayed flights in a row, but let's be generous 5 in the last 7. Not reliable enough for business flights."
  },
  {
    "reviewDescription": "I can't say how bad the process within customer service is in BA. They have over charged me because of a change and blamed me for using the online web tool instead of calling them. And now because I seen the charges on my credit statement it's too late to give me a refund. Honestly BA is becoming the worst airline to fly with, no common sense approach being used to enhance the experience, none what so ever."
  },
  {
    "reviewDescription": "wow here i am again with yet more great experiences from BA.\nMy father in law died whilst myself and my husband were on a trip to Montreal. We had to rush back, so changed our flights to 48hrs earlier than the original tickets. We had a fair bit of being sent backwards and forwards between them and expedia, but eventually paid 2.5k to change our flights.\nWe saw that we then couldnt check in, which was worrisome. So we decided to go to the airport early-the queues were massive. We eventually got greeted by someone who couldnt find our reservation, and coldly told us we have to pay again. When we explained the urgency of the situation, we then learnt that BA could actually see the pending payment from expedia. When challenged on why we had to pay again if this is just a partnership issue between BA and expedia, they acted disgracefully and almost callously. Gone are the days where theyd be compassionate… either cough up for a problem that isnt ours, or go back to montreal. They couldnt care less.\nunder duress, we ended up paying twice just to get back home. And now, on top of all the funeral and death stuff, we have to act as accounts people to get our money back.\n\nto add insult to injury, we then were sat next to an off duty BA employee who was bragging about the flight being free and getting business class perks in premium economy. Glad BA treats employees well, wish you treated paying customers even 25% like that so we can at least get a dignified service.\n\ni hope BA, and the IAG, collapse."
  },
  {
    "reviewDescription": "My son who has a learning disability was travelling from MCO to London on 29th January. He is 50 years old but is more like a 12years old child. I paid for him to be upgraded to World Traveller Plus. When he boarded the plane his assigned seat was broken and he was asked to leave the plane while they tried to repair the seat.\nAfter everyone was boarded on the plane they allowed him to board again and told him as they could not fix his seat he had to sit in economy.  He was put him at the very back of the plane and are refusing to give his money back. BA are taking advantage of his disability as he cannot prove they moved him. Disgraceful treatment of a vulnerable person."
  },
  {
    "reviewDescription": "Atrocious company. Flight overbooked twice, we rebooked ourselves and were never refunded for the flight we did not take. Luggage was delayed 4 hours with no compensation. Will never fly BA ever again."
  },
  {
    "reviewDescription": "I have never experienced anything worse when it comes to airlines unfortunately. I was going to fly to Frankfurt from Glasgow over London but the flight from London to Frankfurt was cancelled. This meant I had to stay overnight in London where I have no accommodation etc. As I was rebooked to a flight from London City airport which was more than 2h by train I had to get an uber and then take a hotel for £250 in total (London prices). I was reassured over the phone that I would get all the money back and that the phone call is recorded. My flight from London city airport was then cancelled again and rebooked to London Heathrow but two days later. I then cancelled that flight and rebooked a new one with Lufthansa as I urgently had to get to work and needed the money.\nI never received the money back for the hotel, compensation for cancelled flight 1, compensation for cancelled flight 2, the extra food I had to pay for, the uber, or just the actual cost of the flight.\nI was first transferred 3€ (!!) by British Airways and told that they can't listen to the recording. They stopped replying to me and told me the issue was \"weather conditions\" although all other non-BA flights were going... I lost over £700 in total and never got compensated for the loss of a work day either. It just really feels like they don't care about people.\nWorst service/airline ever."
  },
  {
    "reviewDescription": "Worse assistance to my 75 years old mother. My mother has back problems and needs a seat with space to get up and sit down. Even though we purchased a seat with more legroom, these ladies were not able to book into the assigned seats. At the end they said: “you have to decide if you are going to travel in this seat that we put you in or not, we will not do anything for you”. We'll see how she gets to her final destination. Very disrespectfully"
  },
  {
    "reviewDescription": "Ridiculous service on board ...asked for blanket ...they said they all put ...asked for WiFi information...they said not available....then served food to only 2 out of 3 of us .... Complete farce of a service then the cherry on the top ...they held back one of my luggages!!! Nightmare of company"
  },
  {
    "reviewDescription": "Aside from the constant last minute flight cancellations, the reason I now go out of my way to avoid flying with BA is the officious, arrogant, cheap, unpleasant attitude some of their staff display. Things go wrong, it happens, but when you come away feeling not just let down but insulted, you have to ask the question… why would I carry on giving you my money? Well I for one no longer do, and my recommendation to others is to pay more if necessary to fly with other carriers. The BA brand used to promise a certain level of experience, but their cost-cutting exercises over the years have left the short-haul services far too similar to the low-cost airlines with their very many additional add-on costs and paper-thin service. I can get that experience with easyJet or Ryan Air, so why would I fly BA!? Madness. Their whole operation just leaves you feeling cheap, and that’s assuming you’re lucky enough to actually reach your destination with all their IT problems, staffing issues, and cancellations. I’ve flown with BA a lot over the decades, but no more. Do yourself a favour and fly with someone else, a carrier that actually make you feel like a valued customer, because these guys don’t."
  },
  {
    "reviewDescription": "Beyond disappointed. Received an email saying my flight was cancelled at 5h from departure. Called customer service twice and they confirmed, cancelled my ticket for a refund as no other flights were available. Then I received an email saying it was a mistake. They left me with no ticket, no refund, and a lot of frustration knowing that the flight operate as normal in the end"
  },
  {
    "reviewDescription": "booked flight to india canceled in erroor phoned ba within seconds flight could not be reinstated lost 2000 pounds told i could re book origional seat at a cost of 7000 pounds appaling service robbers"
  },
  {
    "reviewDescription": "Worst flight ever in 25 years of travel no refreshments except crisps and 250ml of water thrown at you like feeding time the zoo informed can pre order. Food not mentioned on email when confirming booking staff only. Bothered if they find out you have a gold BA card then its ill get you a glass of champers sir every one else ignored flight late poor information rubbish thought BA was better than this sums up Britain won’t fly with them ever again"
  },
  {
    "reviewDescription": "No (forgotten to load) baby basket for a 12 hours flight.\n\nOh, how delightful! A baby basket? Who needs that for a thrilling 12-hour flight? What’s a little 12 kg of squirming joy to hold for an eternity, right? And who doesn’t love the fun of no toilet breaks for 12 whole hours? The added excitement of a baby wailing the entire flight just adds to the charm! Isn’t it lovely to be both the passenger and the entertainment?\n\nI’m just tickled pink that after three heartfelt pleas to Customer Service, I’m graced with the offer of a measly £150 voucher. Wow, what an incredible deal to experience BA’s exceptional service all over again! What a thrill it will be to subject myself to the same joys of flying in the future!\n\nAnd honestly, I can’t tell if I’m conversing with a human or a particularly repetitive bot—either way, the entertainment value is off the charts!\n\nIsn’t it heartwarming how BA shows such love and care for babies, mothers, and rubs it in the faces of its loyal customers? I just can’t wait to write to the ombudsman and see if the UK truly has a consumer protection system.\n\nOh, what a memorable experience! BA, you really are knocking it out of the park with your stellar flying and customer service! Keep up the great work in demolishing your own reputation—it's truly a masterpiece in the making!\n"
  },
  {
    "reviewDescription": "Our cruise, Dubai to Barcelona was cancelled by the cruise line because of the dangers transiting the Suez Canal, understandable. So today (18/01/2024), we had to cancel our BA flights in April 2024 from Barcelona back to the UK. Paid €473:96 for the flights. Called BA and they informed me they were nonrefundable flights, but I could get a refund for the tax paid. Tax paid: €62:96, less the cancellation fee of €60:00 !!!\nWhat a company, you have another 3 months to sell these seats again, which you probably will. Can’t wait until the day you cease trading."
  },
  {
    "reviewDescription": "They’re call centres are always busy and when you do get through the line cuts off soon after they take my booking reference. This has happened to me several times."
  },
  {
    "reviewDescription": "Disappointed with Discomfort: A Review of British Airways Shorthaul Business Class and VIP Lounge\n\nMy recent British Airways experience left me feeling more like a harried babysitter than a relaxed business traveler. Let's break it down:\n\nShorthaul Business Class: Cramped and Underwhelming\n\nBA's shorthaul business class is a masterclass in disappointment. Sure, the blocked middle seat offers a theoretical increase in space, but in reality, the seat pitch feels identical to economy. Forget about stretching out or even getting comfortable enough for a decent nap. It felt more like a high-priced game of airplane kneesies.\n\nFood and Drinks? Meh. The complimentary food was, well, complimentary. Edible, but nothing to write home about. The free drinks were a minor perk, but again, not exactly a deal-breaker on a short flight.\n\nPriority Boarding: A Glimmer in the Gloom? The only saving grace was priority boarding, which saved a few minutes of queueing hell. However, this meager advantage couldn't erase the overall feeling of being trapped in a glorified economy class with a slightly shinier seat.\n\nPrice vs. Experience: A Mismatch\nThe price premium for shorthaul business class felt like a cruel joke. For that price, I expected significantly more. This felt more like a budget airline experience with a business class label slapped on.\n\nBA VIP Lounge: A Lawless Crèche Disguised as Relaxation\n\nNow, let's talk about the BA VIP lounge. It was supposed to be a sanctuary from the pre-flight chaos. Instead, it resembled a lawless crèche gone wild. Screaming children ran amok while their parents, seemingly oblivious (or intoxicated by the \"free\" everything), sat back and reveled in the complimentary food and drinks. There was no escaping the cacophony, making relaxation an impossible dream.\n\nOverall: Avoid BA shorthaul business class and the VIP lounge if even a hint of legroom or peace is important to you. You're better off saving your money and flying economy, or consider a different airline that offers a genuine business class experience with comfortable seating and adult-oriented relaxation areas.\n\n"
  },
  {
    "reviewDescription": "Awful. I had a flight that was cancelled back in March. I put in a complaint claim as they only flights that were offered to bring me home landed at a different airport. This meant i had to make my own way from one to the other and occured over a 100gbp taxi fair and trains and tubes with all the changes with luggage is unrealistic.\nI filed my complaint, its been a month and a half and i've heard nothing. All i keep getting is generic 'were sorry your still waiting' replies.\nWhy am i left our of pocket when its the airline that is at fault. I cant have been the only one moved airports the airline should of provided ground transport."
  },
  {
    "reviewDescription": "Sadly, I have to add my little voice to the chorus of upset customers.\n\nThe customer service say they will 'send this to the back office' where they will 'get back to you in 48 hours'.\n\nUnfortunately at this point it all seems like a huge scam.\n\nSpent hours on the phone, chasing them up, being told all kinds of incorrect and contradictory things.\n\nUltimately though, they made these mistakes not us and yet correcting it is nigh on impossible."
  }
]