[
  {
    "reviewDescription": "First time flying with BA in October and November and it was a very nice experience. All crew was welcoming and friendly even the people working in the airports for check in etc. The planes were not bad for economy, all planes aside from one were airbuses and the other was a Boeing. I would definitely travel with British Airways again"
  },
  {
    "reviewDescription": "What is the point of a telephone number if you are never going to answer it?\nI have been trying for many many days now to contact Britisih Airways about an upcoming flight to advise them of a medical condition of one of my party. There is no option to add this information at online booking or in API - unless you are disabled and/or need help with mobility. My daughter has a severe nut allergy. I simply wanted to add this into the API for the booking (as instructed by BA Exec Club!) I managed to get an email response from the Exec Club who gave me all of the information already on the website which is helpful but said they had no access to the booking system and to contact via telephone. You call the number, press what you hope are the correct choices to try and get through to someone and after a minute or so hear a recorded message saying they are VERY busy taking calls and they won't be able to deal with your call today, really sorry try again later and then the call is cut off. No option to wait your turn. May be they are all on holiday...."
  },
  {
    "reviewDescription": "Terrible customers service, I have been trying to get a refund for over a year. They have unmonitored inbox, I have called several time and essentially they don't seem to be willing to refund despite sending automated emails asking me to apply for refund."
  },
  {
    "reviewDescription": "In march (for August 15) this year we booked an Iberia express flight through BA to go to Madrid. The three tickets costing £76 each were all charged to my credit card. In August I went to add API through the BA portal I booked it with it kept throwing up an unknown error. Several phone calls later to BA I was told it would be ok and to go to the airport when handed in our stuff itineraries and passport we were told we could not fly no e-ticket. The problem was that my husband and my son have the same first name and last name and this must’ve corrupted the ticket (but it still took the initial payment). I had to purchase three more tickets at £240 each at the airport (in 2 lots so the same problem didn’t happen) again. I can also mention we have travelled with BA, EasyJet and TUI and this has never caused a problem. I kept saying that there was a problem with this (initial phone call 5th August) but felt I was being fobbed off (system always seemed to be down) and left to deal with it, have you ever tried rebooking a ticket at the airport, it’s not fun."
  },
  {
    "reviewDescription": "They cancelled my flight and are refusing to rebook me more than three days earlier. So I cannot travel at all because they do not have another direct flight to rebook me onto"
  },
  {
    "reviewDescription": "British Airways customer service seems to be non existent, after a fault at Heathrow Terminal 5 it caused us to miss our flight. We were passed from one member of staff to the next each of which has a terrible attitude and passed us on stating it was not their problem. Eventually we had one excellent member of staff look after us and rebooked us onto flights for the next day. They admitted their errors on the day and did not charge us for the flights the next day but we still had to pay for transport from Heathrow to Gatwick and pay for a hotel for the night all whilst missing the 1st day of our holiday. On our return before all of the worldwide Microsoft issues our flight was cancelled at late notice and we were put on a flight over 7 hours later. This caused my wife to lose a day of trading with her business. British Airways have sent a very poor apology email offering £100 e-voucher. We are approx £800 out of pocket and now they will not even respond to emails. I have two future bookings already with British Airways which is disappointing as I would like to never travel with them again after being treated so badly on this occasion. They have gone seriously downhill and it is a disgrace. I would advise anyone not to book with them again."
  },
  {
    "reviewDescription": "They have stolen our money.. we paid for exit aisle seats.. they sold them to someone else and as of yet haven't got our money back. It was 4 months ago.. we have been told we have to wait.. its only £210 but they are thieves.."
  },
  {
    "reviewDescription": "BA keep cancelling flights on the day that you are travelling.Miraclusously, the can accommate everyone on the next flight.When we complain they say that the cancellation is due to weather etc so how is it possible to be able to seat all the cancelled flight on the next one unless the first one was less than half empty which would explain the cancellation.What happened to honesty"
  },
  {
    "reviewDescription": "I am writing to address my mother’s recent travel experience with British Airways, which has caused us significant distress. I booked a return ticket for her from Nigeria to the UK on April 9, 2024, with a scheduled return on September 30, 2024. Her journey to the UK went smoothly.\n\nHowever, on September 29, 2024, at 17:08, I received an email from British Airways informing me that her flight for the following day had been cancelled due to Air Traffic Control restrictions related to adverse weather in London. Shortly after, at 17:22, I received another email confirming that her flight had been rescheduled with Lufthansa for October 1.\n\nAt the airport, my mother was denied boarding by Lufthansa because she did not have a transit visa. After receiving the rescheduling email, I researched the visa requirements and found that if one remains in the international airport area during a stopover and the destination is not in a Schengen country, a transit visa is not needed. Despite this, the Lufthansa representative refused to let her board, stating, “I’m sorry, she can’t join the flight; go back to BA.”\n\nI immediately contacted BA via email but only received an auto-response directing me to customer service, which I was unable to reach despite numerous attempts. When I went to the BA desk at the airport, I was told that such complaints could not be addressed there and that customer service would not be available until 9 AM the next day.\n\nConsequently, we had to forfeit the flight and return home. To ensure a smooth departure for my mother, my wife and I canceled our work commitments for September 30 and later for October 1, which ultimately proved futile.\n\nUpon returning home, I managed to contact BA’s customer service team and recounted our ordeal. I was arrogantly told that there was nothing BA could do to assist us, as we should not have accepted the rescheduled flight, which they claimed made it our loss. This was particularly troubling since my mother was on a prescribed medication regimen from Nigeria that lasted until September 30. Staying until October 1 without her medication, coupled with her scheduled doctor’s appointment on October 1, posed significant health risks.\n\nFortunately, I had purchased the ticket through an agent, who intervened and successfully arranged another flight for her on October 4, 2024. It raises questions that if the agent could resolve this issue with a few hours of intervention, why was I told it was impossible? Without their involvement, would the money spent on the original flight have gone to waste?\n\nAlthough she was eventually able to travel, there was an almost hour-long delay due to issues locating her reservation.\n\nThis experience has caused my family considerable distress. My mother was hospitalized for three days upon her return to Nigeria, and my wife and I missed three days of work (September 30, October 1, and October 4). Additionally, we incurred extra expenses for transportation to Manchester Airport, unplanned medical costs, and significant mental stress.\n\n\n\n"
  },
  {
    "reviewDescription": "My recent experience with British Airways was an absolute disaster. From start to finish, their incompetence, lack of professionalism, and complete disregard for their customers made for one of the most frustrating travel experiences I have ever endured.\n\nIt began at London City Airport, where I was pressured into checking in my carry-on bag despite my reluctance. I was assured that “everything would be handled.” Instead, this decision turned my holiday into a nightmare. Upon arriving at Palma de Mallorca airport, my bag was nowhere to be found. To make matters worse, there was no British Airways representative at the airport to assist. I was handed a phone number for a call centre, which only added to the frustration.\n\nThe call centre staff informed me that I would receive an update within 48 hours - an absurd timeframe considering my holiday was only three days long. I was left without clothes or essential toiletries, which completely ruined the trip. Although I was told I could claim reimbursement for these expenses, the stress and inconvenience were unbearable.\n\nTo make matters worse, I have been forced to coordinate between British Airways, another airline, PMI Airport, and London City Airport to try to locate my bag, as nobody seems to know where it is. British Airways eventually claimed the bag never left London City due to an apparent tagging error. However, they have since admitted that they cannot locate the bag and it is officially lost. Despite this, they continue to say they cannot declare it lost until 21 days have passed—an utterly ridiculous policy when it is clear they have no idea where the bag is.\n\nI have incurred international call charges trying to resolve the issue, wasting hours of my holiday speaking to different representatives who all gave conflicting information. The lack of coordination and accountability is appalling.\n\nThe call centre staff were unhelpful, unable to escalate my concerns or connect me with anyone who could provide meaningful assistance. Representatives hung up on me or promised to call back but never did. When I attempted to lodge a formal complaint, I was told the only way to do so was via an online form. After submitting my claim, I received no response or explanation, and it was not until I called that the call centre rep and I both learned at the same time that my claim had been closed without any reasoning.\n\nThis ordeal consumed my entire holiday, leaving me stressed, frustrated, and stranded without basic necessities. British Airways’ inability to perform such a fundamental task as baggage handling, compounded by their refusal to take responsibility or provide any meaningful support, is utterly disgraceful.\n\nI would strongly advise anyone considering flying with British Airways to think twice. Their disorganisation, lack of accountability, and complete disregard for customer care make them an appalling choice for travel. After this experience, I have no intention of ever flying with British Airways again."
  },
  {
    "reviewDescription": "rubbish never answer the phone and emails worst airline"
  },
  {
    "reviewDescription": "We had planned to go to New York for my husbands birthday in December. The flight was cancelled one hour before we were due to leave to go to the airport with the only alternative from another airport and no option to transfer us. We asked for a refund and booked with Virgin instead who were amazing and said this is a regular occurance with BA and they see this most days.\n\nRefund took months and even now 5 months later I am having to chase our £260 compensation amount. They are also refusing to refund our parking and lounge booking which was £188 and offering £19 towards this. You cannot speak to anyone just send emails which they take months to answer.\n\nAbsolutely shocked and disgusted that they are allowed to be the flag carrier. We will NEVER use them again."
  },
  {
    "reviewDescription": "If it was possible to rate below 1 star I would. Cancelled flights, bag delays, poor service. We have waited 3 days to get our bags back. I would highly recommend booking with any other airline even if more expensive. BA the worst airline to exist. The Airbus is awful too.\nAbsolutely disgusting service!"
  },
  {
    "reviewDescription": "One of the best airlines to fly with. Customer service are great, and actually help!"
  },
  {
    "reviewDescription": "BA excels again by bumping me off my London -Manchester flight before I arrive at Heathrow from Dallas because they think I’ll miss the connection. I make it with time to spare (not even started boarding) but they won’t unbump me so I have to watch everyone get on “my” plane while I wait for the next one. Customer services ? They don’t know the meaning."
  },
  {
    "reviewDescription": "Absolutely disgusted about the way we were treated by the cabin crew from Dalaman to London Gatwick. We were rudely greeted by the cabin crew staff & was aggressively forced to put our cabin hand luggage under our seats. I went to put my large rucksack into the overhead locker as there was plenty of space however the only male cabin crew attended on the flight pulled my bag from my hands aggressively and proceeded to shout at me infront of the other passengers with an abundance of attitude for no reason. He proceeded to use the words of \"You get what you pay for\" implying that as we have paid for Economy it is acceptable to talk to us & treat us like dirt. Other people around me even said to me how disgusting his attitude was & it was completely unacceptable. He proceeded to complain about the amount of hours he was working and threatened to get myself and my brother removed from the flight for absolutely no reason which was purely a power play from his side as we couldn't say anything to that as we wanted to get home.\n\nAt the end of the flight I asked the only male cabin crew for his name to which he refused and said he did not care if we complained about him. We also asked the main in flight attendant for assistance in dealing with this matter who responded she couldn't get involved.\n\nWe booked to fly with British Airways however both flights were chartered by Avion Express. The leg room, standard of the flight & cabin crew were drastically poor. The toilets were kept locked as the seat belt sign was switched on for 90% of the flight and the cabin crew was refusing passengers to use the toilet even at their own risk and was getting very aggressive. Furthermore, only 2 announcements were made throughout the whole flight both on take off & landing which were mumbled and not understandable.\n\nOur experience was completely unacceptable from start to finish and I expect there to be actions taken against the male flight attended for the inconvenience and abuse we have received during this journey as well as being conned by British Airways for being told Avion Express has the same standard as BA which was incorrect information\n\nDisgusted!"
  },
  {
    "reviewDescription": "I am sick of BA. Every BA flight I have had to deal with lately is either delayed, can’t get a gate when it does arrive or the bags seem to disappear. I am waiting for customers that arrived at 6:10am it is now 8am and I am still waiting. My customers have been at baggage claim since 7am. It has come to a point where I am not going to service BA flights. I had to get out of bed at 4am for this. I am a taxi driver and I have now had to pass on my morning bookings again. BA is always the weak link in my chain.\n\nStill waiting for 4 out of 6 bags."
  },
  {
    "reviewDescription": "Review Update 29 February 2024 :\n\nOur issue continued for some time until we were fortunate enough to receive a telephone call recently from a lady in British Airways customer services.\n\nShe displayed all the qualities that you would expect from the UK’s flagship airline, empathy, sympathy, concern and most of all common sense, in fact she was a very pleasant person to deal with and talk to.\n\nWe are pleased to say our issue has now been fully resolved and we would like to thank British Airways for their time and efforts in helping us.\n\nOriginal Review:\n\nBritish Airways was once considered by many, to be the UK Flagship Airline, however our recent experience with the company leaves us with the impression that it’s now more like a third-rate Budget Airline.\n\nSome might consider one reason for its apparent demise being down to outsourcing customer services to different continents, with different time zones etc. All made possible by the internet and IT VoIP systems, possibly in a bid to bring that seemingly “seamless customer experience”, but it’s far from that.\n\nWe have travelled with BA on several occasions and in general it was a good experience, but we were likely to have been in the 90% section of satisfied customers. Its only when you find yourself in the 5 to 10% section of unsatisfied customers that you get to know how good the airline and its systems are.\n\nWe were due to travel to Aberdeen for a long overdue family reunion with people from as far away as South Africa being there. Unfortunately, late on the evening of the night before travel and after completing the online check-in, I experienced a problem with my back which left me debilitated. Anyone who has experienced a back issue will know just how sudden the onset can be, how debilitating and painful it is. As a result, I could not make the journey.\n\nBritish Airways customer services lines were closed that night, so at 7.30 am as the customer services offices opened, we called. We were dealt with by an extremely helpful and understanding gentleman and having explained my situation, we were informed we would receive vouchers for the flight, which had to be used by November 2024. We were removed from the flight, so we did not appear as “no shows” at the gate. I managed to get a doctor’s appointment later that same day and I also paid for a doctor’s letter to substantiate my medical issue. The letter was forwarded to BA customer services as instructed.\n\nA week or so later we were informed in an email from an operative from the British Airways Global Customer Engagement department, that the doctor’s letter did not meet with their criteria, and as such we would not receive any vouchers or reimbursement for the flight.\n\nWhilst the cost of the flights was not significant, we don’t think it unreasonable to have expected a more sympathetic and pragmatic approach from the airline.\n\nWe have continued to attempt to argue our case with the airline, but their lack of response and interest is “off the scale” and extremely disappointing.\n\nCurrently we would mark British Airways Customer Service a low 2/10 with a “See me after class” comment."
  },
  {
    "reviewDescription": "On the 16th I was downgraded from a business class seat, the check in team in Newark offered no information on compensation despite being asked. In Heathrow BA staff were only willing to direct me to their website and indeed when I called their customer care team the only option they offered was their website. After 5 weeks and 3 updates of my case by myself I have only had a single initial acknowledgement of my case from BA and nothing more. It is likely that arbitration will be required to obtain the legally required compensation specified by the CAA.\n\nThe message is clear - BA are horrible in terms of customer care and will do everything they can to avoid basic legal obligation - fly another way."
  },
  {
    "reviewDescription": "Dear British Airways Customer Service,\n\nI am writing to express my deep frustration and disappointment regarding the loss of my luggage on my flight from London Heathrow to Lagos Murtala Muhammed International Airport on 20th November 2024 (Flight BA75, Booking Reference: S8QWG4).\n\nThe delayed baggage reference number is LOSBA85104, and the baggage receipt number is BA045852. I am also a Blue Executive Club Member (Member Number: 06435771).\n\nThe mishandling of my luggage has irreparably ruined what should have been one of the most joyful days of my life—my wedding. My suitcase contained essential and irreplaceable items, including my wedding dress and reception dress. To experience my wedding without these critical items completely altered the day I had meticulously planned and invested significant finances in.\n\nLack of Receipts\n\nI must highlight that I do not have receipts for most of the items in my luggage. Like most people, I never imagined I would need to prove ownership of my wedding dress or gifts for bridesmaids and groomsmen—items chosen over months of preparation, personalized, and treasured. I simply did not anticipate that such an unprecedented mishandling of my property by British Airways could occur. I have provided clear descriptions and values for these items, which I trust will be honored under the circumstances.\n\nItemized Costs for the Lost Items:\n\nSuitcase: £500\nWedding Dress: $8,500\nReception Dress: $4,850\nBridesmaids’ Customised Gift Packs (15 packs, £250 each): £3,750\nGroomsmen’s Customised Gift Packs (15 packs, £200 each): £3,000\nBridesmaids’ Traditional Nigerian Fans (15 fans, £30 each): £450\nGroomsmen’s Traditional Nigerian Shoulder Bands (15 bands, £32 each): £480\nGroomsmen’s Tie, Pocket Square, and Cufflink Sets (15 sets, £17 each): £255\nThe total estimated value of the missing items is approximately £8,435 and $13,350.\n\nEmotional Damage\n\nBeyond the financial losses, I am requesting compensation for the emotional damage caused by this situation. My wedding was meant to be a perfect and memorable day, yet it was irrevocably marred by British Airways’ failure to deliver my luggage. The stress, disappointment, and heartbreak I experienced cannot be overstated. To be left without something as fundamental as my wedding dress on my wedding day is beyond distressing, and no compensation can truly undo the impact.\n\nImmediate Action Requested:\n\nFull compensation for the total value of the lost items (£8,435 and $13,350) as listed above.\nAdditional compensation for the emotional damage caused and the disruption of my wedding experience.\nA formal acknowledgment of the distress caused and a written explanation for the mishandling of my luggage.\nImmediate resolution of the challenges within your claims submission process.\nI must also note that I have faced significant difficulties with your claims system, which prevents me from adding multiple items. This has only prolonged my distress and further compounded the inconvenience caused.\n\nI trust British Airways will handle this matter seriously and provide a resolution promptly. Should I not receive a satisfactory response within a reasonable timeframe, I will have no choice but to escalate this issue through legal channels.\n\nI look forward to your swift response.\n\nYours sincerely,\nOluwatomisin Omotunde Ipaye (Tomi)\nContact Information: 07733531294\n\nFlight Details:\nFlight Number: BA75\nDate of Departure: 20th November 2024\nDelayed Bag Reference: LOSBA85104\nBaggage Receipt Number: BA045852\nBooking Reference: S8QWG4\nExecutive Club Member Number: 06435771\n"
  },
  {
    "reviewDescription": "Impossible to get through to customer service"
  },
  {
    "reviewDescription": "I paid to reserve specific seats in Business Class so as to have a chance of sleep on an overnight flight. BA later changed them to aisle seats without explanation. I wrote to complain but had no response for 5 weeks. When I pushed for progress my complaint was just moved around between departments. BA do whatever they want and make access to resolution as difficult as possible to avoid responsibility. Disgraceful!"
  },
  {
    "reviewDescription": "Shocking service.\n\nHad a query/ issue that I needed help with, I called the customer service/ help desk and was left on hold for almost 3 hours. Oh and they hung up 3 times.\n\nAbsolute joke."
  },
  {
    "reviewDescription": "Your booked and confirmed seat.. disappears without notice when BA wants to extend business class seating because some passengers go for an after-booking upgrade. So, BA promise and confirmation cost nothing, zilch, when 100-200 quid is involved. Very British, eh? Need to report to Trade Standards."
  },
  {
    "reviewDescription": "1.3 is poor by any measure. I've not been spoken to before like I was today by a stewardess at the back of BA 2643 from Málaga. We were instructed, not asked, to place bags that we'd flown over with under the seats, not in the overhead lockers. Then watched while she ignored other passengers placing similar bags in the lockers without intervening. She said \"I'll just let them all do it and they can have a 2 hour delay. See how they like that\". How grossly unprofessional. BA used to be a quality operator. Now they are just an expensive bucket shop operator with rude staff. That's on top of the hour delay. Never again."
  },
  {
    "reviewDescription": "Thankyou to the incredibly helpful staff (on the ground and in the sky). I flew with my powered wheelchair and needed lots of assistance to get on the plane. Everyone has been so lovely🙏🏼💗a special thanks to Gérard at London Heathrow, who is from wheelchair assist... You are a star! Thankyou for the free champagne too😘A suggestion for BA management.. If you want to support a charity organisation make it the Motor Neurone Disease Association 🙏🏼💗♿"
  },
  {
    "reviewDescription": "Made to check in my cabin bag as was a full flight ridiculous they should have enough room or not allow you to travel with a cabin bag. LCY to AMS 11/7/24. Now I fave further delays and damage to my cabin bag which has no lock. Second issue in a row with BA. They only care about club world travellers. If you want to fly economy just go easyjet at least you don’t pay a premium for their service."
  },
  {
    "reviewDescription": "Wow. where do I start!! Booked flights over 5 weeks ago paid for seats in\nPremium Economy both ways. I received an email Sunday night to say my flight had been cancelled and offered an alternative (a day earlier) as we are on holiday we could\naccommodate the new flight. Fast forward to Monday we receive another email to say our return flight has also been cancelled, no alternative offered, we had to choose another flight. I called BA & spoke to an advisor enquiring if I change flights will I get the same choice of seat I paid for. If not could I have a refund & was told yes!! I was told I had to select a flight then I could choose\nmy seats. I did this later & was asked for payment to select the seats and as I'd already paid I wasn't paying again. The situation now is that after 4 calls BA, 1 person guaranteed I could have a refund 2nd person told me to re book the flights myself! 3rd person selected seats for us & said we had to wait 72 hours for them to be processed but guaranteed more than once the seats were definitely ours! 4th person said no sorry you haven't got any seats but I\ncan book you 2 but not together. Asked for refund but couldn't have one as I'd\naccepted new flights!!! So we have no seats on our return journey but can have a voucher as if I'd fly with them again. Oh, we did get a refund for the return seats that were booked. I asked what happens if there are no seats available in Premium Economy on our return flight and I was told it's up to the staff at the airport to sort that out! Nice!"
  },
  {
    "reviewDescription": "The worst airline ever! Cancelled my son's once in a lifetime trip to Japan! Won't EVER be using BA again - and I never forget!"
  },
  {
    "reviewDescription": "I paid the usual amount for the London-Istanbul flight. There was neither an entertainment screen nor food on the plane. seat distances were narrow. I will never understand why I had such an experience. It was the worst plane I've ever been on in my life. I'm really shoked. I will never use British Airways again. There are many alternatives where you can get first class service for the same money."
  },
  {
    "reviewDescription": "Compagnia dove ho accumulato più ritardi che in altre low cost. Anche oggi almeno 1 di ritardo sul volo senza nemmeno una comunicazione efficace. 1 stella anche troppo generoso"
  },
  {
    "reviewDescription": "Dreadful experience flying home to London from Barcelona. When I arrived to check a bag two hours before there was no one on the desk, I had to wait for 20 mins for someone to show. Our flight was delayed, we were called to the gate an hour before they started boarding us and then the confusion of who was being boarded and when was utter chaos. The ground staff were also crazy rude about it. British airways has really gone downhill it’s honestly as bad as Ryanair. Not good at all."
  },
  {
    "reviewDescription": "A couple of months ago our return flight from Vienna to London in the morning was cancelled and the replacement was scheduled for the next day in the evening! We had to get back that day so I bought return tickets with another courier. Now BA won't give me the money back. It seems we didn't have any choice but to pay for another night and wait 32 hours before we could home. Completely unreasonable!"
  },
  {
    "reviewDescription": "Just arrived back from Marco Polo airport , Venice and the ground staff were awful. We traveled business and I don’t think we should be treated differently but maybe eye contact and a smile, instead of rude. I found a bag , unattended in the boarding section, I tried to tell the stewardess twice and she flicked her wrist to wave me away and answered the phone. Then spoke to me in Italian which I don’t understand . Awful experience. The flight was good though , no problems"
  },
  {
    "reviewDescription": "My Honest Reviews are based on exactly what happened not how I felt or my opinion\nso you can fairly judge for yourself.\n\nFeel free to place in order which you think is fairly bad to worse.\n\nFlying from England to Brisbane AU (CHARGER INPUT DIDNT WORK)\n\nOnce landed in sydney for my connecting flight, I was informed i'm not on it and to find the british airways desk. (THEY DIRECTED ME TO A LOCTION WHAT WAS NOT IT THEN 2 OTHER STAFF DIRECTED ME TO 2 DIFFERENT LOCATIONS WHAT WAS NOT IT.)\nThe Help desk took me to the right location to then see its actually closed as a normal procedure every day and open in the next 5hours.\n\nThe help desk the walked me back to the flight I was meant to be on to Brisbane on all the way to the orginal terminal I was already at, to say I have to board it before it leaves as my ticket shows it has to be this flight. They did a longer search to find out i am meant to be on it but (BRITISH AIRWAYS DIDNT INFORM JETSTAR) so they let me on a later flight instead of my orignal one.\n\nI contacted british airways during my holiday in australia over email, to then recieve £50 voucher (WHAT WAS VALID FOR 1 DAY WHAT WAS NOT MY RETURN FLIGHT DAY)\nI emailed back asking why its not dated for my return as i'm not flying anywhere for this date you gave the voucher for...Up to today i'm still waiting for a email reply.\n\nPicture Proof attcahed of the email.\n\nDuring that covid December when all flights got canceled, I was creditded the value of the flight to be used up to September, It was done through a 3rd party company (THAT TOOK THEIR TIME TO GET A EVOUCHER FROM THE AIRLINE TO GIVE TO ME, BRITISH AWAYS DIDNT WANT TO ACT ON IT WHEN I CONTACTED THEM WITH THE RIGHT DETAILS, THEY WANTED TO HEAR IT FROM THE 3RD PARTY COMPANY FIRST)\n\nThen it was to late, (I LOST OUT ON £470).\n\n"
  },
  {
    "reviewDescription": "BA are the absolute pits!! Changed our flight times without notice but were advised via e-mail we could change to a more favourable time if required. I rang up and was told the change had been automatically accepted by us (not true!) and then told it would cost us more...unbelievable!! From the world's pre-eminent airline to the one I actively try and avoid at all costs. No attention to the customers. Our national carrier!! 🤣"
  },
  {
    "reviewDescription": "British Airways did not put any hold luggage on my plane and didn’t bother to tell anyone about it. My suitcase didn’t arrive until the 3rd night of my trip and I had no communication at all from them in this time. This ruined my holiday and they’re not even sorry about it. Never travelling with them again."
  },
  {
    "reviewDescription": "Me and my partner have booked a BA holiday to Vegas to ho and get married. The hotel (venitian) have assured us that our room does not come with a view, the BA booking confirmation specifically says room with a view and cost us extra.\n\nI've emailed BA in October, November and December and am still yet to receive an reply. The service are a joke, do not waste your time with them, for an extra £200/300 you could book with virgin which offer a miles better service."
  },
  {
    "reviewDescription": "I travel from Glasgow to London City Airport on a fairly regular basis. Post COVID it is very rare for my flight to leave when expected. Today I was due to fly on the 17.25pm GLW to LCY and at 3pm I received a text to advise my flight has been cancelled. No explanation just cancelled. On this occasion I have been offered an alternative later flight which will mean I am there today but will be unable to keep a commitment I made. I am due back on the 5pm from LCY tomorrow night and I have zero confidence BA will not cancel. At least 60% of the domestic flights I have taken from London in the last year have been cancelled at short notice. whilst LCY is the best airport BA are truly unreliable and don’t appear to care."
  },
  {
    "reviewDescription": "Lost my bag on 12th november in Mexico City, local handlers can only send to an airport and not a hotel. IT system didn’t work and local numbers not answered\nOnly got the bag due to the help of our hotel manager, their local contacts, mexico airways and my tour group\nUsed their system with claim 26003621 no reply emailed both CEO and Chief customer officer, no reply as yet.\nWill write formally at home, BA now my last choice of airline, do hope thay make an effort to return to 1st choice"
  },
  {
    "reviewDescription": "Where’s my luggage BA???\n\nFirst my flight was delayed 24hrs and then you decided not to send my luggage from U.K. to China, it’s been 4 days, still nothing and no news!!\n\nI’m stuck in China with no clothes and others stuff from my luggage including gifts for my daughter I haven’t seen in 5 years. Supposed to be going to Thailand on Monday and you’ve ruined everything!\n\nAbsolute joke!"
  },
  {
    "reviewDescription": "Booked out honeymoon through BA holidays after saving hard. We went to a 5 star in Turkey with private transfers.\n\n1 - BA at Gatwick were a nightmare. 2 hours to check luggage in, let along through security etc. A lot of people missed flights due to BA lack of staff and urgency.\n\n2 - Due to BA incompetence we lost out on the vip lounge, which we paid for.\n\n3 - No private transfer when we arrived at Turkey. Had to pay for a cab.\n\n4 - Had to phone BA due to no transfer etc. BA closed there complaints/help line!! After emailing them, they called back and the phone bill come in at £40 for there error!\n\n5 - After complaining to BA back in May 22, we are still yet to hear one response from them.\n\nSAVE YOUR MONEY AND BOOK WITH SOMEONE ELSE.\n\nShocking service."
  },
  {
    "reviewDescription": "I made a claim on 7th August for delayed flight- I then had an email saying I was entitled to £520 per person which may take up to 14 days. All other members of my party (30 people) had theirs within a few days. I waited and tried contacting BA, only to get a useless call centre in India who gave me a different time scale each time I rang. I emailed several times with no reply, and wrote a letter, also no reply. There is literally no way to speak to anyone who can actually explain why, 6 weeks later, I am still waiting . I tried X and Facebook, only to be contacted by scammers through FB🤬, which BA were not in the least bit concerned about. I have gone through Resolver, and today received what was laughingly called an update - but was actually a copy of the email I had when I first claimed, telling me it may take 14 days. This is totally unacceptable from a global company. This is money which I am legally entitled to."
  },
  {
    "reviewDescription": "Booked flight to Palermo in February 2024. Flight was for 31st May. I paid for exit row seats. In April 2024 I received an email saying our return flight had been changed to DAT. I was not too concerned as I had booked a realitively inexpensive club Europe flight for the return. I have yet to experience the joy of the return flight.\n\nIn May 2024 I checked the BA app and found that BA had removed my paid exit row seats in row 11 and asked me to choose another seat. The seat map did not show any exit row seats. Called BA. Helpful person told me that my seats were still confirmed in row 11 and that these were exit rows. He said I would get an email from BA within 24 hours confirming this. No email arrived and the app was still asking me to choose a seat. Called BA again. This time an extremely unhelpful person told me that \"due to operational constraints\" my seat had been removed. After much grief (and nearly an hour on the phone) he said there was nothing he could do. I complained (more of my time spent). Stock response email arrived saying nothing could be done. About a week later Joanne from customer service emailed me and offered to refund the seat booking charge. Thankfully someone there has a brain. Still quite annoyed but at least someone in BA realised how inept the previous employees had been. I decided to let it go, looked forward to my holiday.\n\nWe arrived in Palermo on 31st May. Whilst waiting in baggage reclaim we received an email saying that \"due to operational constraints\" some of the bags had not been loaded onto the plane. My husband's bag was one of those bags. Needless to say a very stressful 24 hours ensued before we got the bag back.\n\nWhat gets me is that the staff on the flight must have known about the failure to load the bags. Boarding was late and chaotic at Terminal 5. I suppose this contributed to the \"operational constraints\".\n\nSo much stress and grief could have been avoided if passengers had been notified before landing, instructions given and a member of BA staff placed in the baggage hall. We were left to our devices to take steps in the airport to complete customs forms etc.\n\nI await my return flight with trepidation. Next time Easy Jet."
  },
  {
    "reviewDescription": "Pathetic. Been trying to login to my ba account all day. Website too busy.\nWhat is the point in being a member if you can’t login.\nI’m cancelling my ba amex card after 23 years. Had enough. Can’t spend the campanion vouchers because I can’t get into my account."
  },
  {
    "reviewDescription": "Another fine mess BA - coming back from Geneva a whole pallet of ski bags and other bags did not make the flight. The Flight crew including Captain would have known bags were missing as aircraft centre of gravity would have been recalculated. No passenger was informed, no announcement made, and as a result we all hung around in baggage collection for nearly 2 hours waiting for bags that never even boarded. I can understand a missing bag but a missing Pallet of bags with no information to passengers - a complete shambles BA - yet another reason not to fly BRITSH AIRWAYS. BA 741 Geneva to LHR (NVKO9K). AS for flying Business Class forget it - last bags out on way out to Geneva which makes me think what does Priority handling actually mean. If this is the finest BA can offer it is utter garbage."
  },
  {
    "reviewDescription": "PNR UVQNF6\n\nWe have traveled a lot and mainly using BA on economy and business flights we have come to the conclusion that BA has lost so much ground and are now a lower end economy airline.\nFlights are often late and on 3 holidays this year flights have been late,sat on the tarmac or on one occasion bags were not delivered and then delivered to our home at great cost.\nThe last flight they offered a snack in economy which cost them at least 10p per customer. Each flight we were given a small bag of crisps and very small water on each flight.Please stop insulting peoples intelligence and go the whole hog and call yourselves a low cost airline!!!\nThe staff are not as good as they used to be and as other people have commented they are non existent after they have threw the crisps out and are not as professional as in the past.\nWe have 3 flights booked long haul with different airlines and would recommend other reviewers to try other carriers as you will be surprised by the quality of service.\nBye BA"
  },
  {
    "reviewDescription": "Having tried for over three months to link our hotel reservation made through BA Holidays to the “My Disney Experience “account, I decided to contact their customer service. The person assisting me without being blatantly rude, it was obvious, she couldn't care less and was a bit abrupt. Defying my expectations, she called back to provide an alternative booking number that did not work either. At that point, she kind of gave up, saying \"that's all I have\". When I pushed back, she promised to look into it and get back to me.\n\nFast forward few hours, I accepted she wouldn't call back and decided to contact Walt Disney Travel Company directly, more in hope than expectation, given that I did not book with them. A lovely and helpful customer representative listened to all the details but couldn't resolve the issue immediately given that she couldn't find the booking details provided by BA. She logged the issue and asked me to check the Disney website within 24 hours. When I checked, to my surprise, my booking finally appeared with a completely different number than then one I was provided with from BA.\n\nTo make a long story short, BA has a lot learn about customer service from companies such as Disney. Dealing with their moody, unhelpful and full of attitude customer service staff is a disappointing experience!\n"
  },
  {
    "reviewDescription": "Absolutely pathetic customer support. Between BA and Heathrow ruined holiday.\n\nWill never fly with BA or go through Heathrow again"
  },
  {
    "reviewDescription": "Customer service is appalling. I can't believe how bad it is. I've spent 6 hours on the phone in total just trying to add an infant to an existing booking."
  }
]