[
  {
    "reviewDescription": "Just appauled how as frequent flyers we were so badly treated on a recent flight from Florence to Heathrow where BA agreed to compensate us, when we were ‘ selected ‘ not to fly to keep the weight of the plane down due to strong winds. Dashing us off to Rome to catch a later plane , was the most dangerous driving ever witnessed, whereupon arrival in Rome with the gate closing, the Rome crew knew nothing of our dilemma & we nearly missed the flight, just no communication between Florence & Rome BA.Despite 3 weeks passing by , BA have not responded to x6 emails & despite them giving out forms all completed re the compensation offered, they are totally ignoring us.My years of loyalty to BA is waining thin.what does one have to do to have them respond?"
  },
  {
    "reviewDescription": "Not used BA in a really long time but my recent experience was good. Less than an hour's flights to and from Brussels, Iwas really thirsty and thinking of buying water on board but I was pleasantly surprised! Spring water and brownies offered. Not much but something. That's all I needed, water and it was nice to get it for free. Comfortable seats, flights departed on time, all good. After paying hundreds of pounds, it's good to see someone willing to give you something back no matter how simple."
  },
  {
    "reviewDescription": "I am still awaiting a refund or FTV ( whichever is easier for BA) worth over £1500. My complaint was submitted over 18 months ago and there is still no response other than is has been passed to the relevant team."
  },
  {
    "reviewDescription": "Not only did they cancel car hire package without giving me a reason, but still haven't provided a refund after countless chasing"
  },
  {
    "reviewDescription": "Had a flight and car booked on premuim to San Francisco and Boston. We had to change arrangement so my husband went to SF with a car and I had to change to see family in Boston a few weeks late. I was told by BA customer service it was best to cancel and rebook for the best fare since both my husband and I had already paid £150 change/cancelation and rebooked. The time on my new flight was wrong flight (economy out, premuim return) and I needed to depart earlier on the same day or even the day before. After 10 hours of calls over 3 weeks, they accepted to make the change with the Dr's letter but the fee went from £8.00 to 974. Customer service is not in the UK and have no authority. Very disappointed with BA over the last 3 years and will get the courage to move to another airline (24 year loyal customer)"
  },
  {
    "reviewDescription": "The worst airline, hotline, customer service and on-flight services. I am really disappointed after having done several long-haul and short flights with BA now. My last flight was BA933 from Cologne to London yesterday and I will never fly with them again.\n\nMy baggage was missing and after waiting for an hour at the baggage claim and went over to the customer service to submit my missing luggage claim. The lady didn`t do anything to help me, my questions regarding how long it will take, where to contact the customer service etc. was not answered. She just gave me an information sheet on \"What to do if a flight is canceled or delayed\", which was not even related to my issue. I have no claim number to check and after calling at BA baggage service at 03444930785 they told me that no new claim on my missing baggage has been made. I AM REALLY ANGRY! Not that they dont take this matter seriously, I waited half an hour in the general customer line to be told no one can help me there and then I was given a phone number to their baggage service. I hope my bag turns up, but this last desaster of many spilled the overfull glass."
  },
  {
    "reviewDescription": "My flight to Mumbai was delayed by 30 hours!\n\nVery few staff, conflicting information, flight times on day 1 changed 5 times, I spent 9 hours at the airport, then we were bussed to a hotel with no luggage. The next day we arrived at the airport, the time displayed was two hours earlier than we had been told, we then left another 3 hours after that.\n\nI spent two days at an airport and when we finally arrived at the destination 30 people did not have their luggage on the plane.\n\nNo apology, and no compensation because they said it was an ACT OF GOD! Worst experience with an airline ever.\n\nI will NEVER book BA again"
  },
  {
    "reviewDescription": "BA left me stranded (again) in Heathrow as the flight from Madrid was more than 3 hours late and I missed my flight to Cape town....your customer service is worse than your service quality"
  },
  {
    "reviewDescription": "Bought a flight for my girlfriend. All seemed OK. Had a small problem with check-in back to her destination and some mix ups for where to go by the staff at Terminal 5, however when we were finally in the right place to sort a check-in problem, the lady was extremely helpful."
  },
  {
    "reviewDescription": "We purchased 2 tickets using my and my partner’s avois points and a companion vouchers at the time when I was pregnant. The ticket is from LHR to HKG (confirmation no. WACULZ), was told I should add my baby only when he is born.\n\nNow that my baby is born, we needed to add the infant to the ticket. On 9th Dec 2023 @ 12:54 We called the BA team (option 1-1-3) to obtain ticket for my infant from LHR to HKG (confirmation no. WACULZ) We were advised the only way to add an infant would be to pay £114.81! I have made the enquiry at the time I purchased the ticket and the price was significantly lower. However, we were told that this is our only option. We made the purchase at the end (confirmation no. VS9LSO)\n\nOn 11th Dec 2023 @ 16:08 Not believe that is the correct way to purchase an infant ticket, I called again with to a different department (option 1-1-1) We finally found out that the ticket purchase on 9th Dec 2023 was incorrect, as it was a separate ticket. The team did not add my infant to our existing booking, but instead, made a new booking. As a result, my partner (Mr. David Michael Collier) has 2 tickets on that flight (one with confirmation no. WACULZ, one with confirmation no. VS9LSO) I then finally managed to purchase a seat for my infant in the same booking, the price was one tenth what was quoted to me just under an hour ago. I was told to call the Change Booking Department (option 1-1-2) to cancel the incorrect ticket. On 15th Dec 2023 @ 12:35 We called the Change Booking Department (option 1-1-2) to cancel the incorrect ticket. Was told that they cannot cancel my ticket.\n\nAs the result of BA’s inadequate training, this lost both me and my partner over 1 day of our time. We have been pushed around and were given wrong information multiple times. (with the exception of my call with Jorden on 11th Dec 2023 @ 16:08 who finally manage to fix my infant’s tickets)\n\nI tired filing complaints, and contacting BA Support but each department just point me to another department.\n\nI'm flying today and I have 2 tickets for my partner 2 tickets for my infant, which is clearly wrong! Please help me to make this right."
  },
  {
    "reviewDescription": "I informed via email this evening, that for the second time my flights to Marseille have been cancelled. I originally booked my flights in February, I paid a premium to book with BA as I believed that I would receive a premium product. The cost of two return flights with BA was £680, economy, but with extra leg room on both legs. I could have booked flights with Ryanair for £340. After already rescheduling once already due to a previous cancellation by BA (which cost me extra) I have been forced to cancel the flights entirely as BAs remaining options aren't even close to being workable for me. So I have had no choice but to book onto the Ryanair flight, however it now costs £1060. BAs incompetence has cost me over £720!"
  },
  {
    "reviewDescription": "DO NOT FLY BA unless you really have no choice. I thought I had booked a return trip from Heathrow to Valencia using Avios. All looked good until I arrived at check-in to find that I couldn't travel because no eTicket had been issued. I had to buy another return ticket for a later flight that day. In the process of trying to get refunded but the customer service has to be the worst I have ever seen. Desk employees are just rude and look as if they've seen so many problems they have given up. The online customer service app is flaky to say the least - took me 4 or 5 attempts to upload info and I'm very computer literate. From initial responses, it is clear that employees don't even read the notes that you upload. I shall be presevering through Ombudsman and small claims courts to to make sure I am properly compensated!"
  },
  {
    "reviewDescription": "Like another passenger who has written a review i had a flight booked on the 29th May 2023 from Kingston to London Gatwick and there was a break pad issue, we waited over 5 and half hours to board the plane the lack of information was disappointing and to be told after a delayed flight and 9 and half hour journey that your luggage is not on the plane is absolutely disgraceful!! I received my luggage yesterday The last three times I have used this airline to go to Kingston Jamaica there has been an issue this has been the worst experience!!! I have issued a compensation claim but will I be waiting 6 months for a response can anyone please advise me how long this process takes I feel so deflated by this airline there is no empathy whatsoever !!"
  },
  {
    "reviewDescription": "Le vol est parti en avance donc nous l’avons raté même si nous étions à l’heure"
  },
  {
    "reviewDescription": "Henry Johnson (an Indian customer service employee 😂) was extremely rude and failed to change my “flexible” booking"
  },
  {
    "reviewDescription": "What a terrible airline British Airways has become.\nI used to think they were a gold standard airline, but several negative experiences with them have certainly changed my opinion.\nThe journey giving cause for this review will be the last with BA.\nMy 3 year old grandson has dual nationality GBR/USA. His parents are not together so he had been staying in the UK with his British family for 11 months. I was travelling alone with him to take him back to ORD from MAN airport via LHR.\nI was issued the boarding passes for the 2 flights when we checked in at MAN. I only noticed just before boarding at MAN that on our long haul flight I was seated on row 40 with my grandson on row 28.\nI spoke to crew as we boarded the MAN to LHR flight & was told no problem just go to customer service at T5 & they would change our seats.\nI went straight to the service desk when we landed & queued for ages. I was unfortunate to get the most obstructive employee who questioned me at great length about the circumstances of my journey. She queried if I had permission to travel with my grandson (which I understand) and I produced many documents to prove my relationship to my grandson along with 2 letters of consent to travel, one from his dad, one from his mum.\nThis woman would not accept the letter from my son as it was not witnessed by a solicitor. Nor would she let me contact my son on what’s app to verify what I was saying. She said I needed to get a letter that was witnessed by a solicitor and until I had that we would be red listed from travelling! Getting this letter would not be easy at 1pm on a Saturday (but we did manage it thanks to a friendly local solicitor who answered his phone out of hours). Having obtained the required letter we obtained new boarding passes but had to travel 24 hours later, resulting in additional expenses and we had to pay for a hotel room for a night which we did not use. Altogether a very traumatic experience on what was already an emotional trip.\nI have complained to BA about this, along with another ongoing complaint about mis-selling of tickets (which has been ongoing since January 2023) and await their response.\nFor these reasons I will avoid travelling with BA and would urge anyone else to consider carefully before flying with them."
  },
  {
    "reviewDescription": "I've just had my latest experience of a rude BA agent and actually had to ask them to stop talking so sharply and rudely! Yet again, I feel resolute to avoid this company!"
  },
  {
    "reviewDescription": "Booked BA Holidays to Madeira for two- wanted an upgrade but website said ‘not available’. Day of travel offered upgrade by text. Took up the offer but was told only one meal available. Asked for a sandwich and was told they had all gone. When I said ‘I have paid for upgrade already’ was told by cabin staff. That is a different cabin and they cannot bring a sandwich from Economy to Club. They get £5 for the sandwich and I pay £89 and get nothing to eat except a bag of crisps."
  },
  {
    "reviewDescription": "4th week in a row BA flight Heathrow to Glasgow delayed by minimum 2 hours. It’s incredible how this airline can still operate I mean if it was a train franchise the licence would have been withdrawn years ago yet they just continue to churn out an appalling service to customers week after week."
  },
  {
    "reviewDescription": "Will never fly with them again, missed a flight due to not allowing enough time between transfers. Alternative offered 12 hours into the journey with a 13 hour wait with no offer off a hotel. Cost me an extra £600 to get a new flight which they refused to reimburse without any explanation after asking for 6 months.\n\nThey didn’t even send our cases with us (as they couldn’t transfer in time between flights) meaning we had 48 hours to wait for them to catch us up along with a lot of back and forth from our hotel to the airport to sort the mess out as you can only raise a claim in person!\n\nRuined the first 2 days of our once in a lifetime trip!"
  },
  {
    "reviewDescription": "Late arrivals to both Milan and Heathrow. No sandwiches on board. Disgusting chewing gum stuck inside the safety leaflet which was dog eared. Will never fly with BA again. It is sad - I flew with them as a child and they used to be good- now they are worse than Ryanair and Easyjet- Never again..."
  },
  {
    "reviewDescription": "Don’t book with BA. They don’t care about the passengers. My BA flight had a delay, after disembarking from the plane and running to get to my connection flight, a security lady stopped everyone just to check the date?!? Then when I pinged my boarding card, it said I had to go to cust serv. They said because you were late your seat is given to a standby passenger. They hadn’t even started boarding yet and had a delay themselves. Gave me much later flight instead which meant I missed my train, and room booking at my destination, costing me £120 extra."
  },
  {
    "reviewDescription": "Just got on the flight to Cairo. Paid nearly £1000 for a business class seat. The plane looks like a short haul jet. There is no leg room and at present all there seems to be is a middle seat that is free.\nLikely to be my last trip with BA"
  },
  {
    "reviewDescription": "Not only did my daughters flight from Houston to Heathrow get cancelled she then had to wait till the next day to get a flight, losing a day of her precious holiday. I am waiting at Heathrow and her plane couldn’t get near terminal 5 so she has been dumped somewhere else and been put on a bus. Her baggage is still to arrive. The plane was 45 minutes late so the cost of parking for me is astronomical. DONT USE BRITISH AIRWAYS. They are an abysmal service. Shame on you BA."
  },
  {
    "reviewDescription": "I was caught up in the baggage glitch that BA experienced on 25th June at T5 LHR. Gave up waiting for bags at 1am (there were no airport staff to assist us and no information offered by tannoy or any other way to advise if our bags were arriving or not) ). Immediately filled in the online forms for missing bags. Bags took 7 days to be returned. Tried several times to make contact with BA but telephone numbers automated. Their website is rubbish and their customer service is non existent as it is impossible to talk to a human being to get any info. Will not fly with them again if it can possibly be avoided."
  },
  {
    "reviewDescription": "It's incredibly hard booking and scheduling sometimes especially with added restrictions from country to country.\nWith BA all the info is there on there website and if there a problem the helpline always picks up."
  },
  {
    "reviewDescription": "NO customer support- phone never answered.\nOnline form taking weeks to get any reponse.\nDIRTY and very old planes.\nTerrible inflight entertainment systems.\nHorrible food quality.\nEconomy treated as cattle.\nBuisness class now stripped back to the bare minimum.\nthe WORST airline I fly with."
  },
  {
    "reviewDescription": "You are our national airline, so why is your service lower than a third world airline?! I have flown with many airlines; Emirates, Etihad, Qatar, to name a few, but BA is the worst!\n1 - I downloaded the app after making my booking, only for the app to keep saying that I have incorrectly logged on too many times and would not be able to log in for another 24 hours!! I had not logged on once!\n2 - confusion over baggage allowance with code share with another airline - fortunately, the lady at check-in was very understanding and sorted this out for us.\n3 - during meal service, we were trying to ask a passenger in front to move his seat from recline position so my husband could have his meal and the sour-faced cabin crew said that he was entitled to recline his seat - during meal service? Really?\n4 - and on that note, sour-faced cabin crew who looked as if they would rather be anywhere else than being on the flight!\n5 - half a sandwich on return flight, then nothing for another 5 hours until we were served breakfast prior to landing. I asked for some tea, which I never received, several other passengers also never received their tea and coffee!!!\n6 - my pre-ordered meal was given to another passenger both on outbound and return flight.\n7 - unable to check in online both outbound and inbound.\n8 - may I never have to use BA again!"
  },
  {
    "reviewDescription": "Surprised they are still in business to be honest!!!! No customer service, no assistance, nobody in any department wishes to assist and just passes you to another department. 9 months on and with no exaggeration, over 20hours on hold or being palmed off no further forward.. just unreal.. you pay a premium with BA as you expect a better service, not these days…"
  },
  {
    "reviewDescription": "Booked with BA from Marrakech to Gatwick on 21.30 flight. Apparently delayed by 25mins…. this was the one and only update for a flight that was eventually two hours late! The staff actively avoided giving any information to passengers we were left standing in an airless tunnel for 45 mins waiting to board the late plane. Passengers included elderly and very young children… no compassion or assistance offered to them. Once on board again no communication from staff, no apology no reason for delay .. no acknowledgment of the length of time lost. Once boarded another 30 mins before take off …plane crew unfriendly.. unhelpful… no smiles, no engagement… lots of fellow travellers also unhappy with attitude of crew. Safety messages unclear as delivered at high speed … sounded like garbles… unprofessional behaviour all round… will avoid BA in future … do not normally travel with them … tried them this time never again"
  },
  {
    "reviewDescription": "Case # 25887769\nI received no food in Business class and no replies or compensation, I paid for the food but received nothing! Is this a good service???"
  },
  {
    "reviewDescription": "Appalling customer service.\nReceived email informing us that they had changed our flight to a ‘wet lease’ budget carrier. Totally unacceptable as we had booked club Europe flights. Went on line to change to BA operated flight later the same day, and they wanted £210 to change! So, then spent over an hour trying to contact customer services - stuck at No. 1 in the queue for for 3/4 hour so far."
  },
  {
    "reviewDescription": "Be very careful with BA failing to credit membership points and Avios. I have had to go through a lengthy claims process four times this year simply to have these credited and then noticed that when they are eventually credited they are awarded at lower levels of membership points and award miles than identical flights taken within the same period. I have queried this but the response railed to address any of these points. Time to move airline."
  },
  {
    "reviewDescription": "My flight was BA2228 SKG to LCY on 10/07/22. Really nice flight. Everything went well. Staff Ms Laura and Tom were really polite, friendly and helpful (wish every flight had similar cabin crew). The pilot was informative and flew smoothly, so everyone was calm. higly recommend.\n\nApostolos Orliaklis"
  },
  {
    "reviewDescription": "No wonder everyone I know has moved to Emirates when possible.\nA business class flight to Dubai, BA were unable to assist me with lifting my luggage onto the arrivals check in belt and have nobody who can. In fact it “they are not allowed”. I’m 63, had hurt my back moving home and had 3 x 32kg suitcases.\nBA you’re a joke and have lost a loyal customer of decades."
  },
  {
    "reviewDescription": "Joining the one red star reviewers! How can an institution be as appalling as BA is? They really don't care how bad they are and clearly can't be bothered to reply to these reviews.\nMine: Missing frequent flyer points. Put in an online claim request last April and nil further. Follow ups sent... no reply or even an acknowledgment.\nWell done Willie Walsh: Prioritise Target Bonuses over customer satisfaction."
  },
  {
    "reviewDescription": "I travelled back from Mexico on the 21/04/24, and all I can say is that this was one of the worst flights I’ve ever been on. I can’t believe how BA treat their customers.\n\nPrior to the flight, I tried to purchase an upgrade on the seats on the way home as my husband is disabled and it was a long haul flight. Each time I got to the payment stage the website crashed on me. After the sixth attempt, I gave up. Due to my husbands disability, I wanted to make sure that we got the correct seating but I noticed that we had already been allocated the seats, when I checked the seats were right next to the baby changing area, so I already knew what was coming on the flight.\n\nBA clearly knew that my husband was disabled and decided to put him far away from the toilets making it difficult for him to get to. There were literally two toilets in the plane, long queues if you needed to use them. The food on the plane is one of the worst I’ve ever tasted, We ended up just going hungry. The cabin crew were unfriendly and rude. One of the flight attendants continuously bashed her trolley on my husband’s elbow and didn’t even apologise, she couldn’t care less, It almost looked like it was intentional.\n\nThe seats are crammed and if the person in front reclines their chair, you have no room for movement and we felt trapped.\n\nI will never fly with BA again, they deliver really bad customer service, the cabin crew are useless and don’t care about customer experience. The fact that they don’t even respond to any feedback just says it all!\n\n"
  },
  {
    "reviewDescription": "'Cannot Give You Any Guarantees'.\n\nComplaint submitted three weeks ago - Since then Silence..... broken only by the sound of tumbleweed.\n\n17th September - Vienna to Heathrow 19.10 flight cancelled with four hours notice. No explanation provided. Still no explanation provided.\nCancellation text from BA stated they would not pay for alternative arrangements we might make.\nTo be clear - BA's first communication was not to offer to sort out their own mess, but to warn us that BA would not cover costs if we sorted out their mess Despicable.\nAll links, phone numbers and contacts on paperwork provided by BA were useless - no response, incorrect number, invalid links.\nNo support or customer service staff on ground in Vienna, or indeed in London - it was Sunday evening which probably explains a lot.\nManaged to secure seats on next available flight ....24 hours later. Booked extra night of accommodation - no help offered by BA.\nEventually found email for duty office and emailed asking for re-assurance that replacement flight would depart. Pointed out that a delay of more than a day would be a problem as I would run short of vital medication. Received dismissive, patronising response which pointed out that BA were not in the business of providing flights to meet individual clinical needs. I replied stating that BA were obligated to get my wife and I to Heathrow within a prearranged time frame - and they had already failed to do that.\nI asked for names / contacts in Vienna who might be able to help. No response received.\nArrived at Vienna Airport next day, and managed to secure seats on Austrian Airlines flight to Heathrow.\n\nBA did not get us home, and BA have not contacted us since we arrived home to offer apologies, explanations, compensations for truly shocking service.\n\nBA? Bloody Awful."
  },
  {
    "reviewDescription": "Solo travellers are obviously regarded like cattle on board a BA flight. Briefly, as a solo traveller I went online to choose a seat and found I had already been allocated one. I didn't like the seat but when I went to change it there was only one option which I still didn't like. I phoned my friend who was travelling as a group of 3 on the same flight and she advised me there were a number of alternative seats showing on her screen. Clearly, BA regard solo travellers in a lower grade passenger and provide them with little or no options when it comes to preferred seating. I phoned BA who were less than helpful and said the matter is out of their hands and dealt with by ground crew (?). I have raised a complaint but doubt BA will take much notice of it..... had I of known that I would be treated as a piece of luggage/cattle I would have purchased a seat at the time of booking but without warning of limited access to seats as a solo passenger I didn't bother..... note to self...... don't give BA any credit for being a national airline, they are clearly no better thana budget one."
  },
  {
    "reviewDescription": "Cancelled our flight and now we are out of pocket for our hotel as our hotel won't refund us the money and missing out on holiday. I think it's disgusting customer service and I will not be booking with them again unless I am contacted regarding compensation for this."
  },
  {
    "reviewDescription": "Another British business going under!!\nFlew to turkey via Gatwick. Last day in Turkey by the pool I get a text flight home which was in 3 hours cancelled because of shortage of staff! I managed to get a flight the following day but only to Heathrow, my car was at Gatwick. Cost me 250 for accommodation for 4 of us and 200 for taxi from Heathrow to Gatwick.\nBritish airways are a complete shambles, avoid this airline if possible. All other airlines and staff were assisting their passengers swiftly through security and customs. We waited 2 hours to pass security and 3 hours waiting for luggage. Absolute Joke!!\nI feel sorry for anyone who’s booked a holiday with these cowboys!!"
  },
  {
    "reviewDescription": "Well believe it or not they went and cancelled my seats again which were paid for a year ago when I made the booking, I spoke to them only to be told by someone that could barely speak English that I can have money back, the plane type hasn't changed or anything else. this company is absolutely the bottom of the barrel or should I say cesspit.\n"
  },
  {
    "reviewDescription": "BA should add a D to its title. Budget airline standards at sky high prices. Never again!\n\nMy wife just flew in from Tel Aviv only to suffer from the lack of service and hard seats for over four and a half hours. She told meThe seats were not just hard but uncomfortable. Although the flight had been delayed for over three hours there was no food unless you paid for a sandwich. No entertainment. No Wifi. But sky high ticket prices. A £1,100 price for the flight. The most insanely boring hours of my life. I hope never to have to use this airline again.\n"
  },
  {
    "reviewDescription": "Never ever again. BA used to be an airline to fly with, now they just grab every penny. They couldn’t offer a refund and charged me for cancelling on top. Just cheap flights to Greece but flights for £365 ended up costing me £290.\nScammers, avoid any go with a carrier that shows a bit of respect."
  },
  {
    "reviewDescription": "Currently sitting on tarmac at T5. Been here an hour and no sign of movement. Booked business class but sitting in economy as overbooked in business. Denied access to business lounge on that basis despite paying the premium. Still waiting result of previous complaint for same issue on previous flight - paid for business, bumped to economy. No response / no refund despite this complaint being raised 5 weeks ago. This company is a joke and executive and CEO should be profoundly ashamed. But judging by the litany of one star reviews on this and other sites they clearly don`t give a toss."
  },
  {
    "reviewDescription": "Has anyone ever had BA Customer Service contact them directly following their complaints on Trustpilot?"
  },
  {
    "reviewDescription": "I had a really bad experince while in Grenada,it was the food, \"it was really bad,bland,and tasteless,just really boring,this made me very sick ,so i boycoted most of the resturants and ate very little ,but moaned about it for 6 weeks\nBest meal i had was on my return to the UK,\"from wings uptairs at the Airport ,but the oil made me feel worse and left me with a\nbad belly pain\n\nand needing water, badly,\ni was not feeling well at all ,sweating and feeling real bad, as we were still on the ground waiting for the other passengers to take there seats\nI asked the flight attendent (lady ) who\nwas of not much sympathy or intrest or use , gave me one small glass of water and walked off\nI asked for another, as this seemed to ease my discomfort ,she could cleary see i was not well,but still refused\n\nHer partner behind her,\nflight attendent KOBI..\nThis young man was a life saver he was very gentle and kind with the way he handled my situation , filled up my water bottle with no problems or issue's and checked\nin- on-me through the flight,\nI had to ask him his name to write this review,as he is what you/I expect a flight attendent to be like, \"im also trained in BA customer sevice, he was professional,attentive,and was a good look for the company , especially as he worked for British Airways, and i have seen the bad reviews, BA has on this page\nI would like to Thank you Kobi ...\n\nYoung man you were a True God-Send, to me in my time of disstress and need, you helped me through the 8 and a half hour long flight back to the UK, and that made me comfortable,and my trip back happy and comfortable as it could be , I would like to wish you well in your career and future..\n🙏\n\n\nAll the best to you KOBI,\nfrom ...\n\n\"The lady/couple in \"Seat No. 43 J&K Tania & Andrew,\nwindow seat - (right side at the back )\n\n(Grenada-London, 31/8/2024) (sat)\nBA: 2158 \"\nFrom..\nLady who gave you the water bottle and you so kindly filled up,this was a big help to me ,that soothed my pain\n\nThanks again 🤗\n\nI Appreciate You\n\nyour a star⭐️\n\n\n"
  },
  {
    "reviewDescription": "My bag was damaged on a recent flight from London to Glasgow.\nSubmitted an online claim, including photos, evidence, etc.\nHeard nothing.\nWent online to check progress of claim - it says 'claim closed, an e-mail has been sent'.\nDidn't receive an e-mail.\nOnto help centre to find a tel number - nothing. Use the AI chatbot - chatbot decides I want to book a flight. Say I need to talk to someone.\nI get a 'real' person on the live chat - explain the situation. They go and check.\n'The case has been closed, we've sent you an e-mail.'\nNo you haven't.\n'Have you checked your junk folder?'\nYes, because I'm not a complete idiot. You haven't sent me an e-mail.\n'You can submit extra evidence for the claim and they'll send you another e-mail.'\nHow do I do that?\n'There's a link in the e-mail we sent you.....'\nArrrrgh.\nLook, can I please just talk to someone?\n'Here's the number.'\nRings number - selects option.\n'Please submit a claim online.' Hangs up.\nRings number again -selects different option.\n'We're putting you through to our Customer Services Department'.\nHooray!\n'Sorry, we're too busy to take your call. Please call back another time.'\n\nI'd laugh if I wasn't down an expensive case, and if I hadn't spent the last 40 minutes on this."
  },
  {
    "reviewDescription": "Horrible airline"
  },
  {
    "reviewDescription": "Probably the worst short haul flight in my 68 years. Almost, but not quite, as bad as travelling from Cyprus to the UK in the back of a C130 Hercules. The seats are uncomfortable, don’t recline and there’s not a lot of legroom, and the air was so dry I had a splitting headache after an hour.\n\nThe inflight service was a joke (a tiny pack of crisps and a minute bottle of water). The choice of stuff you can buy to eat and drink on board is dire and the pre-order selection is not much better. Honestly, they’d be better off installing some vending machines.\n\nWhat are BA trying to be and what have they become? Answer, firstly I’ve no idea what their aim is, but they’ve become a seriously expensive version of Ryanair, but not as good.\n\nThe only plus was that the Flight Deck and Cabin crew were very professional and the landing was superb."
  },
  {
    "reviewDescription": "Excellent, Thanks very much💚"
  },
  {
    "reviewDescription": "Used BA to fly to Egypt for a two week holiday. We left on 18th December but our suitcase never left Terminal 5 Heathrow. Did not see it again until it was delivered to our home on the 9th January. After an enormous amount of inconvenience, frustration and expense BA will offer us nothing in the way of compensation. We now have to go to the trouble of making a claim through the CEDR Foundation. British Airways used to be a great company, but no longer. I just hope that their plane maintenance staff have a better attitude.\nThey should not be allowed to use the word 'British' in their name, it just brings more shame to our country. They also changed our seats, which we had booked and paid for, without a word of explanation or apology.\nWe have flown with many airlines, hard to think of a worse experience than with BA."
  },
  {
    "reviewDescription": "Harvinder Jesse Saran, was exramiley helpful and very very Excellent customer service , please recognise her service in terminal 5 heathrow . She deserves a promotion asap."
  },
  {
    "reviewDescription": "After loosing a weekend on hold to this embarrassment of a firm, I only booked flights with them as they wouldn’t give me a refund on my evoucher. Only for them to cancel them after accommodation etc was paid for! The have gone from the pride of Britain to the Shame!\nI would rather bend over and take it dry from the population of Broadmoor than ever book with them again!"
  },
  {
    "reviewDescription": "They keep getting worse and worse.\n\nWhere to begin ...\n\nUnhelpful and rude customer service?\nConsistent flight delays (5 hours in one of my flights quite recently)?\nLoss of luggage and no assistance in the aftermath?\nGhosting you after saying they will get back to you with compensation for a delayed flight?\nContinuing to ghost you after you reach out to follow up on their lack of action?\nStupidly extortionate up-marking of flight prices when you book it as an amendment instead of a new booking - just so they can pocket more money? (This happened to me just yesterday)\n\nThis has been my experience across multiple BA journeys over the past few months. On a level of principle, I'm never booking with BA again, even if other airlines are offering more expensive rates."
  },
  {
    "reviewDescription": "worst airlines !!\n\n\nCanceled my flight 3 hours prior and its been 3 months with no compensation."
  },
  {
    "reviewDescription": "One star is too much....\n\nBooked business class tickets for a once in a lifetime trip, received a cancellation notice and they refuse to refund the tickets as the cancellation was not done by me!\n\nHuge back and forth story but was basically told pointless to keep emailing as it will come to me as the case handler and i will keep telling you to go away.\n\nI travel 2 weeks this Thursday, well i was going to.......\n\nAbsolute disgrace, and no reply from @seanl.doyle@ba. com #chiefexecutive #ba"
  },
  {
    "reviewDescription": "Shambolic organisation\nEmbarrassing that they are British\nChoose another airline\nCustomer services:- non existent\nThey work on the ethos of how can we screw as much money out of the customer as possible , and when things are going wrong they cover it up by lying\nWon't bore you with the details but our holiday was ruined by their incompetence\nBA275 LHR LAS\n"
  },
  {
    "reviewDescription": "Bitterly disappointed that I can not choose my seat on booking even though business class…..\nHave to wait till 24 hours before travel and take what available\nNever travelled long haul alone which is why I spent a lot to go business - what’s the point???!!"
  },
  {
    "reviewDescription": "The absolute worst\nHad to cancel a flight for medical reasons\nThey told me I could use the credits to book a different flight. I have been trying to do this for 3 weeks, wasted about 4 hours of my time with customer service, they can’t find a way for me to use this voucher, claiming the “back office” hasn’t yet calculated how much money I am owed. Absolute nightmare and unprofessional. Worst than a low cost airline."
  },
  {
    "reviewDescription": "Dreadful customer service, sent a complaint and received a generic coy and paste answer, you must really value your customers. This one wont be returning!!!"
  },
  {
    "reviewDescription": "British Airways nous abandonne !\n\nExperience désastreuse lors d’un vol un samedi aprs midi Londres Heathrow - Toulouse. Le vol a été annule pour problème technique et on m’a renvoyé au terminal sans plus d’explications après 2h d’attente dans l’avion. En arrivant, une employee BA nous “accueille” et nous dit d’aller chercher nos valises puis de nous diriger vers un service de l’aeroport qui s’occupe des logements… En gros ils se déchargent de nous et nous font comprendre qu’il n’y aura pas d’autre vol de la soiree.\nAucun autre contact avec BA. Le service client est ne donne aucune réponse, et personne qui ne parle français dans cette compagnie.\nJe me retrouve donc avec un vol le lundi matin et une seconde nuit d’hotel et des repas a payer de ma poche en espérant peut être un remboursement…\nA éviter a tout prix !"
  },
  {
    "reviewDescription": "The worst experience ever! I have a booking, made directly with BA, which doesn't show in my account, also for some reason it can't be added to my account. I've chosen seats for the outgoing flight, but they are not shown anywhere. For the return flight choosing seats button doesn't exist... I've tried different devices, different links - nothing works. The app doesn't work either. Can't even see my booking there. My next trip most certainly will be with a different airline."
  },
  {
    "reviewDescription": "Delayed out (flight cancelled) and for 12 hours on the return which meant an unexpected overnight stay. My main bugbear is lack of support - there were no staff in CDG to help and it’s impossible to get through via phone. Only positive was lovely helpful Louise at BA T5 ground staff."
  },
  {
    "reviewDescription": "Von München nach London sind wir erstmal 3h zu spät losgeflogen, weil kein Personal da war. Wie kann denn das bitte passieren? Plant man das nicht vorher ein? Dann Anschlussflug nach Portland verpasst, musste zwangsweise in London übernachten. Auf meine Rückerstattungsanfrage für die extra Hotelübernachtung in London bis heute keine Antwort bekommen.\nAm nächsten Tag nochmal selbst drum kümmern müssen, dass mein über Nacht eingecheckt gebliebener Koffer auch mit nach Portland kommt. Hätte ich nicht nachgefragt, wär er in London geblieben.\n\nRückflug London nach München, wieder 2h Verspätung wegen technischen Problemen.\n\nUnd dann noch diese dumme Kundenservice Taktik: wenn ich lange genug nicht antworte, dann gibt die Alte schon irgendwann auf mit ihrer Rückerstattung.\nNie wieder British Airways."
  },
  {
    "reviewDescription": "Once upon a time BA were the pride of this country. My partner booked a flight to Harare Zimbabwe to visit her daughter. Firstly she was charged twice and took hours on the phone to sort. Initially BA didn't want to know and just offered a credit instead of a refund. Today she received a message that her connecting flight to Harare had been cancelled because the airline had gone bust. No other information was received. After phoning BA and being cut off several times,(normal) they would not accept it was their responsibility to arrange an alternative. My partner has now booked with Emirates and cancelled the flight with BA. Hopefully she will get her money back but sadly will probably be another battle."
  },
  {
    "reviewDescription": "Paid extra for designated seating for a family holiday in July. I wanted seats so my family and friends could sit together and despite paying extra for designated seating I did not get my designated seats on my outward bound journey or my return journey.\nPut in a complaint about this on 1st August and I am yet to even receive an acknowledgement!!!\nCompany is obviously robing people of money making them pay extra for seating that they don’t allocate and then don’t respond to complaints what a joke!! Avoid like the plague."
  },
  {
    "reviewDescription": "Flight delayed 2 hours. Eventually got airborne, and usual platitude about complimentary water and snack - probably the only airline flying to do this; don't they realise that customers actually want the opportunity to have a trolley service?\nOnboard wi-fi not enabled, so no opportunity to order refreshments until tried to request from water service stew at about 35 minutes into (half full) flight. Told that short flights don't do any service, but when queried was told that wifi now switched on and we could order.\nDrinks presented 15 minutes from landing, but declined.\nSpoke to Cabin Manager on disembarking, stated disappointment in levels of service, and was asked where we were seated - WHY?? Should levels of service not be consistent throughout? No smile, no apology, no sign of flight deck crew either.\nIt would very much appear these days that if the crew can't be ars*d, then no wifi, no service, we really don't care.\nIf there was an alternative into LHR you would lose passengers in absolute droves, and I find it disgusting that BA can use its monopoly to deliver such a shoddy, apathetic service. Shocking."
  },
  {
    "reviewDescription": "very expensive , low cost airlanes offers about the same for much cheaper fares"
  },
  {
    "reviewDescription": "So I want to take a moment to complain about the terrible service my mum got from British Airways (England-Poland).\nFirst of all 2 weeks before their flight it was cancelled and they had to rebook a flight that wasn't direct and had a stop within it. Also rather then coming back on the 12th they had to come back on the 11th so they already lost 1 day. When they got to the airport British Airways couldn't find their tickets (ended up waiting 1hour and 30minutes to find/print the tickets) so they ended up being late for their flight and missing it completely. They spent another 2hours and 30minutes waiting for another flight which got them to Munich however, they were delayed again and ended up being late for their flight to Poland and missing it again. In Munich they had to wait another 8hours before they could get another flight to Poland.\nThey finally got to Poland at 1am the next day....\nWhat a Joke, They lost a whole day and had nothing but stress and a negative emotional rollercoaster...\nWould definitely NOT recommend British Airways to anyone."
  },
  {
    "reviewDescription": "Just the worst service ever. The app always takes you to a website which doesn’t work and tells you to use the app which is laughable. Then when it doesn’t work and you call the clowns you get an automated message saying the phone aren’t working and to use the website 😆😆😆"
  },
  {
    "reviewDescription": "Spent the last hour trying repeatedly to check in online and move my seat for a flight tomorrow. Every time I enter my payment details it returns to the My Booking page. After much digging I found a call center number which just drops out mid conversation. It's the worst Indian help desk I've encountered for over a decade and I buy help desks for a living! Background noise so bad the agent couldn't hear me and I had to keep repeating my booking number. Then mid call when she's trying to help me the call just drops out. I am now left with a mid row seat and no way to change it. BA I AM TRYING TO PAY YOU TO CHANGE MY SEAT AND YOU AREN'T TAKING MY MONEY!\nFlew Play with my family last week. Online system was amazing. Simple. Error Free. Yes it's low cost, no frills but the customer experience through the sales process and online booking was amazing. I am ashamed that this is our flag carrier. Cheap nasty service with ancient broken IT systems."
  },
  {
    "reviewDescription": "Pretty poor overall experience...the staff were fine, no problems there...and the flights were very smooth, but it had to be one of my worst long haul flights ever. (The return flight was no better). I'm pretty average size, so economy doesn't usually cause me any issues, but BA seem to have shrunk the seat/leg room, and the seat 'cushion' was like sitting on a plank. The in flight meals were the worst I've ever had...it was definitely one to forget, and never to be repeated...sorry BA.👎"
  },
  {
    "reviewDescription": "What a pity one cannot give zero stars! Arrived in Heathrow on 11th December and checked in for an onward flight to Edinburgh. Admittedly, it was foggy but they did not actually cancel our flight until we were airside. Essential to get home so took train north and were told that baggage would be forwarded. Had to speak to a real person to actually file a report re baggage. A week later, one of two cases arrived but it was not ours. So refused to accept it from the courier, who actually said it was not the first time this had happened to him. Some idiot at Heathrow had wrongly labelled it even though it did not in any way resemble the description filed with BA - wrong colour, wrong bag type, wrong receipt number. Second case arrived five days later (and it was badly damaged to the extent that it is no longer usable). We still do not have the first one. However, baggage tracing system still thinks that it was to be delivered by courier on 19th! Tracking round the BA site is tortuous and pointless. It seems to be just a circular journey. I am beginning to despair that I will ever see the case again. What makes things even more disappointing is that the two cases were checked in together and were identical even down to the same pink baggage security strap. Coupled with the quality of flight menus and cramped seating on our original outward flight two weeks earlier, even though we have been members of the Executive Club for more years than we care to think, we are vowed never to use BA again if we can avoid it."
  },
  {
    "reviewDescription": "What a joke this company is. I've raised concerns already with the CEO about service and it got swept under the carpet. I just called to book using my Avios account and due to issues at BA I was told just pay cash. The staff member was just like the one I got on January 16th and began to get abusive when I asked for a staff reference so o can raise complaint against him. I was respectful and feel violated and feel there is discrimination at play here. I asked for a manager or duty manager which was denied and I was told I don't listen and when I said I'm raising my concerns I was cut off. This happened on January 16th too. I called to use my Avios points to book business class flights as I did before but this time my accounts blocked for no reason and it can't be reset apparently. Because you ask for a manager to help your denied and it's about time these people realise that without our business they'd have no job and I'm going to look at booking with Virgin Atlantic now instead. Please please do not give this Egotistic company and CEO your business and make sure you all review with negative feedback so they finally sit up and take notice. I emailed asking if a manager could call to help and instead I got an email saying sorry just call us to book again and it's just not a good enough experience not to mention 5 times more expensive than Virgin Atlantic for the same flight from London Heathrow to Boston BA price 11.5k v VIRGIN 2.3k big difference folks so please shop with other decent airlines before you're fleeced with sad violating service for the privilege"
  },
  {
    "reviewDescription": "Overall I’d say good. Service on plane was nice staff were friendly everyone was happy to help. My only issue was trying to call to discuss an mistake made by me it’s pretty damn hard to speak to someone over the phone at all it took me 2 days to actually manage to speak to someone about it all witch is less than ideal but we got there in the end and they were really helpful when I did speak to them and got what I needed sorted so very happy and are looking forward to our holidays and our flight back next week"
  },
  {
    "reviewDescription": "Customer service is atrocious nobody is aware of situations\nWe had a flight cancelled, flew 3 days later having been made to come back to the airport every day to wait in a queue for a hotel voucher!!! A different hotel every day"
  },
  {
    "reviewDescription": "I used to rate BA as being one of the best airlines in the sky. Not these days. Wow, have they gone downhill.\nFlew premium economy to Japan but should have saved my money and gone economy instead. Staff clearly needed more training - shouting at each other across the aisle. “What’s the name of the spicy stuff you put in bloody Mary’s??”\nRan out of both chicken and beef options and I was in the second row! Obviously could have saved money printing menus… no snacks, when I asked for water was given half a plastic cup full (this is a 14hr+ flight). Staff obvious -\nLook and sound like they’re on a Club18-30s jolly. Entertainment disappointing, hardly anything new or particularly interesting. Totally underwhelming. Won’t fly again.\n\nBy the way I flew out with Japan Airlines which was probably the best flight I’ve ever had. Absolutely superb. BA feels like Ryanair in comparison.\n\nWould have been 1 star but flight was on time and I received my bags."
  },
  {
    "reviewDescription": "Die schlimmste airline ever...vienna london flug 3 stunden verschoben 2 stunden davor bescheid gegeben...dann flug nach los angeles gecanceled komplett..\nDann baggage verloren kannst keinen erreichen.\nDann beim rückflug von vegas nach london 2 stunden verspätung...\nDeswegen den anschluss glug verpasst ....service eine katastrophe....nie wieder mit der airlinw"
  },
  {
    "reviewDescription": "A simple thing such as able to change your name in your profile in the website is unachievable. There is an Edit linkbutton next to your name but once you click on it, the website log you out, and redirect to the homepage. What digital logic is that? I'm stunt as an IT architect."
  },
  {
    "reviewDescription": "British Airways refused to help when we arrived at Brandenburg airport on 13th June. We were unavoidably delayed because the SBahn trains were cancelled. We still however arrived an hour before the flight was due to leave. This was despite us getting to the airport via an alternative means.\n\nThe British Airways representative at the check-in desk refused to let us check-in our bags because the gate closed early. We must have arrived minutes late. We were checked in on line the day before. She offered no assistance whatsoever to try either to get us through fast track security nor to rearrange our flights. She said we had to phone British Airways to do that. What if we did not have a phone as some older people do not? It is also impossible to phone them. I tried to phone but they had too large a volume of calls and was cut off.\n\nAfter waiting to online chat with an operator for a long time I gave up and managed to access the BA booking website. Unfortunately the next flight was unavailable and there was also no availability later in the day so we travelled back to the uk via Lufthansa to Manchester via Munich. Some distance from our target airport Newcastle Upon Tyne.\n\nThe British Airways representative at the check-in desk could have tried to help us perhaps by fast tracking us through security particularly as the flight was in an hour. It did not leave early. We checked. There is no way it was boarding an hour before take off. It was due to leave at 11 am to Heathrow and departed at 11.02. We were at the airport at 10 am.\n\nThere is also no service desk for British Airways at Brandenburg. All the other airlines have one. So there was no one to help us. This is totally unsatisfactory customer service. I went to the Lufthansa desk for help.\n\nOn arrival at the airport indeed it was difficult to find where to check-in our luggage because whilst other airline logos are clearly displayed there was no such signage for British Airways.\n\nThis caused us immense distress and inconvenience and indeed expense. We had to pay nearly £700 to get back to the UK which is an utter waste of money. We also had to get back to the north east.\n\nThe representative refusing to help us was bad enough, but her lack of compassion left much to be desired particularly as the gate was closed early."
  },
  {
    "reviewDescription": "Always have a great trip with BA. Long or short hall. Clean cabins, friendly staff and over all a pleasant experiences"
  },
  {
    "reviewDescription": "Just returned from a week in New York on the flight out they forgot a suitcase and took 30 hours to get it to us then on the day before we were due to fly home sent us a text to say they had cancelled our flight and had put us on a flight the next day from a different airport. No information as to our accommodation or transport changes. Eventually after several phone calls to numbers they supplied which aren't answered we are told to sort it for ours self's and pay for it then can claim it back on our return. No good enough"
  },
  {
    "reviewDescription": "I would rather gouge my eyes out with a rusty fork than fly BA ever again.\n\nI was forced to sleep on the floor for over 24hrs with kids under 3 years old in an airport. But low and behold BA online claim form doesn’t even work, I’ve wasted 3 full work days trying and the phone lines are useless. They may as well just tell me where to stick it than even pretend with these fake forms online that they have no intention to work or to honor.\n\nBritish Airways are by far the worst airline I have ever travelled. Never again, never ever ever!"
  },
  {
    "reviewDescription": "As a Brit, I have continued to try to support out national carrier, but no more. Their service continues to go from bad to worse, with the surliest staff and flight attendants who seem to disappear the moment a flight takes off and then spend most of the flight chatting to one another whilst hiding from the passengers, and huffing and puffing and looking down their noses at you when you dare to push the service bell [waited OVER AN HOUR at one stage]. And you can tell how much they couldn’t care less, because they do not even bother to respond to a single review on here. Fly with someone else, and avoid Heathrow at all costs as it is utterly shambolic. What an appalling welcome to the UK for tourists"
  },
  {
    "reviewDescription": "I haven’t flown with BA for 25 years what a change! Aircraft tired and dreary - crew no better. Food was disgusting. Aircraft A380 was cold - no water in toilet for washing hands staff provided a bottle - door didn’t close properly. TVs weren’t working great. Flight delayed with poor excuse. Then had to wait 2 hours for luggage to come through. BA used to be top notch - gone right downhill - will not be flying again. Experience with short haul flying with Jet2 so much better!! Really disappointed, especially as fares not cheap!"
  },
  {
    "reviewDescription": "What a joke BA are! Booked a flight with Logan air through BA. A few weeks later they change the flight time to one that doesn’t suit, they also managed to get my name wrong. Several phone calls later I re- book a flight that was near identical to the first one I booked… I also asked them to correct my name. I send them i.d. and they confirm the changes in an e-mail. Today they mail me confirming my flights have changed again, not the amended flights we agreed but the first lot of corrected flights! Not only this but they still have my name wrong! Apparently that’s my fault for not checking the booking on line - must have forgotten to consult my crystal ball! So no suitable flights available and not able to correct my name BA feel it best to refund me. Of course my £190 flight at this late stage to rebook will now cost me £300. Do yourself a favour, don’t use BA to make your booking for you, they are grossly incompetent!!!!!"
  },
  {
    "reviewDescription": "1.3 is poor by any measure. I've not been spoken to before like I was today by a stewardess at the back of BA 2643 from Málaga. We were instructed, not asked, to place bags that we'd flown over with under the seats, not in the overhead lockers. Then watched while she ignored other passengers placing similar bags in the lockers without intervening. She said \"I'll just let them all do it and they can have a 2 hour delay. See how they like that\". How grossly unprofessional. BA used to be a quality operator. Now they are just an expensive bucket shop operator with rude staff. That's on top of the hour delay. Never again."
  },
  {
    "reviewDescription": "Even one star is too many. As I am writing, we are standing in front of the check in for three hours and 15 minutes. Apparently, our flight had been oversold, and we have to wait 24 hours to travel. Nearly four of them are spent on rebooking. A very short flight to an aging relative got shorter. No care in the world, no way to contact customer service. No compensation, no urgency. Never again will we fly by this company."
  },
  {
    "reviewDescription": "I have flown 5 times in the last month and EVERY trip has had an issue. From cancellations to delays to lost luggage and getting sent to another airport six hours after my original flight was cancelled (after a 14 hour flight from Hong Kong to London). I’ve been flying with them for 30 years and it’s never been like this."
  },
  {
    "reviewDescription": "We had to cancel a flight in May 23 due to my wife being hospitalised. The cost of the flight was £485 and BA offered a refunded of only £90.98. When we booked the flight we used a card that has now expired. An ARN has been issued by BA and this number has been given to our bank. They have no record of a payment. We have continually tried to claim this amount through customer services. We have repeated the same story everytime we call them, or have been asked to called them. We will NEVER consider using BA again. We have booked a long haul flight to Australia with another airline."
  },
  {
    "reviewDescription": "Seemingly impossible to modify an avios car booking. No option to manage online. Called the only phone number on the email confirmation. Waited half an hour to be told it was the wrong number. I've now been waiting for 1hr on hold on the new number I was given. What an absolute joke this company has become."
  },
  {
    "reviewDescription": "I have never experienced such a bad customer service.\nOur flight has been cancelled. Unable to resolve through 'Manage my booking', I had to call the customer service a few time. 5 calls, now over an hour on the phone, this is still unresolved. Apparently there is glitch on the system and we have no tickets. Our 4 months old baby has been booked on a seperate flight, flying on a different day. Good one BA.\nAnother call and issue still not resolved. Incredibly frustrating!!! Customer service outsourced abroad withe no one able to deal with anything. Just people ticking boxes behind the desk."
  },
  {
    "reviewDescription": "Booked recent trip with BA. Booking clearly stated baggage allowance included but was charged €85 per bag at check in, just received complaint response from BA saying hard luck!"
  },
  {
    "reviewDescription": "BA must have the poorest information technology platform of all airlines. They do not seem able to maintain a stable platform to deliver a seamless and hassle free customer service. They probably hired the same IT-team that wrote the disastrous MCAS software for the Boeing 737-800 who’s credo was “crash and burn”.\nBritish Airways needs to get a grip and drag its half-assed IT system into Century 21."
  },
  {
    "reviewDescription": "Travelled with BA on 29/5/23 from Kingston Jamaica to London England. They claimed they had a faulty break pad on one of the wheels. BA had no back up plan. They felt it was OK to leave its passengers sitting around for 5 hours, then advised us to check in our carry on bags as we were boarding, then once on the plane advised us there would be limited service from the cabin crew due to the late hours, then to top an already terrible journey, they advised us when we landed at Gatwick after a 9hour 30 minute flight. No luggage was put on board all luggage was left in Jamaica and the luggage would not be brought back to England until Friday 2/6/23. British Airways are truly the worst Airline ever and intend to boycott them"
  },
  {
    "reviewDescription": "I booked a BA flight from Heathrow to Cape Town and back again and, at the same time, pre booked seats from Cape Town to Heathrow. I requested a window and aisle seat (no middle seat, just 2 seats together) and paid £74 total for which I received a receipt. The receipt clearly shows Seat 44K (window) and Seat 44J (aisle). When Managing my Booking on the BA website a few days ago I checked our seats and they have been changed to a middle and window seat although the row remains the same. There are now only 2 seats together at the back of the plane which have been taken. When I first booked I had a choice of about 3 rows each side with just a window and aisle seat. I contacted BA Customer Relations who insisted the plane had not been changed and those were the seats I originally booked and blamed the incorrect wording on my receipt to a technical fault. I strongly disagree. How I now wish I had taken a screen shot of my booking. I believe I am owed a refund since they cannot offer me alternative window and aisle seats. I submitted an online BA complaints form but they directed me back to Customer Relations as they only deal with post flight complaints despite my already having told them that I contacted their customer relations team. BA have appalling customer service. This is not the first time I've had problems with them. I would not use this airline but, as far as I'm aware, they are now the only airline with direct flights from Heathrow to Cape Town."
  },
  {
    "reviewDescription": "Booked our flights back in February. Paid on Avios for extra legroom seats for 2 people both ways. BA emailed us confirmation. Looked toaday and thay had apparently changed the plane, not transferred our requirements ofr extra la=egroom and not notified us of the change. Paid an extra £34 for seats then complained that we had to effectively pay twice for the privelege. BA cancelled the paid booking and also the seats. Trying to explain to an agent that we had already booked seats got us nowhere. Not happy."
  },
  {
    "reviewDescription": "Awful - The World's Leading Airline - you are having a laugh. Having allocated my family (2 kids 8 and 11) of 4 seats spread out across the plane I was forced to pay for preferred seating. The website crashed whilst doing this and BA took double AVIOS points as well as the payment. On arrival at the gate we had difficulty at every step with the airport. Turns out BA had moved our seats but not advised us and the Boarding Passes we had were wrong. Made for a very stressful outbound experience for something we had to pay extra for. Wrote to complain, not been addressed and its been over 6 weeks. They did send a reply saying \"Due to high volumes we are currently not able to reply to your email\". WHAT? They subsequently have sent holding replies saying that they will get around to answering and (I hope) returning my AVIOS points and payment for the seat booking"
  },
  {
    "reviewDescription": "This year I flown and have spent thousands of pounds on this arrogant scam airline, I am one world member but not restricted to BA and I had option of virgin flight going to US and any other 5* Middle Eastern carrier. I have no idea why I picked this, thinking is a standard airline and must be great. I can not list everything that had gone wrong not one flight went smoothly, they should return all that money they took from me. Everything is wrong with BA from T5 staff, onboard experience (food can be 12 hour flight or 7hr only 1 meal served, entertainment limited and basic, staff young and no idea how to speak to passengers we are not all after your free booze water is fine if that’s not a great effort) and collecting baggage expect to wait hrs.I have a long list of complaints but the worst was I opened my meal I found a random PEANUT on top!!! And all those allergy announcements are just lip service going on."
  }
]