[
  {
    "reviewDescription": "My company booked flights via BA for a flight operated by Aer Lingus for several of our staff. These were the only flights we could get from this location (Cork > Heathrow).\n\nUnfortunately on the day, Aer Lingus cancelled the outbound flight and sent us emails confirming this. Our staff had to leave the airport and could not travel. We were told by Aer Lingus that we had to go back to the point of purchase to get a refund.\n\nOn approaching BA we were told that their system had not updated so the flight appeared to have gone ahead and as such we were considered 'no shows', even though we had written proof in several emails which we provided from Aer Lingus to say that the flight was suspended due to unavoidable operational issues and that we had been told we could change flights or get a refund. As such, BA's information regarding this flight was not up to date and was incorrect.\n\nI was told by the member of staff at BA 'customer service' that **I** had to contact Aer Lingus to get a written email confirming that the flight was cancelled despite providing proof in several emails from Aer Lingus already.\n\nI as a customer of British Airways should not have to do all the legwork because BA's systems had not updated. Why did this staff member not call Aer Lingus herself for a confirmation for me? Why was I left to organise further proof for the refund myself? Why are they selling flights with 3rd Parties if they aren't able to keep track of each flight they are selling?\n\nWhen I got a response from Aer Lingus by email confirming that I was due a refund, this was not accepted by British Airways. I have *AGAIN* had to go back to Aer Lingus to ask for another email demanding that I am due a refund. Aer Lingus have been helpful throughout and have provided countless details and have admitted that they could not operate the flight we were sold by BA.\n\nI am honestly shocked by the way British Airways have handled this. Be very wary of ever purchasing 3rd Party flights via British Airways. They are unable to assist when things go wrong and are offer no help whatsoever.\n\nTo top it off, if you don't get cut off or aren't waiting on hold for ages you get put through to call centre on the other side of the world, where you have to handle poor communication and heavy misunderstanding which is incredibly frustrating and time consuming. I have had to constantly repeat myself and clarify simple details which they just couldn't understand.\n\nThe call centre staff member had the audacity to tell me that she \"Didn't have the time to spend this long on a call\", I clarified to her, that I didn't either and that it shouldn't be this difficult to get a refund for a flight that was not operational.\n\nThe company I work for is international and we use flights regularly to move staff around the world. From this point on, we are no longer using British Airways and they have lost a loyal high spending customer for a worldwide brand.\n\nI now again, await a response from BA and apparently I should get an email within 48 hours with a DECISION on whether we will get a refund. There is no decision needed - we are entitled to our refund! Unbelievable. I am actually astounded that the onus is left on the customer to do this much work.\n\nIf they do not refund us, we will seek a chargeback from the bank as we have all the documentation to back it up that the flight was cancelled and we should be refunded.\n\nDenying refunds should not be made the bigger issue than the initial flight cancellation.\n\n(22/08/24) Update - I was told on the 14th I would get an email in 48 hours. It is now the 22nd, no response from BA so far. Chased them again today by phone. Again, unhelpful response, nobody can give me a straight answer. We will proceed with a chargeback.\n"
  },
  {
    "reviewDescription": "Just tried to check in to tomorrow’s flights after getting Verifly ready to travel. BA states check in not available because COVID documents haven’t been loaded. Verifly state it might because we made a mistake on our name date of birth etc. - we didn’t. This just adds to the litany of cancelled flights etc from BA. They need to get their act together now!"
  },
  {
    "reviewDescription": "The Rating really is Zero. Our luggage has now been missing 31 Days!! I am unable to speak to anyone in person regarding the whereabouts' of our luggage and why it hasn’t been located!\nThe Customer Service shown by BA is absolutely appalling and not acceptable.\nBA are not interested and not communicating with us at all regarding the location of our cases. It is impossible to speak with a human being!\nThe final insult last week, via a BA Chat line: BA advised me to contact the Spanish Baggage Team!! I am staggered by the audacity of it!\n\nBA are responsible for our checked baggage and should assume responsibility for the protection and of locating it.\nWe are totally dissatisfied with BA and the lack of customer service, care and commitment to their passengers; it is disgraceful!\n\nSupporting notes:\nTwo of our suitcases did not arrive at Barcelona airport. This caused severe inconvenience & disruption to our cruise holiday. Plus, lengthy waiting at Barcelona airport in order to register the missing baggage report. Which in turn delayed our embarkation on the ship. Having received emails & text messages from BA advising us they our luggage would be delivered to Palma airport. This was 3 days into the cruise. We then found only the hand luggage case had been delivered to the ship!! Our cruise line concierge on Oceania communicated with BA on our behalf. We were then informed the missing suitcase will arrive in Malta; 6 days into the cruise!\nMy husband only had the clothes he travelled in!! We both only had trainers to wear for 3 days. This resulted in having to shop for clothes, therefore, wasting our valuable holiday time at the ports of call. The missing luggage was never returned to us for the entire duration of our cruise. To date the luggage remains missing. Totally unacceptable!\n"
  },
  {
    "reviewDescription": "Stuck in Heathrow trying to get to Edinburgh on a flight that was not cheap. My flight alternated between canceled and on schedule after the recent BA IT issues. Employees had no clue what was going on and the only reason I ended up on the plane was because I kept bugging the employees to check my flight. Got into Edinburgh after hours of being at the airport just to find out of the 100+ flyers only six bags had been loaded on the plane and made the journey north from London. I filled out a form and was told the bags should be in tomorrow, so far I have nothing and have been wearing the same clothes almost 72 hours. I have no clue where my luggage is, no clue when it will get here, and still have multiple days left on my trip, or any idea if I’ll be compensated if I have to buy new clothes. Avoid this airline at all costs."
  },
  {
    "reviewDescription": "They have double charged me for the same booking, there have been two weeks and still no refund"
  },
  {
    "reviewDescription": "Criminal Organization is the best way to describe British Airways. I was constantly sending emails to their Customer Service, Customer Relations and even the CEO, filled in countless online complaint applications and phoned up But got nowhere for 2 years. There phone system is just rigged to hang up on customers if the customer is not calling to make a booking. After this 2 year wait their company are in debt to me and owe me compensation for the flights and time they have cost me but will not pay the debt. I would rate them Zero star but it's not an option."
  },
  {
    "reviewDescription": "Food on all flights was awful. Delayed boarding on grounds that flight was full and hand baggage needed to go in hold - it was nowhere near full with plenty of overhead luggage space. One case did not arrive at Manchester and they traced it to London. So what did BA do? Returned it to Johannesburg! Eventually it gets to Manchester but BA fail to pass our contact details to their courier so they are struggling to deliver it. Avoid."
  },
  {
    "reviewDescription": "Simply shocking. 2 x flights cancelled with 7 days of each other, both causing significant disruption and additional cost, and BA do not even have the empathy, manners or professionalism to respond to my claims.\n\nI am 9 x weeks down the line and the only success I have had in terms of communications is the odd reply to a tweet. Truly shameful and incredibly frustrating.\n\nAs a matter of principal, I am tempted to cancelled my claims and cut all ties with this arrogant airline."
  },
  {
    "reviewDescription": "Took flight BA2064 from Mauritius to Gatwick on Friday 11 August. Whilst walking over to the check in counter in Mauritius, the lady by the name of Joyce gave me the biggest smile and was so kind and courteous, it was the beginning of a totally wonderful experience. All the staff were helpful and respectful and it was a thoroughly enjoyable flight. Looking forward to flying with BA again on my way back. Also have internal flights to Venice and Denmark booked with BA too.\n\nMrs. F. Joomun"
  },
  {
    "reviewDescription": "Complaints ref : 24324517, 24329420, 24338740\n\n\nI am writing to express my extreme dissatisfaction with the service I received from British Airways on 22nd January 2023, when I traveled from Dubai to London Gatwick Unfortunately, my luggage was delayed and did not arrive with me at the airport. Despite making several attempts to contact your customer service team and sending multiple emails, I have not received any response or assistance in retrieving my luggage.\nAs you can imagine, the delay of my luggage has caused significant inconvenience and stress during my trip. I had important items in my luggage that I needed for my travel and business purposes. The lack of response from your customer service team only adds to my frustration and disappointment with the entire experience.\nFurthermore, I was extremely disappointed with the behavior of your staff members. I found them to be unprofessional, rude and unhelpful. On several occasions, they hung up on my calls and failed to provide me with any information regarding my delayed luggage.\nWhen I brought this issue to their attention, I was accused of being racist, which is completely unacceptable. I simply compared the service I received from the Indian call center to the service I have received in the UK, and found that the service provided by the Indian call centre staff fell short. In fact, they accused me of being racist. This is offensive and untrue. Let me make myself very clear. I take this allegations incredibly seriously\nI expect British Airways to take responsibility and failing to look at my complaint within a reasonable timeframe and for the delay and provide prompt and satisfactory resolution to this issue. I am also looking for British Airways to take responsibility for compensating me for the inconvenience and stress caused by the delayed luggage and the unprofessional conduct of your staff.\n\nMy advice to anyone who wants to travel with British Airways in the future is to avoid like the plague."
  },
  {
    "reviewDescription": "Came here to write a one star review, and I'm not surprised in the slightest to see a horrifically poor rating for British Airways. It's so low, the kind of low you see for scam websites.\n\nMy first and last experience is due to the fact that they cancelled our flights that were due to depart on Boxing Day. They gave us no alternative carriers that we could fly with. I had to get a refund and fly with a different operator. With it being so much closer to Christmas we had to pay £2000 extra for our flights.\n\nI started a complaint with BA but have been effectively ignored. Completed ghosted. I shall be complaining externally about this terrible organisation but either way, I'll never travel with them again. I hope they go bust."
  },
  {
    "reviewDescription": "Flight was cancelled about 15-20 minutes before boarding due to “pilot sickness”. BA must have been aware earlier as we were told at least 30 minutes earlier by friends who had checked in for an Air France flight. Poor that they knew before us.\nCheck in for the rescheduled flight the following morning was extremely slow and we still hadn’t dropped our bags before the scheduled departure time, which fortunately was delayed by another hour.\nEventually had to run to the gate and had no time for breakfast or even a drink.\nBA have refused compensation for the delay claiming it was extraordinary circumstances.\nSo far the other members of our party are still awaiting a decision.\nThis was our second experience with a cancelled BA flight in 6 months and communication in both cases has been very poor."
  },
  {
    "reviewDescription": "I bought the tickets for a trip to Spain and I made a change for the date on the same date due to the personal issue. I found that BA commits to have a full refund for cancellation in 24 hours after booking, so I did that, however after 7 days, I can only see the refund for the tickets but not the amendment fee, which is £200. I called to their customer service and wrote to their customer relations, and they just said they can't help. They just broke their promise."
  },
  {
    "reviewDescription": "Avoid British Airways at all costs!!! They are rubbish, they may have been good once and are trying to live off that reputation but they are awful. The rudest most useless costumer service I have ever encountered. Booked and paid for seats so myself and my disabled companion could sit together but when doing online check in noticed the seats had been changed and we were separated, as this was not an option for us, I desperately called BA customer services, what a joke! Rude is an understatement, was told they have the right to change seats at any time and there was nothing they could do. I explained we had to sit together, was told to speak to someone at the airport. Again no help. Left standing at the entrance of the plane with a disabled passenger while I had to try and resolve this awful situation. Luckily I asked a passenger if he would move so we could sit together. And this was business class travel!!!! When I complained to BA their response was disgusting and shocking. Let me add it took 5 months for them to respond. Their inclusion and treatment of disabled people needs to be addressed as it is non-existent. I will never fly with BA again and will warn everyone else I know of how rubbish they are. Have also been advised that they are under no legal obligation to compensate us for the distress and suffering we experienced as we did actually fly. What happened to customer service and goodwill. Something BA no nothing about."
  },
  {
    "reviewDescription": "Customer service is non existent\n\nI had an incredibly poor experience in August 2023 where I had paid for 'club Europe' as I have two disabled children and thought it would be easier for me to travel as a single parent. During the flight, the staff kept overlooking our needs and treated us incredibly poorly. After raising a complaint with BA, they closed it without reaching a solution. 8 months and multiple chasers later, still no response or resolution. I have a booking with BA in the coming weeks. After that, I will never fly with them again."
  },
  {
    "reviewDescription": "BA wouldn't allow me to check in online or at the kiosk at Heathrow. So I had to queue for 2 hours with just hand luggage to be told that \"we always overbook the flight so there are no seats left\".\nMany customers complaining but staff get it every day so are immune and simply don't care. A supervisor walked away mid-sentence and had no interest. They hand out complaint cards like confetti."
  },
  {
    "reviewDescription": "i bought a return ticket direct to bangkok return over 2 years ago and just want to cash in my voucher or get a flight to thailand .ba have no flights to thailand which is not my fault,i payed for this service in good faith and can not get my money back .i have made calls to them and they said book a ticket through a different airline and use my voucher . all i need is a 1 way flight from thailand to uk as i have a return flight to thailand already through a different airline. i found a flight for £544 and as my voucher is £510 thought fine so called ba to redeem money of price and hey ho they said as you are flying with a different airline the total price is £924. 1 way non direct, so infact i will have to pay £414. which is really a normal price 1 way anyway,,, so no saving whatsoever really. i am disappointed in ba and would like to get my money back.eugene jones"
  },
  {
    "reviewDescription": "Cancelled a flight within 4 weeks notice after I had booked a hire car, hotels, airport parking etc. We had been automatically offered a worse flight cutting our trip short and meaning having to drive 2 hours to the airport at 2am in the morning.\n\nCustomer service awful, the website doesn't work to self-cancel my booking, phone lines cut off when they're too busy saying call back later they can't deal with any more calls.\n\nCustomer service staff generally unhelpful and clearly not enjoying their jobs. I wanted a full cash refund after BA cancelled the flight so I could pay for new flights. They would only return it back to a voucher we used due to covid cancelled flights and could only go back to original payment method of the booking. We originally paid in cash so demanded it goes back in cash rather than voucher but alas British Airways want to try everything to hold onto my money.\n\nCan't believe they used to be one of the best rated services in aviation and the UK - how has a company like this gone so downhill, awful service, bad customer service.\n\nI remember now why I always try to avoid BA where possible."
  },
  {
    "reviewDescription": "Booked flights from Heathrow with BA. Received confirmation emails stating Heathrow Terminal 3. I subsequently booked parking for T3.\nNearer the time of my flights I happened to check my booking. By accident I noticed that the departure and arrival terminal stated T5. I had received no notification of any terminal change from BA.\nAs this was now nearer my flight time, equivalent parking was significantly more expensive.\nI contacted BA by chat to raise this issue. The agent tried to tell me that the terminal was always due to be T5, until I shared the confirmation email with him. He then insisted that if there had been a terminal change I would have been informed by email inferring that it was my fault. This was categorically not the case.\nI asked for 2 things. firstly to receive compensation for the increased cost of parking and secondly to escalate this issue to ensure all other passengers received notification of the change of terminal so they do not arrive at the wrong terminal for their flights. He tol me he could not help with this and I would have to submit an online complain and sent me a link to do this.\nI duly completed the online form and submitted, only to get a response saying they could not aggress this issue and I need to call customer service.\nI called customer service only to be told to complete the same online form.\nWhen I asked to escalate the issue to someone who could help me, the agent disconnected the call.\nBA are clearly no longer interested in providing any level of customer service. Such a shame they have joined the race to the bottom and are now competing with Ryan Air rather than premium airlines."
  },
  {
    "reviewDescription": "On our recent trip from Gatwick to Tampa, we were on a very old not updated plane which meant uncomfortable seating, poor entertainment, condensation dripping out of the moldy light fittings, trays that were so crooked and loose it was tricky to put the disgusting meal on there to look at and decide that I definitely was not going to eat it.\nOverall, the flight out was on time so that was a positive, however the flight back was delayed by several hours and it took personnel some time to be sent to the gate to manage the delayed passengers.\nOne issue of this delay is that the vouchers that were issued would not have got any food, unless you want a bag of \"chips\" or a drink and no place in the departure area would accept the vouchers anyway.\nThe crew on the flight are your only saving grace as they were polite and efficient, I think you need to look more closely at maintenance of your aircraft, lot's of the issues I saw were purely light maintenance issues and could easily be resolved.\nLeaving these tasks to build up and not dealing with them in a timely manner leads to more and more issues building up until it becomes a huge number of maintenance issues."
  },
  {
    "reviewDescription": "Absolutely appalled by the service and follow up. This company was once the flagship of airways. 8 weeks ago, On a family return flight from Orlando, I was downgraded from a Business class seat I had paid for 12 months previously, I was told by the check-in desk clerk that I was selected because of an algorithm, that chose me as the lowest value passenger in business class, even though i had 6 members of my family all flying with me for what was to be a memorable holiday of a lifetime, well we will certainly remember the flight and the comment. The onboard staff were very apologetic, even the Captain could not believe what had been said, the senior stewardess sent an email, which I saw, to the service management, I was told someone would contact me, well guess what, 8 weeks later, and despite trying to speak to someone- NOTHING!!!!!- So I eventually called the help desk number, after waiting for over an hour, I was shocked when he said, \" you have to appreciate, we get THOUSANDS OF COMPLAINTS EVERY DAY' it will take time- BA, you have a serious problem. At the very least, you owe me an apology......\nYou Cannot call the service team, the online chat is useless, AND if you do manage to speak to anyone but the service team, they are not interested"
  },
  {
    "reviewDescription": "80 yr old parents booked flights and crucially exit row seats in March for a September departure. 4 hours before flights BA txt to say flight is cancelled. Call them and they say flight is bumped 24hrs and everything is the same (incl booked exit row seats). Go to check in and they haven’t got their exit row seats on the new flight. Multiple calls to CS fruitless. CS just want to get you off the phone and give out false information (no one over 60 can go in a exit row seat they tell us. What did they accept the original exit row seat reservation then ?!).\n\nI’d heard BA were circling the drain - seems it is true as borne out by their woeful rating here. Never again BA."
  },
  {
    "reviewDescription": "Disgusting! How the mighty have fallen! Our flight was delayed by 12 hours to America and we had to pay for overnight accommodation. We put a claim in for the delay and also for the accommodation. there has been no acknowledgement of our claim. We have tried to contact them. There are no contact details. No email addresses and you are sent round in circles by either bots or people who tell you you will be contacted! We have waited several weeks and heard nothing. It seems to us that it is just a scam now and they will not process your claim. British Airways you are now a dreadful unreliable disgraceful company and we will not fly with you again."
  },
  {
    "reviewDescription": "What a star Yee (Holidays team in Newcastle Office) has been. My husband has a disability and she was so helpful and went above and beyond for us to make sure our journey to the USA was as comfortable as possible. Thank you so much again Yee for all your help 😎Michelle Keen"
  },
  {
    "reviewDescription": "Not only did my daughters flight from Houston to Heathrow get cancelled she then had to wait till the next day to get a flight, losing a day of her precious holiday. I am waiting at Heathrow and her plane couldn’t get near terminal 5 so she has been dumped somewhere else and been put on a bus. Her baggage is still to arrive. The plane was 45 minutes late so the cost of parking for me is astronomical. DONT USE BRITISH AIRWAYS. They are an abysmal service. Shame on you BA."
  },
  {
    "reviewDescription": "Slow, cumbersome app that has the word customer journey experience. Try changing seats or paying! Be prepared to be aghast in 2023 with an airline flying planes but unable to get an app to work properly"
  },
  {
    "reviewDescription": "SO awful - noone can help you, you get passed around, you can't understand the people and they can't understand you. They can't seem to help with basic queries. AWFUL!\nI normally refuse to fly BA and this is a reminded why."
  },
  {
    "reviewDescription": "My flight from Mumbai on 30th Jan 2023 was cancelled on the advice of the BA check-in counter I was told I could purchase a ticket with Air India and submit the expenses online . I had to PAY my credit card by March 5th 2023 it's been already 8 weeks since I applied for the refund\n\n\nFor genuine reasons it was not possible to wait at the airport or find accommodation at 1am in the night in Mumbai for my safety and security\nBA did not make any arrangements or give out vouchers at the check-in counters nor provide the fare for alternative airlines at the check-in counters\n\nThe experience was harrowing at the airport and now the experience continues in getting the refunds\n\nI was flying from another city Baroda to Mumbai and then to Heathrow. Earlier we were given a msg if a four hour delay when I landed at Mumbai and got to the BA check in counter we got a typed Letter saying the flight is cancelled for 24 hours!!\n\nCan I please share this feedback and receive my refund nonetheless our confidence and loyalty with BA is thoroughly shaken with the services and customer care\nI must get my refund urgently I had booked a premier economy flight and paid a lot of money towards the fare but returned economy class on AI and with no provisions from BA!"
  },
  {
    "reviewDescription": "You would think that if you had booked a holiday with your partner, so two seats, they would manage to assign you two seats together. But no, apparently that is not what you get, so for a 9 hour flight to our annual holiday I don't even get to sit next to my partner. Totally unacceptable."
  },
  {
    "reviewDescription": "We've got return tickets to Amsterdam from London. As it's a short journey we only went with the cabin luggages. First of all they didn't allow us to make an online check in in both flights. So we had to do it at the airport. When we went there they said the flight is too crowded so it's not certain you will have seats. We would learn it at the gate. I can understand that for one flight but it happened in both. Luckily we.got two random seats. But this time we are not allowed to bring cabin luggage... Also we are not allowed to put our thick coats to the compartment and.we have to carry them in our hands. End to end a ridiculous flight. I wouls prefer Ryan air to British airways. At least they tell you what you need to do.."
  },
  {
    "reviewDescription": "1.3 is poor by any measure. I've not been spoken to before like I was today by a stewardess at the back of BA 2643 from Málaga. We were instructed, not asked, to place bags that we'd flown over with under the seats, not in the overhead lockers. Then watched while she ignored other passengers placing similar bags in the lockers without intervening. She said \"I'll just let them all do it and they can have a 2 hour delay. See how they like that\". How grossly unprofessional. BA used to be a quality operator. Now they are just an expensive bucket shop operator with rude staff. That's on top of the hour delay. Never again."
  },
  {
    "reviewDescription": "I boked a flight from AMS to LGW less than 2 hours before the flight. We finally boarded the 21.25 flight at 23.00. Once shut in the plane with no ac running we were informed we would be 90 minutes before departure. This was due to air traffic control issues in the UK (resolved a full 5 days previously). Finally arrived at LGW after midnight to find no one available to operate a land bridge! Obviously by this time all public transport finished as well. Thanks for making what should be a 45 minute hop home into a 5 hour performance. Even Rynair and Easyjet put you to shame."
  },
  {
    "reviewDescription": "Always helpful my booking was sorted efficiently and quickly. Absolutely no hesitation in booking with them in future. Claire Metcalfe was so helpful and meticulous a real treasure for BA customer service."
  },
  {
    "reviewDescription": "Took a flight from London to Istanbul. Its a 3 hrs 30 mins journey. Paid around £550 per person. Was offered 25g potato crisps and a small bottle of water as food."
  },
  {
    "reviewDescription": "Returning from Sydney the leg from Singapore had no menus or amenity bags in Business or First class.\nSingapore BA food has a poor reputation but the crew not working from menus made things a lot worse.\nThe new 777 Business seat with sliding door was very pleasant, but poor food and almost no bar service made the high price crazy value."
  },
  {
    "reviewDescription": "A truly feeble company.\n\nIn addition to the appalling service, poor recognition of a delay and 3 months to reply to a refund request it was refused, when the asked to speak to someone the first line from from customers services was ‘ we don’t call people’. And this was with a business class ticket. What an embarrassment of a company to bear the word British.\n\nPathetic. Why would anyone choose to spend money on BA if there is an option to fly with anyone else ?"
  },
  {
    "reviewDescription": "Logged a missing baggage claim. After I contacted several numbers and finally got through to Heathrow, a guy found it for us and passed it onto BA to divert up to Manchester which is where it should have originally got to. BA sent tracking confirmed it's on a flight. I tracked the flight only to receive another email shortly after than flight had landed confirming it was now on a later flight.\nTrying to get through to baggage line on 03444930785, an automated message asks for the reason for the call. Whether you use the word \"luggage\" or \"baggage\" you get through to an overflow team who can't do anything and whose instructions are to keep trying the same line to hopefully eventually get through to everyone. 12 attempts later, still no luck.\nWhat sort of customer service is this? I can't believe the incompetence of this company. I have absolutely no idea if I'll ever get the suitcase back or when."
  },
  {
    "reviewDescription": "I travelled Heathrow to San Diego in August 2024. Having had my 2nd hip replacement in January 24 I opted to pay to upgrade to premium economy, to ensure I was comfortable.\nHowever on my return leg, having checked in online and being issued with a printed boarding pass at check-in, I was called to the desk at the gate, about 15 minutes prior to boarding and\nwas handed another boarding pass with no explanation at all, when I asked what was going on, I was advised that I had been “involuntarily downgraded”.\nThere was a fellow passenger in the same position who had only days before had a cast removed from her broken wrist.\nThe ground staff were frankly rude and uninformative, we were told she could give us customer service number but that it was unlikely that we’d get any resolution (how right she was)!\nWe were offered no alternative and given no advice or instruction on the ground as to how to claim a refund/compensation.\nWe were left with no alternative but to board.\nI approached the individual who was sitting in the seat I was originally assigned, and asked when they had purchased their ticket. She said a couple of months which would put it around July, I had purchased my ticket in the March.\nWhilst waiting to take off I went onto the BA site and found the complaint form which I completed straight away.\nIt is now 18 weeks later and the matter is still not resolved, I am merely asking for a refund of the price difference of economy vs premium economy for the return leg of my flight, seems more than reasonable to me, I’m not even asking for any compensation for the appalling way the whole situation has been handled to date.\nIt originally took a week or 2 to get a response, which was to offer me an £100 evoucher, and a thanks for the feedback which is apparently invaluable (particularly to me) and assurances that they would endeavour to do better in future!\nI clearly and simply further stated my case for a refund and refused the evoucher as unnacceptable, at which point I was offered a £75 cash equivalent. I again “politely” declined and again requested my money to be refunded, I was advised by “customer service” (I obviously use this term loosely, hence the speech marks) that my case has now been referred to the refunds team. Progress you may think, but a further almost 6 weeks on, they still have my money.\nAt almost every point I have had to chase them for a response.\nMy advise DO NOT CHOOSE BA IF YOU CAN AVOID IT.\nThere trustpilot score is abysmal for a reason, in an industry where customer focus should be front and centre BA have none to speak of."
  },
  {
    "reviewDescription": "Flight cancelled very reluctant to help\nPeople on the phone are usless\nNo response from claims department aven after 2 weeks\nShambles won't ever be booking flights with BA again on par or worse than easyjet"
  },
  {
    "reviewDescription": "Bitterly disappointed that I can not choose my seat on booking even though business class…..\nHave to wait till 24 hours before travel and take what available\nNever travelled long haul alone which is why I spent a lot to go business - what’s the point???!!"
  },
  {
    "reviewDescription": "Appalling customer service.\nCancelled our original flight & put us on an alternative service 8hrs later. Unfortunately this meant we will miss our connection & have a long wait at LHR. As a result one of our party can't travel.\nBA refuse to amend passenger details & want over £800 for a new booking for an alternative family member to travel.\nAt least Dick Turpin wore a mask. Will never use them again."
  },
  {
    "reviewDescription": "I have been trying to deal with BA customer services for weeks via post, email and phone. I will not go into the actual issue its very long winded and concerns companion tickets and avios.\nI don't think they are even trying to see my point of view and just keep repeating the same rhetoric. I will be getting rid of my BA AMEX card because of the experience I have had and will not fly with them again. They can be very arrogant."
  },
  {
    "reviewDescription": "Cancelled a lunchtime return flight that would have got me home at a sensible time. OK, it happens, I accepted the evening flight. Arrived at the airport, flight delayed by an hour. OK it happens. Finally boarded, the pilot sounding pretty p'd off as he announced the reason for the delay was ba had the plane sitting at the wrong terminal at Heathrow since the previous evening and nobody had noticed. Landed an hour late. Nobody had told the ground crews so there was no stand for the plane. Eventually out of the airport an hour and a half later than the expected arrival, having missed all the trains I had valid ticket for so a 2 hour wait for a coach to get home which will be sometime around 3am. Oh and they've slashed the onboard tea and coffee. You get a bottle of water and junk food snack. The staff on the flight were lovely but the company seems to have no interest in meeting even low expectations."
  },
  {
    "reviewDescription": "In January 2022 my flight from Bangkok to Heathrow was cancelled and I was booked on a Qatar flight which meant a change at Dohar and I was not given premium economy on Qatar, which I had paid.\n\nI tried to get a refund for the difference between economy and premium economy and to make a claim for the statutory delay compensation from BA, but was advised by BA to claim it through the booking agent. I went to the booking agent, who ignored my request for a refund of the difference\n\nThe booking agent ignored my requests and I eventually submitted a claim through the small claims court, which got me the price difference but the judge told me that the statutory amount has to claimed from BA\n\nI have since tried to claim the statutory amount but my attempts have been met with silence\n\nBA please let me have a phone number or email address through which I can start a sensible dialogue. In the meantime does anyone have a phone number for BA? It appears that is the only way I will get the amount due.\n\nThanks"
  },
  {
    "reviewDescription": "What scam merchants these people are. They give you a voucher then try and charge you twice as much for the flight you originally paid for. I've lost around £11k because I can no longer afford their prices. The value of my voucher, that represented the cost of the whole of my journey, now barely covers half of it.\nWhat a rip off."
  },
  {
    "reviewDescription": "Yesterday I traveled again with British Airways and I made the same mistake again. first point again we traveled an hour late then when waiting for my baggage it didn't arrive i went to complain to bristish airways authorized staff they simply made me fill out a form and then told someone to contact me later Three days. then I rightly asked for a refund it's a waste of time an year they said I have to have the receipts otherwise they can't do anything most of the things were of a family affective value how can I produce receipts . plus I also missed the bus I was supposed to take and I had to call a friend of mine to come and pick me up. they made me have a worst but and disappointed day because of you, this also happened in the first leg when I had so many problems and I also made a complaint without getting an answer. this is not right because I wasted time, days and a lot of money. however I will not travel with you again and I hope no one will travel with you again"
  },
  {
    "reviewDescription": "We have tried to be loyal to BA and appreciate that many of its staff members do their best. However, that loyalty is being sorely tested.\nWe were caught up in the T5 baggage shambles last Tuesday, and there was little help and only much delayed announcements about the situation.\n\nThe person collecting us paid exorbitant parking fees to the Heathrow monopoly while waiting - no chance of a refund from BA though.\n\nEventually, we left with no bag. We were advised two days later that it had been transferred to ecourierair. That company has had the bag for FIVE days and we only live half an hour from Heathrow!\n\nIt is impossible to get any response from ecourierair which is disgraceful. Why is BA using such a useless company - it doesn't reflect well on them. Or, having passed the bag to another company, maybe they don't care anymore?"
  },
  {
    "reviewDescription": "The customer service is terrible - I tried to call multiple times and couldn't get through to an agent, the line kept hanging up on me as they were experiencing high volumes. As my flight was cancelled, this made everything extremely difficult and left me in the worst situation. I finally got through to an agent, after speaking with them for almost an hour, the line randomly hung up and I got no call back?! This is the worst customer service I've ever experienced and now I'm unable to place a call back again as the lines are full. DO BETTER!!!!!"
  },
  {
    "reviewDescription": "Judging by your score, you care nothing for passengers or your commitment to them. Once again I have been forced to check in my cabin bag to make sure that priority customers have enough room. Allowing passengers to then speedy board is a nonsense when all 6 groups of non priority passengers had to give their luggage in. More so that this saves 5 minutes and not the 20 I’ll spend the other side waiting for my bag. That’s six out of the nine groups. Frankly this is incompetence on a grand scale and must be bordering on fraudulent behaviour. No doubt I will not receive a reply but I will certainly be writing to the CAA. I will also be writing to our travel provider Egencia suggesting they put a warning on their site that if you want to be sure of being able to have the convenience of keeping you cabin bag with you then choose one of the other airlines and pay for the privilege which in many cases is still cheaper than BA. I will not use you again for business or personal purposes."
  },
  {
    "reviewDescription": "I have flown with British airways as my preferred airline for 40 years.\nThey have deteriorated over the years and the customer service is worse than budget airlines.\nI have tried to contact BA since November you can’t get through.\nIn a desperate bid to contact someone I emailed ceo Sean Doyle who didn’t value my customer and passed it on to someone else with no satisfactory resolution."
  },
  {
    "reviewDescription": "Review of BA app which does not work .....\nWill not let me log in. Useless. I am sure my login details are correct, I restarted iphone, re-downloaded the app several times, cleared data from cache all to no avail. Budget airlines manage to have working app's! BA???? really?"
  },
  {
    "reviewDescription": "The flight took off pretty much on time which is very good.\nHowever, you seem to have replaced people with machines. We need people to efficiently deal with issues at airports and people need jobs. Hire people and get rid of the machines. Don’t be greedy.\nAlso, you should offer people a proper meal during flights. A flight that took almost 5 hours and all people got was a bottle of water (250ml) and a cookie/biscuit. Then, food and drinks were sold to people because they had not paid enough for the tickets. The couple next to me paid £6 for two (paper) cups of tea. There is nothing to read or watch either. Again: don’t be greedy. People do not pay hundreds just to see the bosses’ pockets get bigger. Give them their money’s worth!"
  },
  {
    "reviewDescription": "It is unbelievable what the British Airways has deteriorated to. They had cancelled my flight a month ago, and have been withholding the refund. The email notification provided a single phone number on which to call asking for a refund. For a month, I had been trying to contact them via every possible route (including making a complaint), and no-one was replying... Today, finally, they picked up the phone and redirected me to Opodo for a refund (why not to simply mention this in the email to avoid wasting peoples' time?) Having spoken to Opodo, they had no idea about the cancellation, as BA had not notified them about it. Please, BA, look into your procedures, it feels like there is something seriously wrong on many levels. UPDATE: It is October now, and I still have not received my refund. I received an email from them, written in such poor English that I could hardly understand it, saying they had processed the refund. But no, after 14 days, I STILL have not received it! Back to square one—it feels like a scam at this stage."
  },
  {
    "reviewDescription": "British Airways flight BA2157, was delayed by a full day. I was given very little information whether to attend the airport on the scheduled time or to remain at home. After speaking to 3 different customer service representatives giving me totally different instructions, I was told 2 hours after my scheduled departure time “You should be at the airport”. After Rushing to the airport, to be told on arrival “Go home, your flight is tomorrow”. I felt forced to book a nearby hotel, to be close. Due to the lack of information being given, I did not feel British Airways was competent enough to deal with the situation nor know how to make their customers feel valued.\n\nif British Airways are going to update their customers about delays and cancellations by email. They should be a lot more detailed than the ones they currently send.\n\nReasons for the delay if possible.\nInstructions whether to attend the airport at scheduled time, and if not what time they should arrive.\nWhat is available at the airport to assist people while they are inconvenienced."
  },
  {
    "reviewDescription": "Truly appalling customer service. Argumentative, wrong information, overcharged me for 'special' service to hold a booking, on hold several times for very long periods, interruptive, obstructive and altogether difficult. Booking a flight should never be this unpleasant."
  },
  {
    "reviewDescription": "Flight cancelled. After waiting 40 minutes for them to answer the phone I was told I was allowed to rebook “free of charge”!\n\nHow kind of them not to charge me to rebook a flight they just cancelled leaving me stranded.\n\nNo compensation for all the extra costs incurred because “we gave you free rebooking” - I’m going to miss my meeting because of there mess up\n\nWorse customer service like talking to to a robot they just fob you off !\n\nSo disappointing we’re not getting on our flight and only found out at check in"
  },
  {
    "reviewDescription": "Arrived at the airport to be told flight was cancelled, told by staff “haven’t I checked my email?” Yes but no email received, same for another customer stood next to me. Rebooked for the day after with a worse time connecting flight. Flights themselves were OK. Arrived at final destination with wife and sons cases missing, staff said cases didn’t transfer from connecting flight, mine was OK so maybe told that to get us to leave, given a form with a link to the online claims page and complete that. Now waiting to find out what’s happening apparently they are trying to locate missing bags. Now having to buy emergency clothes, toiletries etc in the hope the bags turn up. Trip is ruined and wasting days due to BA incompetence."
  },
  {
    "reviewDescription": "This used to be such a good airline. So I was economy but serving cold califlower for breakfast. I was so looking forward to breakfast after an evening meal of 4 pieces of corgette that I didn't touch and a pudding that was so awful I spat into tissue and a dry rice cracker that was stale. £1000 flight and my 8th flight this year. Its just getting worse and worse.\n\nThere is no point telling customers services because you ignored my last complaint where I was threatened by a member of staff."
  },
  {
    "reviewDescription": "If I could I would give the Bordeuax airport and BA a solid - 5. My flight with BA was delayed 2 hours to midnight to London. At the drop-bag area, a BA staff's tone was rude and unfriendly when communicating with me, and she was so unhelpful with giving information that was supposed to be her responsibility. I was given a 6 euro voucher as compensation for the 2 hours delay (Maybe she thought I should be grateful for 6 euro compensation for the 2 hours of my life) and when I got through the security line all shops were closed so I could not even use the voucher. (Yet, the staff could have said something about the closing time there but she DIDN'T). During these 2 hours I hoped to work on my computer for my work the next day but the internet was as bad as the whole situation.\n\nI was going through a bad experience and will get home at 5am in the morning but the BA staff acted like she got more things to deal with and all shops at the Bordeaux airport were more impatient to stay longer to serve us. The combination of the BA and the Bordeaux airport service had not \"Turned Dreams Into Plans\" but \"Turn Dreams Into Nightmares\"."
  },
  {
    "reviewDescription": "Had the worst experience ever. The flight was 40 mins delayed and we needed to get on a connecting flight in Doha. We waited and waited for a wheelchair. After not getting 1 as requested. We ended up walking to our gate and missing the flight. While all the time the staff were aware we were going to miss it if they didn’t hurry up. We ended up missing the flight and reached after 7 hours. Without and help or support with my disabled mother. What atrocious service I have ever received."
  },
  {
    "reviewDescription": "I am disabled and unable to work due to many health conditions that started getting diagnosed about 11 years ago. I’ve saved Avios Points from the start and Airmiles before that. On their BA Rewards App you can earn extra Avios Points by shopping with their recognised partners and in January I booked 2 return flights for 2 passengers and I paid for them as I didn’t have enough Avios Points at that time and also the price was ok as I booked them in their January sale and I know that I won’t get the Avios Points for them until after the flights but I also booked an Airbnb apartment to go with each flight booking and I should have received the Avios Points for that not longer after paying the full amount but now even months later I’ve still not received any Avios Points for them despite me sending emails, sending in at least 3 missing Avios Points forms and at least 3 complaints forms which have been acknowledged but then never responded to. I’ve even rang them and must have spoken to almost every department that I could have eg this afternoon I spent over 4 hours on the phone and spoke to 5 different agents and was on the phone to the last agent for the longest and he was just telling me lies and I asked to talk to a manager and he refused to transfer my call to a manager saying that they would just say the same as he’s said! Another company really needs to set up a good alternative to Avios Points where you can save up your points and pay for your flights as Avios isn’t as generous as Airmiles used to be anyway. But if anyone knows a telephone number for a manager in their complaints department if they could please put it on here as this has already taken up so much of my time and effort and I feel as if I’ve not got anywhere! Also the last agent that I spoke to claimed not to have any access to email and he also denied being able to see the entries that I can see on my Avios statement and so he’s obviously a liar too! I agree with all of the other statements from others that say that the customer service from BA has completely gone!"
  },
  {
    "reviewDescription": "Never fly business or first class with BA. The staff are new, inexperienced and lacking any knowledge of how to work with first class passengers - appalling in every way. I've flown BA for over 30 years and have now switched over to Air France. Terrible shame."
  },
  {
    "reviewDescription": "Following on from my damning comments I today got a message from Opodo that BA are refunding me for their cancelled flight from Manchester to Heathrow in OCTOBER. they claimed I had used my ticket they claimed I had flown to Venice where I have not been since 1967. I spent hours trying to sort this. Did BA have the decency to apologise for their ridiculous errors OF COURSE NOT I have had no direct contact. If a bank had treated me this way they would have apologised and I estimate would have paid me at least £75 compensation for wasted time and distress. There is more to come from me the matter is still not resolved and their treatment of me and my infirm travelling companion has not been addressed by them on any way except by saying your comments will help us improve in plain English that means go away we are not really going to do anything or accept fault"
  },
  {
    "reviewDescription": "Being a loyal BA customer for years. Travelling a lot with them so i have Silver membership that they decided to downgrade to Bronze, although i've been signing up all my miles.\n\nCalled the Customer Service or help. The asked me to email all my flights & then upload them to their website which i did.\n\nThat was a month ago. Never heard from them again. I'm surprised with the audacity of the company & just how careless they are about their members.\\\n\nNever again with BA, only Swiss from now on."
  },
  {
    "reviewDescription": "Just returned from Rio de Janeiro on BA0248 on a Boeing 777 jet. We were packed in like sardines on an 11 hour flight.\n\nThe flight attendants were excellent.\n\nWhoever, thought packing customers into a Boeing 777 for an 11 hour flight, obviously wasn’t thinking about the customer experience. They no doubt had cost on their mind.\n\nAvoid Boeing 777 aircraft’s for long haul. In fact avoid these planes as the experience in economy is so bad. They should call the plane, The Boeing Sardine Container."
  },
  {
    "reviewDescription": "Plane was fine albeit a broken toilet in economy class that caused some issues as would not let passengers use first class toilets.\n\nThe problem with BA is the actual service. To be offered 1 drink on a 12 hour flight is a joke. Cabin care tucked themselves away nicely in the back and drew the curtains for most of the flight. Staff uniforms are tacky and poor fitting. I really think BA needs to learn from Qatar and Emirates as BA is honestly years behind."
  },
  {
    "reviewDescription": "My Honest Reviews are based on exactly what happened not how I felt or my opinion\nso you can fairly judge for yourself.\n\nFeel free to place in order which you think is fairly bad to worse.\n\nFlying from England to Brisbane AU (CHARGER INPUT DIDNT WORK)\n\nOnce landed in sydney for my connecting flight, I was informed i'm not on it and to find the british airways desk. (THEY DIRECTED ME TO A LOCTION WHAT WAS NOT IT THEN 2 OTHER STAFF DIRECTED ME TO 2 DIFFERENT LOCATIONS WHAT WAS NOT IT.)\nThe Help desk took me to the right location to then see its actually closed as a normal procedure every day and open in the next 5hours.\n\nThe help desk the walked me back to the flight I was meant to be on to Brisbane on all the way to the orginal terminal I was already at, to say I have to board it before it leaves as my ticket shows it has to be this flight. They did a longer search to find out i am meant to be on it but (BRITISH AIRWAYS DIDNT INFORM JETSTAR) so they let me on a later flight instead of my orignal one.\n\nI contacted british airways during my holiday in australia over email, to then recieve £50 voucher (WHAT WAS VALID FOR 1 DAY WHAT WAS NOT MY RETURN FLIGHT DAY)\nI emailed back asking why its not dated for my return as i'm not flying anywhere for this date you gave the voucher for...Up to today i'm still waiting for a email reply.\n\nPicture Proof attcahed of the email.\n\nDuring that covid December when all flights got canceled, I was creditded the value of the flight to be used up to September, It was done through a 3rd party company (THAT TOOK THEIR TIME TO GET A EVOUCHER FROM THE AIRLINE TO GIVE TO ME, BRITISH AWAYS DIDNT WANT TO ACT ON IT WHEN I CONTACTED THEM WITH THE RIGHT DETAILS, THEY WANTED TO HEAR IT FROM THE 3RD PARTY COMPANY FIRST)\n\nThen it was to late, (I LOST OUT ON £470).\n\n"
  },
  {
    "reviewDescription": "I wish there was an option, to give no stars. The Airline is failing terribly. Paid £1200 for an over booked flight, which we had booked 5 weeks in advance. Only to be told at check in that there is No seat, and a set will be allocated at the gate. Luggage was left in the UK,. 1 week without my clothes. The plane was worse than a low budget airline. SAVE YOUR MONEY USE ANOTHER AIRLINE"
  },
  {
    "reviewDescription": "Absolutely dreadful flight with them. Paid extra for an exit seat then get told there was no entertainment system in that seat. I asked to be relocated and they said there were no empty seats. I then asked them to upgrade me to the next class as I saw there were seats available. They said they did not have the authority to do that so I sent the next 13 hours staring into space.\nOld aeroplane, un-acommodating and uncaring staff, terrible food.\nFor the UK's flagship carrier I would have expected better. Will never fly with them again!"
  },
  {
    "reviewDescription": "I’ve flown with Ba not had any issues until the uk lockdown in feb 2021, as a uk passport holder i wasn’t allowed to leave the country for international travel so had to except an e voucher from Ba, I can’t believe Ba have refunded for the 2020 lockdowns flights but refused to refund for January to March 2021 flights my voucher is 2 years old next month and the flight was completed for other nationals who was allowed to leave the uk Ba are refusing to refund cash I know I have lost my money because due being high risk if I catch covid 19 I won’t be travelling for many years until it’s safe for me to do so. I hope Ba enjoy my money while spending it on jumpsuits for staff, they must have made millions off people who either can’t fly due to health or now being out priced with Ba over priced seats. Ba should rethink there policy not everyone can travel abroad if health is put at risk!! Wish I could give them 0 stars very unhelpful customer service."
  },
  {
    "reviewDescription": "Awful! First time using BA. Flew long haul on a grotty cramped plane. Service is minimal and you rarely see staff. Even water is a rarity with BA. Staff look over it and worn down. Travelling with my autistic son is difficult enough without him dying of thirst and sitting with his knees in his face. Never again!"
  },
  {
    "reviewDescription": "Just cancelled a flight to Heathrow from Glasgow, say to use manage my booking which won’t open the same day flight, as there are numerous flights to Heathrow from Glasgow on the same day which would allow me to connect to my flight to Washington. App won’t allow the same day as the flight to open. Helpline should be prosecuted under the trade description act as it’s NOT a help at all. After passing through a number of different options you are eventually cut off saying there is nobody available to answer your call. Hang your heads in shame BA. a disgrace from start to finish, well that would be if you could actually reach a conclusion."
  },
  {
    "reviewDescription": "I missed my flight to Kingston Jamaica. The BA airport staff asked me to contact their customer service to book a new flight as I still had a return on my booking. After a 20 min wait the customer overseas customer agent claimed he couldn’t hear me and disconnected the call. The problem was his end, most likely due to rerouting of the call overseas. An hour later I tried again, this time a 25 min wait. An incredibly rude customer services agent with the same overseas accent, (perhaps South Asian) but I’m not sure was abrasive and said book online. I tried to explain about wanting to incorporate my return flight but he was impatient, interrupted me and repeated his response, this time louder and more abrasive. I felt abused and distressed by these encounters. I’ve been a loyal customer for years with BA. There’s little choice on my direct flight route and the flights are not cheap, but I’m seriously thinking of changing to their competitor Virgin and travelling to Montego Bay instead of Kingston."
  },
  {
    "reviewDescription": "I really do not understand this. Booked a business class seat online with BA to Morocco in January for September travel Paid £502. Had to cancel the flight in June. Put in a claim and only got £85 back. It’s a joke. Before I put in for the refund, I was trying to find the terms and conditions but they do not make it easy. Why do they not provide a breakdown with deductions when they give you the refund? Seems, this is how they make their money. Will take my money elsewhere in the future."
  },
  {
    "reviewDescription": "I witnessed vile and heinous treatment by an airline company called British Airways at Heathrow Terminal 5. As I was seated next to my gate and the boarding was about to begin, an agent of the company who's badge stated ‘customer experience’ came up to my girlfriend and me and asked for my ticket’s group number (it was almost at the end of the aircraft, number 8). I will not disclose their name to avoid a lawsuit, but I will mention that the flight was to Aberdeen on the 15th of May 2023 at 21:00, flight number BA1318, gate A6. Then they did not inform nor advise with an apology but, by their tone, commanded that my cabin bags are to be put in the hoard as the plane was full AT NO EXTRA CHARGE?! Blimey, thank you very much for not making me pay you even more for this; let’s face it, scam. They then proceeded to passengers sitting next to me, enquiring the same question, the latter was in group 3, business class, and the agent told them their bags were safe. What kind of class shovenism is this?! In the 21st century?! I understand business class has its privileges and all; the website says they get a separate seat and an extra bag allowance. Nonetheless, it does not state that in case of a plane being fully booked, business class passengers will be treated with respect while everyone else will be treated as sloppy second peasants who were lucky enough that BA gave them an honour to get a plane at all and soil its interior with their poverty...for a low price of 300+ pounds. My money is as good as theirs; I could fly with EasyJet if I did not care for cabin luggage, but I chose BA because I thought my bag would be with me in the cabin. Moreover, with this money, I could have flown with EeasyJet and saved some extra. I mean, yes, people carry their laptops in cabin bags, but some carry fragile cargo; what if I had a set of porcelain gifted to me by my late grandmother? What then? We all know loaders do not care about the state of luggage, so every fragile item carried by my fellow passengers could have been destroyed. Overall profoundly disappointed in the company and customer service; the current BA is a disgrace to what it used to be and is heading towards a terrible future as a company. Of course, I understand this review will lead nowhere as the big people in charge of the Airline could not care less about the troubles of mere mortals, and there is no action for us to take here. Still, I urge you, the reader, to avoid the company if other options are available."
  },
  {
    "reviewDescription": "terrible customer service.. huge overhead for changing a flight. available flights are not shown and they limit your change options online.. these guys are just really terrible... 1 hour waiting on phone for someone to answer.... in contrast any other airline has no more than 5/10 mins waitiing time..just typical world's first service..."
  },
  {
    "reviewDescription": "I feel I am not alone anymore, seeing so many complaints here, knowing my experience with the airline probably somehow ''normal ish''. Last year, my husband and I excited to join the post-pandemic travel chaos while Heathrow cancelled tons of flights and queues at the airports were massive everywhere. Our trip was not far, only to Milan. They keep sending us flight was on schedule until last minute the flight was cancelled. Knowing not everyone lives in London, they redirected us to Gatwick next day, which not gangrenated would take off either. Not a single customer person to deal with the issue. By this point we paid car parking and it was not refundable once we in. Too much to loose if next day flight not going to take off so we cancelled the flight and drove home. There were many flights were not cancelled but I guess our flight was just not full enough so they chose us to cancel? It was very stressful to deal with hotel, tourist attraction ticketing cancellations. After all, we have been contacted BA filled the foams, waited several months before they got back to us. Answer was : ''not under their control. ''emmm...so not met their compensation claim''. So many months later, we still out of pocket and it was worst experience with them ever. ... BA can say pandemic caused everything, but there were many countries did much better job than us during that time. For example Italy. Ask if I'd still travel with them? I would avoid as much as possible, no more long hauls, other short trips, I would find alternatives where possible. I am sure they would not care for an individual like me."
  },
  {
    "reviewDescription": "Took a flight back in May still waiting for my Avios point - same story again and again - I will now loose my year points - how difficult is it to add some points - you cancelled the flight and put us on AA not our problem if this has buggered up the Sys - what a joke"
  },
  {
    "reviewDescription": "I hardly ever do reviews and I felt that I had to review the flight I took from Heathrow to Madrid on 10/01/2025 at 7.25am.\nThe Captain (Gary) was apologetic and kept us well informed as we were 1.5 hours late taking off (due to issues in Madrid, not Heathrow). ALL of the staff were in a good mood and so polite and helpful. Diego gave me some recommendations of where to go and what to eat in Madrid. I was taking my friend to Madrid as she had turned 50 two days before and I told the cabin staff this and they opened us a bottle of champagne and gave it to us for free, in glasses. They made sure we was happy throughout and my friend and I thought it was such a lovely touch (we were only in economy) that it really set the mood for our trip. So thank you to Diego, Olivia and I think her name was Nahum for looking after us at the back. Also to Gary who came to see us at the end of our flight and shook our hands. Its not often airline staff get praise but we felt they deserved it."
  },
  {
    "reviewDescription": "In April my wife bought 2 tickets for my best friend and his wife to fly from the UK to visit us in South Florida as a surprise for my 60th birthday. Three weeks before they were due to fly my father passed away, resulting in myself flying to the UK for the funeral and to be with my family.\n\nMy wife requested a refund on the ticket given a family bereavement meant that I would not be at home in South Florida to be part of the surprise birthday visit.\n\nBritish Airways denied this request, as my friends are not related to my father. BA decided that it was best for them to keep the money for the tickets, despite me having to pay for another ticket for myself to fly to the UK.\n\nProfits come before Sympathy or Empathy at BRITISH AIRWAYS"
  },
  {
    "reviewDescription": "Booked a flight to France a couple of months ago which was cancelled, after rearranging a new flight and changing hotels etc, the new flight has now been cancelled. Link to re-arrange the flights wont work. Customer Service not very helpful. The airline industry is in complete disarray."
  },
  {
    "reviewDescription": "Hour on the helpline to cancel flights and they couldn't do it, instead I have to wait for 72 hours for an email reply back.\n\nDismissive service on the phone as well."
  },
  {
    "reviewDescription": "I have never experienced anything worse when it comes to airlines unfortunately. I was going to fly to Frankfurt from Glasgow over London but the flight from London to Frankfurt was cancelled. This meant I had to stay overnight in London where I have no accommodation etc. As I was rebooked to a flight from London City airport which was more than 2h by train I had to get an uber and then take a hotel for £250 in total (London prices). I was reassured over the phone that I would get all the money back and that the phone call is recorded. My flight from London city airport was then cancelled again and rebooked to London Heathrow but two days later. I then cancelled that flight and rebooked a new one with Lufthansa as I urgently had to get to work and needed the money.\nI never received the money back for the hotel, compensation for cancelled flight 1, compensation for cancelled flight 2, the extra food I had to pay for, the uber, or just the actual cost of the flight.\nI was first transferred 3€ (!!) by British Airways and told that they can't listen to the recording. They stopped replying to me and told me the issue was \"weather conditions\" although all other non-BA flights were going... I lost over £700 in total and never got compensated for the loss of a work day either. It just really feels like they don't care about people.\nWorst service/airline ever."
  },
  {
    "reviewDescription": "Paid extra for designated seating for a family holiday in July. I wanted seats so my family and friends could sit together and despite paying extra for designated seating I did not get my designated seats on my outward bound journey or my return journey.\nPut in a complaint about this on 1st August and I am yet to even receive an acknowledgement!!!\nCompany is obviously robing people of money making them pay extra for seating that they don’t allocate and then don’t respond to complaints what a joke!! Avoid like the plague."
  },
  {
    "reviewDescription": "Our BA flight from Newcastle to London Heathrow was delayed almost 2 hours. Despite supplying email addresses when booking, we did not receive any notification of the delay. We eventually arrive at Heathrow T5 to be delayed a further 20+ minutes leaving the aircraft due to not enough staff to handle the walk way. What has happened to BA and Heathrow to provide such poor service now. The time it has taken us to reach Paddington with BA is the same time it would have taken us to Drive. Never again BA."
  },
  {
    "reviewDescription": "Flew from Terminal 5 6 May to Tokyo. The most stressful check in every experienced. At bag drop 6 check ins were not working and it took nearly an hour to complete. Food on outward journey just ok. Return flight landing 27 May had upgraded to premier never none such a waste of money. My friend had the beef, as had beef on outward flight, it was just grizzle and inedible. I had the vegetarian which was swimming in grease. BA have certainly dropped their standards and would be very reluctant to have to travel with them again."
  },
  {
    "reviewDescription": "Trip to Canada booked via travel agent as multi centred. They booked BA flights travelling in premium. Told at the time of booking seats cannot be confirmed until 24 hours before when you check in. 3 weeks to go travel company issue us with our ticket numbers. BA app now says we can pay to secure our seats. We decided to do this. An extra £138in total for seats on return flight. Outbound flight cannot secure seats together as there is only limited seats available to us. The other seats (which we said we would pay for just to resolve this) are for direct booking customers. As non direct bookers we do not get this option, despite having flights booked since November last year.\nMultiple calls to BA customer service which appears to based in South Africa. Told us it’s the airport responsible to resolve this!!!! Given a contact number for Heathrow which when I called was told this number was an internal telephone number for BA staff only. Staff member I spoke to very worried I had been given this. There are still other seats available but not to non direct bookers despite the fact we have no doubt paid the same, if not more for our flights. Only option is to pay £92 to sit roughly 6 roles apart."
  },
  {
    "reviewDescription": "On arrival at Mumbai airport form London Heathrow, my bag was totally damaged and my wheels were missing..The customer service told me to go online and make a baggage claim for damaged baggage. i spent hours online and still couldnt assess the baggage destroyed claim..all online claims relate to delayed baggage\nNever going back on BA as totally unhelpful in claims for damaged bags"
  },
  {
    "reviewDescription": "Absolutely disgusted!\nI selected economy plus so i could have flexibility in changing my flight times with no change fee. (original flight and return cost me £191)\nI rang BA yesterday morning to enquire about changing my return flight by 5 hours earlier. I was told it would be £43.00 to change. I was disappointed it cost but agreed to pay that amount. When i checked my bank account later i realised £340.00!!! had been taken out. I rang the refunds department said i was told it was £43.40 i even wrote this down at the time on the phone, the lines are very dodgy and the lady on the phone had a very strong accent, she even misheard me reading my card number numerous times the line was awful. They showed me no symptathy said i agreed to it i gave my card details and that its their word against mine and that they will listen to my original call and contact me. I got a call back today saying i agreed to £343 and theres nothing they can do. I explained they wouldnt hear what i heard and that the lines are awful. I was only told the price once if the lady repeated it again later on i might have cottoned on that that was not what i heard.\nMy original booking cost £191.00 and ontop of that £340 has been taken just to change my flight a few hours earlier. No one would have agreed to that price its disgusting. I am a student and cant afford it! Again no sympathy or understanding, theres nothing they can do i have to fill in a complaint via customer relations and wait 4-6 weeks. First time flying with them, i never will again. Down £340 just because I called them for help, wish i never did!"
  },
  {
    "reviewDescription": "Flight was cancelled late evening the night before we were due to fly. Both numbers on the cancellation notice went to a recorded message stating they were only open office hours. No explanation given apart from 'operational constraints'. This is the second time this has happened with BA. The delay was very inconvenient and stressful. You can only claim compensation by making a complaint but they settled quickly for our extra night in the hotel.\nIt seems BA would rather pay compensation that actually run flights. This is a completely unreliable service.\n"
  },
  {
    "reviewDescription": "Domestic flight delayed an hour then an hour 45 min wait for luggage. Friend was transferring from LHR to Gatwick so missed their flight"
  },
  {
    "reviewDescription": "Update on my BA flight from Nice To London: we were taken to a hotel last night at around 19.15/19.30 as we were told they were no seats available on next flights and that we should expect a message from BA . In the meantime BA updated the manage my booking an put us on the 20.10 pm flight whilst we were going to the hotel. Then they changed it a 5am for some of us to today’s flight at 13.35 but I was not on the list . Contacted them via the chat and after going through many checks I was told “you did not turn up for the flight at 20.10 the previous night , can’t help you . This is despite the fact that I explained that around that time we were being taken to the hotel booked by for us by BA. The woman would not listen. Back inside the airport in Nice where I saw a member of staff who organised the hotel the previous night , explained the situation again. She was well aware and assured that BA had all the info and we should have been booked on the 20.10 the night before but for the following morning . At the end she took it on her and managed to get me a boarding pass for today at 13.35. BA your are a total disgrace and tomorrow I will write to the CEO.\n\n11/10/2022\nStill no response from the CEO.\nReceived a £50 voucher today (I am refusing it)\nThe Law is clear its 250€ compensation in my case.\nSo, BA provides below average service and does not respect the laws.\nI will follow the complaints process, but I am\nLooking forward to the day when I will file a CCJ."
  },
  {
    "reviewDescription": "90 days after coming back from a booked BA Holiday and have not yet received our double tier points. Plenty of phone calls, emails and DMs with BA saying that the problem will be solved in 7-10 days. Well, still waiting.... and these days have long passed. I like the approach of not giving your customers what they paid for, not! And loosing their new status because of your incompetence. Disgraceful.....!"
  },
  {
    "reviewDescription": "Just the worst service ever. The app always takes you to a website which doesn’t work and tells you to use the app which is laughable. Then when it doesn’t work and you call the clowns you get an automated message saying the phone aren’t working and to use the website 😆😆😆"
  },
  {
    "reviewDescription": "It’s a cliche but I only give one star in order to be eligible to leave a review. BA, ourr national carrier, used to stand for quality. Now it’s synonymous with quality - very poor quality. BA cancelled our return flight from Valencia in June when we’d only just landed a few hours before in Spain at the start of our break. Despite non existent customer service I managed, after several hours trying on unanswered phone lines or recorded messages that just hung up on me, to get a flight back to LHR via a web chat, but we had to go via Mallorca first!! Ok, the cancellation may not have been BA’s fault but the diabolical, disdainful and disinterested attitude of BA Customer Services and their lack of interest in dealing with my claim is squarely on them. I submitted a compensation claim at the end of June, and received one email acknowledgment. Since then i have had three “we’re on the case” emails but nothing else. When I eventually managed to get hold of a BA human being on the phone yesterday he said it was nothing to do with him and his section and would do nothing to help me. I will never willingly give my hard earned cash to BA and their like again. They have forgotten that their shareholders only make money if mugs like me continue to fly with them. They won’t mug me again."
  },
  {
    "reviewDescription": "I thought that I had to deal with a prestigious company. Instead, they charged me probably another ticket or something that I never booked, and I only realized that when I went to use my debit card and found it empty! Not only empty but also they caused me an overdraft..\nI called the company and they didn't explain anything, except that the money would be refound after two weeks! I called my bank fraud and security service and they helped me get the money back in two working days -actually, this will hopefully be the day after tomorrow, and I have to use my credit card till then.\nThat was a great disappointment -I will never use British Airways again. I never had such issue with smaller companies. If someone gets money from my card without my will, I'd call it stealing. Yet, BA and my bank seemed to have a way to get the money without asking me -something that is not allowed to happen in any other purchases, the bank is always asking for my confirmation first. And no one explained to me why -just that this happens when you book from BA online.\nBA was willing to give a money refound after two weeks.. well what kind of refound can heal my embarrassment when I had to leave my shpping basket, cos my card was empty? Who can reasure me that they won't get money from my account again? How can I feel safe now that they have my (basically my partner's) bank details?\nI feel upset and scared at the moment, and it's unbelievable, cos I was always looking up for this company.."
  },
  {
    "reviewDescription": "BA change my flight and give me a 5 hour connection at DFW. There is a more convenient flight, but I can't change to that flight on-line. So, I call BA - a 30 minute wait and then the usual long security (when I was already logged in an had to provide my password, flight PIN, etc). The call centre woman has to consult a colleague about my request and comes back with a charge of £300 for me making the change plus the difference in the price of the flight (which she couldn' tell me).\nSo, BA changes my flight and wants me to pay for a reasonable connection. BA are insulting - and a rip-off."
  },
  {
    "reviewDescription": "After months of emails they just can’t reply with any level of common sense.\n\nThey have tried to under cut me on moneys owed, sent money without agreement and refuse to justify why they haven’t returned what’s owed, can’t justify or break down why you just get generic replies, not followed own complaints process at all and won’t call me either.\n\nThey also have a good will voucher which doesn’t even work at check out.\n\nIt’s not what’s happened but how it’s been handled after.\n\nEasy jet is actually far better with complaints."
  },
  {
    "reviewDescription": "Flew with BA to Orlando in April 2023. What can I say, great customer service, very friendly and helpful. Uploaded our covid passes onto website two days before, very simple, checked in on the app the day before, also very simple, checked our bags into Gatwick the night before at the desk, very simple (surely this cant last). Walked thru security and gates were called an hour before, fast boarding process and we were seated easily. legroom not bad for economy, I am 6 foot 2 and it was fine. Air crew were lovely, the food wasnt bad (we bought a meal deal just in case, wasnt necessary in hindsight) Entertainment was good on plane and flight was slightly late taking off but made good time. Return flights just as good. Thanks BA we will use you again :)"
  },
  {
    "reviewDescription": "It is so sad to see BA go through such a shambles. As a loyal (gold) customer I have always been so supportive and through the entire pandemic just racked up more and more vouchers. Now with multiple issues with multiple flight bookings I cannot even get in contact with anyone to explore options to resolve so I guess ironically due to this inability to manage, I assume too many customer service requests, lets assume accidentally, BA will probably just end up keeping my money"
  }
]