[
  {
    "reviewDescription": "Appalling customer service when flights are delayed or cancelled. Call centre disconnects calls, no willingness to help, and simple response is “we will try and get you on a flight in the next 2 days” ! Awful. Now the Ryan Air of the UK. Fly with another airline."
  },
  {
    "reviewDescription": "It is with great disappointment that I bring to your attention the unsatisfactory experience I had with your company and airline. Without prior notice, our holiday was abruptly canceled, causing significant inconvenience and distress. Despite spending a considerable amount of time on the phone with your \"customer\" team, I was astonishingly informed that the cancellation was initiated from our end, which is an utterly false claim.\n\nSubsequently, I diligently composed an email, presenting concrete evidence to refute their assertion. Regrettably, my efforts were met with complete silence, as no response was ever received. Consequently, I am compelled to express my profound dissatisfaction and firmly declare that I will not be engaging in any further business transactions with your company."
  },
  {
    "reviewDescription": "Not only did my daughters flight from Houston to Heathrow get cancelled she then had to wait till the next day to get a flight, losing a day of her precious holiday. I am waiting at Heathrow and her plane couldn’t get near terminal 5 so she has been dumped somewhere else and been put on a bus. Her baggage is still to arrive. The plane was 45 minutes late so the cost of parking for me is astronomical. DONT USE BRITISH AIRWAYS. They are an abysmal service. Shame on you BA."
  },
  {
    "reviewDescription": "Can’t believe how down hill BA has become. I flew with them to and from Mauritius and it was the worst flight experience of my life (I’d sooner fly with Ryanair). The food was absolutely disgusting it was like a punishment having to eat that - runny eggs, broccoli and an ultra-processed chicken sausage for breakfast? No thanks. They then ran out of all chicken options so we basically had to starve for the whole 12 hour flight. Some of the staff were nice, some were super rude and looked like they hated their job - I don’t blame them to be honest.\n\nI have made a vow to myself to NEVER EVER use BA again. We will be flying with emirates next time.\n\n\nLooking at the reviews I think everyone else feels the same and BA has become the new Ryanair. Get your act together!!"
  },
  {
    "reviewDescription": "Pathetic! My son's school had arranged a fantastic trip to Marseille for 40 children and their 6 teachers. Their flight was cancelled with less than 36 hours notice! It's broken the boys' trust and robbed them of creating amazing lifelong memories with their friends!\nWhat is the reason for such disgusting act. It's sheer madness and chaos for no valid reason. I can never trust BA ever."
  },
  {
    "reviewDescription": "I am owed a refund from BA and apparently customer services have passed the issue to refunds and I can longer get any response from customer care. I have since written to the CEO and CCO and neither replied, so this must be where the problem lies, if no one at the top cares why should anyone else. Shameful behaviour."
  },
  {
    "reviewDescription": "I'm extremely unhappy with our flight on 24/05/22 & 31/05/22 I was absolutely shocked with the way everything was on the plane.\nI recently traveled with Emirates and their service was over and beyond. I didn't want to travel with a cheaper airline like easy jet, pegasus or even Turkish airline I chose British airways even though it was way higher in price as I thought the service would match.\nI travelled with my 3 children and their father. There was no tellys on the plane and I didn't pack my kids ipads as I thought that would keep the kids busy but obviously that was not the case. Nothing as much as a colouring book was even provided for my kids aged 3, 6 and 9. They sat for 4 hours straight with nothing to do and not a single airhost went out there way to accommodate or make them feel welcome. Not even blankets offered. They were bored stiff and hungry. Yes it's a 4 hour flight however for a child that is a significant amount of time and for the price its disgusting to only give complimentary crisps and water. I also paid 7.99 on the flight back for Internet and it didn't even work for 10mins before it stopped, I asked an air hostess to help me and she said well we are in the sky flying maybe we are flying over some areas that we don't have Internet over or connection is poor ,so why is it even available as an option to purchase? If you are aware it may not even work? For you to make more money ??\nYour name doesn't match your service I'm very disheartened and definitely will not be travelling with you again or reccomending you to anyone. people should be are aware that you do 0 to accommodate children I mean its 2022 and with a name as reputable as British Airways to not even have tellys on board is quite ridiculous but also to provide small children with nothing. Literally ignore them .Not an experience I enjoyed. And 10mins after your allowed to purchase food (spend more money on board ) you were apparently sold out of most things, I geus everyone was hungry on that flight despite it being 4 hours! Give people what they pay for and stop robbing them !"
  },
  {
    "reviewDescription": "\nMy actual flight was booked with only 45 minutes gap, and S****y Qatari Airways changed it and made me wait for extra 6 hours. I buried calling BA and both S****y Qatar Airways no pick up after trying few times 10 ish days ago. So I had to accept the change as nobody was answering phones, as I have my Marriage Nikah on Thursday evening. They delayed it due some operational reasons, I thought its due to baggage might not gey transfer as it's a short transfer but baggage is going straight to Lahore.\nWhen came to airport, ticketing staff kept blaming on Agent Travel up, for the delay and change in flight, which is going to exhaust me for my wedding in the evening. Still going to catch it as no option as I have tight schedule to make it in time.\nComplete b******t and disgusting service by Airline claims to be one of the top ones.\nWill avoid this F****d and s**t airline in the future.\nWould not recommend it.\nGoing to give bad review on Google and Trust Pilot as well.\nNabeel Afzal"
  },
  {
    "reviewDescription": "I agree with all those giving a 1 star review: emailed this morning that flight in 2 weeks cancelled. Followed instructions. Wasted time on phone that eventually pops up message that calls not being answered, try at a later date! This is after listening to platitudes about helping those travelling this month. Chatbot put me in touch with a person, I was 52nd in line. Half an hour to be contacted by Daniel who couldn’t help so joined a queue of just 12 but it took nearly 90 minutes for Joanne to touch base. To be fair to her she sorted reasonable alternative flights in a few minutes. It should not take 2 hrs to resolve. This is on the back of flights to Seville cancelled, alternatives a day before or after were £1000 more than the £500 originally paid. Still waiting for the refund 8 weeks later. At the gate at Heathrow last month when flight to Copenhagen cancelled and put on flight 8hrs later. Compensation for this has been received. I have booked on Quantas rather than BA to Oz and may take others’ advice and go on EasyJet or Ryan Air. Anyone want 280,000 Avios and an Executive Club Gold Card?\n\nThe leadership of BA must consider their positions as they are clearly incapable of providing a service."
  },
  {
    "reviewDescription": "I remember flying BA once upon a time and feeling like they cared. It wasn't that long ago, flying BA was almost a bit of a treat compared to the budget airlines. I flew back from the states last week, on a BA plane and the conditions were disgusting. A tiny plane with the most people you can uncomfortably fit in a small space. I could barely fit in the seat, let alone fit my legs in straight. I couldn't drop the tray without crushing my knees either. A few hours in, one of the staff serving smashed into my seat with his trolley, bashing against me. He looked down at me, and carried on. I called out to confront him and ask why an apology was so hard. He replied, \"this is my workspace.\" Absolutely gobsmacked that you would cause harm to customers and then shrug it off as, not my problem. I am never flying with these clowns again. Made Easyjet look like a 5 star service."
  },
  {
    "reviewDescription": "Arrived at Heathrow to fly to vegas but had to get a connecting flight to san Francisco so arrived at Heathrow checked the bags in and found at that the flight was delayed to 6:00 pm because it was held up coming back from Japan so waited and then joined a big queue to go to Vegas to get onto a bendy bus to go to the plane which was in another terminal. Ba told all passengers to go to terminal 3 and the plane was even not in that terminal. Then boarded the plane took off. the staff were rude to my dad because he asked for tea on the catering trolley and they only served fizzy drinks and water not hot beverages which they didn’t mention so my dad waited for 10mins before he got served. Then we landed in Vegas airport and the cabin crew said “if you have a connecting flight go to the British airways rep at the desk and they will get you onto the connecting flight” by the time we got the bags and gone through immigration the flight had already boarded and when we got to the rep desk nobody was there so my sister and my mum tried to find people about what was going on about the connecting flight bearing in mind Ba where meant to be helping us and they did nothing at all. So we had to find a hotel and then my mum tried calling Ba to get us the next morning onto a flight to San Francisco but nobody was on the customer service line and said they were not available so we had to change the plan and move the rental car to Vegas as well as scraping the plans we had like we booked a hotel and sign in San Francisco and that was £200 gone. So thanks British Airways for running the start of my holiday I will not recommend ever flying this airline again."
  },
  {
    "reviewDescription": "If it was possible to rate below 1 star I would. Cancelled flights, flight delay, bag delays, poor servie. We have wited 3 days to get our bags back. I have complained for 3 months and still have not received a reply.\nAbsolutely disgusting servie!"
  },
  {
    "reviewDescription": "Despite terrible service from the airport staff (not BA), the BA staff were amazing and my flight was perfect. The return flight was cancelled, which can happen due to unexpected problems, and the new flight was to a different airport but BA did reimburse me the cab fare to get home with no messing around like other companies have done and I am very pleased with them all round and can’t thank to staff enough. Although I’ll never fly from that particular airport again, I’d be very happy to book with BA and would like to pass on my thanks to them."
  },
  {
    "reviewDescription": "BA customer services is heavily under invested , old technology and unable to cope. It needs an overhaul.\n\nThe app is outdated and the call centre agents place me on hold for any question raised. I was held for 12 minutes to find my booking reference - basic stuff right? Held for another 22 minutes to help with alternative flight options after receiving an email\nemail telling us the flight will be outsourced. Never heard of the company - also very poor reviews on TrustPilot.\n\nAfter 34 minutes the agent told me that this was our return flight only and no BA options are available for that day ALL flights will be outsourced.\n\nThe email I received did not explain this was the return flight only and no alternative options were available. BA Customer Experience - you could save a whole lot of calls , waste of agent handling time and customer frustration if you handle your comms better. You contact centre is already string and sellotape.\n\nI haven't flown yet and have huge concerns about the reliability.\n\nSuch a shame BA - hope you can step up."
  },
  {
    "reviewDescription": "Took a flight back in May still waiting for my Avios point - same story again and again - I will now loose my year points - how difficult is it to add some points - you cancelled the flight and put us on AA not our problem if this has buggered up the Sys - what a joke"
  },
  {
    "reviewDescription": "Booked a Return flight to Florida in may, as I was completing my booking it asked if I wanted to book any extras so I added car hire. Turns out I no longer need a car but BA will not let me cancel just the car, I would have to cancel the flights as well even though the cost of the car had no impact on the cost of the flight it was just an extra amount. If you need a car got a car hire company, If you need hotel go direct to a hotel as the BA customer service is non-existent. You have been warned."
  },
  {
    "reviewDescription": "Booked a very special holiday for me and my partner, September arrived and we were on our way to lovely south of France, Booked Business Class for us both to start the holiday right.\nas we were checking I was told the flight was over booked and our seats wouldn't print onto the ticket for some reason.\nWe had already made sure the seats were booked when we had booked the flights nearly a year prior to going.\nUnfortunately when we arrived at the gate we was then told we would no longer be sat together and one of us would in fact have to go into economy.\nMy girlfriend is an extremely nervous flyer and so had to take extra tablets to remain calm, She didnt have any food which we had pre booked also and she was sat right down the bottom end of the flight.\nWe were held at the gate with another 4 or 5 couples all in the same predicament all due to the lovely money grabbing British airways over booking the flight.\n\nThey ended up refusing passengers in the end and even had people sat on the fold down chairs in the toilet area.\n\nwhen we eventually arrived in France late, we was waiting for our luggage to come.\nOur airtags stated that both our cases was infact still in Heathrow.\nWe then had to wait 4 days for them to eventually come into France by this point our holiday was ruined.\n\nBritish airways was absolutely shocking, we couldn't speak to anyone as all the phone numbers were no longer in use.\nWe felt stranded in a foreign country with no clothes and no one to help use with what to do next.\n\nEvery day we watched them case not moved as we were tracking with air tags.\nit was so frustrating not being able to plan our days in hope we would get the call to then drive all the way back to the air port 2 hours each way to collect our cases.\n\nwe ended up going out and buying new clothes toiletries and all the stuff to make the best of our ruined holiday, saving all the receipts thinking we would be able to claim it all back.\n\nhow wrong I was.\nBritish airways take zero responsibility and fob me off with going through my insurance.\n\nBritish airways only pay for basic essentials, Pants and toothpaste.\n\nI filed a complaint when I got back and requested my money back for business class and they haven't even had the decency to even respond.\n\nThey are an absolute joke of a company and I wish they would remove British out of there name because there is nothing British about them.\n\nDO NOT GIVE THEM YOUR MONEY, they cant even look after there staff let alone customers.\n\nOh and don't bother trying to cancel your flight either as they just take all of your money off you and give you nothing back."
  },
  {
    "reviewDescription": "So shocked by this airline. In all my years of flying with cheap and cheerful airlines, the irony is that when I happened to book flights as part of my package deal through BA, I made the mistake of thinking I would get a superior service. How wrong I was. This company is a complete con and if you need to change the name on your booking (to a different person), they force you to buy BRAND NEW TICKETS. First of all they tried to blame the travel agent, but no, let's be clear: the travel agent was more than happy to make the change. It is BA's policy not to allow name (person) changes. I have never had a problem in the past on the occasion that I've needed to change passenger details. BA seems to be the only airline that doesn't offer this extremely basic, simple service. It is so basic and frequently requested in fact that I'd go as far as to say it's one of the only functions a passenger needs to contact customer service about at all - so why bother offering a 'customer service' line if you have no policies in place to support the customer? Truly shocking. BA quite sinisterly term the simple procedure of changing the name on a flight as 'body swapping' and speak of it in hushed tones as if it is the most unspeakable request imaginable. Back to Easyjet I go."
  },
  {
    "reviewDescription": "Our flight was suddenly cancelled by BA at Prague airport offering a flight for the NEXT day. Stranded at Prague Airport, unable to get trough to BA - their booth was closed, we had to buy EASYJET flights for later that night to get home to London. As for BA there was only an online claim form which we filled out, because we also had to arrive at Gatwick not Heathrow, so our friends picking us up at Heathrow had to leave – an expensive taxi home instead. Tried calling up on their ‘customer care line’ about refunds many, many times, but all you get is “we are too busy, try another time” message – only you never get through. About a month later, received a PAYPAL refund for a fraction of what we had to pay, around 200 pounds instead of nearly, 700! Still not able to get through. Zero customer service and still out of pocket. Cancellations happen, and aside from the stress and inconvenience you shouldn't be out of pocket for getting yourself home safely. To add insult to injury they sent us an auto-email asking 'How was your flight?\" Still unable to contact this airline...not so much 'customer care' as 'customer, I don't care'."
  },
  {
    "reviewDescription": "I booked 2 return flights from Heathrow to Chania for my 2 sons. I was just about to book the third for my daughter, when one son told me he could not make the flight. I immediately called and changed his name on the booking to that of my daughter. I received confirmation of the change and a new booking reference in her name. All fine until she tried to check in 24 hours before the flight when she was told that the ‘ticket’ was still in her brother’s name and she would not be able to get on the flight. Clearly a mismanagement on BA’s side. It’s impossible to get hold of anyone from customer services who can give any help. I was already in Crete and was repeatedly put on hold and then cut off for over 5 hours. Even though the whole mistake was BA’s fault, she was told that she would have to buy a full price ticket on a different flight to her other brother, and she could not cancel her original ticket because it was in someone else’s name!\nShe was extremely upset but had no choice but to go ahead. She therefore had to make alternative travel arrangements to Heathrow and upon arrival in Chania. At this point the return flight has cost well over £1000.\nOn top of all of that, the original booking suddenly disappeared…BA covering their tracks?\nI have booking reference proof in her name, have made an online complaint to BA, but no response. Absolute shambles, looks like I will be contacting the CAA to try to help sort this mess out.\nNEVER RELY ON BA!"
  },
  {
    "reviewDescription": "On our recent trip from Gatwick to Tampa, we were on a very old not updated plane which meant uncomfortable seating, poor entertainment, condensation dripping out of the moldy light fittings, trays that were so crooked and loose it was tricky to put the disgusting meal on there to look at and decide that I definitely was not going to eat it.\nOverall, the flight out was on time so that was a positive, however the flight back was delayed by several hours and it took personnel some time to be sent to the gate to manage the delayed passengers.\nOne issue of this delay is that the vouchers that were issued would not have got any food, unless you want a bag of \"chips\" or a drink and no place in the departure area would accept the vouchers anyway.\nThe crew on the flight are your only saving grace as they were polite and efficient, I think you need to look more closely at maintenance of your aircraft, lot's of the issues I saw were purely light maintenance issues and could easily be resolved.\nLeaving these tasks to build up and not dealing with them in a timely manner leads to more and more issues building up until it becomes a huge number of maintenance issues."
  },
  {
    "reviewDescription": "We decided to change our flights to leave a few days earlier than our originally booked flight. As part of the original booking, we paid a whopping ₤140 to select two preferred seats. I searched and search across your website to figure out what would happen with our seats if we changed our flights and I couldn't find anything describing the policy on seat refunds. Since I had confidence in British Airways, I thought 'oh the policy shouldn't be unreasonable. I think they will honor what we've paid for seats so far and that will be applied to our seat selection.' So, I ended up making the flight change. Well, it turns out that was not the case and we were required to pay an additional ₤140 to select two new preferred seats on our new flight. I decided to reach out over live chat about this issue and someone explained to me that they would try to process the refund over live chat. They came back maybe 10 minutes later and said unfortunately it could not be done as per the policy - that seats are non-refundable and non-transferable if the flight change is voluntary. This is very frustrating considering how much we spent on seat selection. Not even a voucher for the equivalent cost could be issued to us, as per the customer service agent. As you can imagine, we are very upset that we have just had to forfeit a large amount of money since BA's policy is unclear and, in my experience, non-existent since I couldn't find anything when I searched for the policy on seating in the event of a change. In an ideal world, I would like a full refund for both original seat selections, but I don't know if they will honor it. My live chat agent advised me to file a formal complaint on the website so I will be doing that but this is the second time that we have experienced a major issue with BA and if this is not resolved then we will probably take extra care to never book with them again."
  },
  {
    "reviewDescription": "Bunch of C****\n\nworst experience in the world. been trying to get a refund for a flight that BA has cancelled for nearly a month now.\n\nGet passed on from person to person and eventually get cut off. Shambles"
  },
  {
    "reviewDescription": "I travelled with British airways on 10 December 2022 . Take off was meant to be at 13.30pm from Heathrow. After going through immigration I realised that the flight had been delayed for an hour and 25 minutes. When we finally boarded the aircraft we were delayed for a further 2 hours so in total the flight was delayed for 3 hours. I'm yet to fly from London to Accra with BA and leave on time. It's unfortunate that it's the only airline with a direct flight to Accra. They have no regard for their clients and should be boycotted. My return flight from Accra on 30 December was also delayed."
  },
  {
    "reviewDescription": "A disgrace. The customer service does not care. Cancelled my expensice flight to put on the cheapest one of course after waiting more than 3 hours at the airport and gives me 10000avios (equivalent to 50GBP) for a price difference of more than 100GBP. Nothing for the delay waste of time ... 4 weeks later still no reply."
  },
  {
    "reviewDescription": "You go through to a call center the other side of the world they don't care as you can't trace them...for 7 hours I've been cut off called back told I can't change my seat then told its done when it hasn't been...now told my seats have gone....it's an absolute shambles....6 different incompetent people.....from 7.15am to 2pm.....\nYou get better service from easyjet and other budget airlines won't be booking with BA EVER AGAIN"
  },
  {
    "reviewDescription": "Seems to me that BA are just not interested in their customers. Cannot get through to customer services , their phone line actually kicks you out saying they can’t deal with it. Have had flights changed which are now totally unacceptable and just cannot get through to anybody. Emails and phone calls all a waste of time. Maybe carrier pigeon. Will never use BA again. Disgusting and disappointing service from our once flagship airline. One star is too many."
  },
  {
    "reviewDescription": "My flight was cancelled from lanzarote to gatwick and although I was offered am alternative it was to Heathrow, via Madrid, 2 days later so had to book an alternative flight and missed a day of our holiday.\n\nIt is impossible to get hold of anyone despite multiple efforts and have had zero contact from BA despite several emails, no refund or compensation so I am currently £700 pounds out of pocket.\n\nI would not recommend BA and I won't be travelling with them again."
  },
  {
    "reviewDescription": "I've been waiting since April for a refund on a holiday that I couldn't go on because British Airways cancelled the flight. For a while I was getting emails saying don't worry you haven't been forgotten about. I don't even get them now. I've just tried calling them yet again. It's impossible to speak to anyone about it. You just get a person you can hardly understand telling you they don't have the tools to deal with your problem. Absolute disgrace."
  },
  {
    "reviewDescription": "Cr#p absolutely c#ap, I'd like to say the plane was nice.. but the canceled a few hours before flight leaving me stranded with the next direct flight 2 days later.."
  },
  {
    "reviewDescription": "I was a passenger from Florence to London – BA 8472. Due to the bad weather at the time, several flights were canceled including this one. But BA had two flights and decided to merge them only boarding Business class passengers. It was an outrage and discrimination but the worse thing is that it has been over 10 months since I was waiting for reimbursement but they responded recently that I am not eligible for a full refund as my flight was not canceled and I missed it!!!!"
  },
  {
    "reviewDescription": "On 11th October British Airways cancelled our flight without warning, jeopardising our holiday plans. Spoke to customer service for over 3 hours the next day where staff lie without any remorse. Told I would receive an email to confirm our conversation. Nothing received. Spoke to customer service again, was told no notes on their system. AVOID THIS AIRLINE ITS A NATIONAL DISGRACE!!!"
  },
  {
    "reviewDescription": "What a disappointment for GB flag carrier! Trip to Vegas was cancelled the same day- rebooked the same day which was good but the inbound flight that followed was terrible. Delay after delay. The 30 mins delay from Vegas took an hour, back at Heathrow, delay again in plane parking and finally our baggages were delayed again. Our supposed arrival is 1450, it is now approaching 1630 and no sign of our luggages. Terrible!"
  },
  {
    "reviewDescription": "Another very poor experience here. Five hour flight delay owing to fog at LGW. Little to no information or support during delay (at GVA)."
  },
  {
    "reviewDescription": "My wife and I recently travelled to Barbados with BA having paid in total £280 for chosen seating .\n\nBefore travelling BA changed our seats for so called operational reasons .\n\nWe were not happy with the seats allocated but changed their choice to our own .\nSo far £240 down as we did not have the seats we had paid for in good faith .\n\nFast forward to November following a family bereavement I decide to upgrade going out . At the same time confirmed return seats in premium on the way back .\nThe other £40.\n\nOn attempting to check in the day before travel found out that BA had bounced us out of our paid for seats .\nNo prior notice or explanation given .\nWe had also been checked in without having done so.\n\nI asked why we had been bumped and explained we had yet to put our bottoms on seats we had paid £280 in total for .\n\nCheck in staff said seat had a broken footrest . We don’t care we said don’t use them anyway please can we have our seats No safety hazard that seat will not be used .\n\nCut forward to boarding I approached two people occupying the seats we had paid. Yes I am quite curious .\n\nMale and female both very sheepish wouldn’t say if they had paid for the seat.\nEvasive .\n\nAs it happens the guy seated in front of them joins in.\nHe is a silver card holder and had booked our seats in March as a silver card holder but he had been bounced out too .\nStrange they had subsequently sold them to me, obviously a coincidence.\n\nI suspect these two were in fact off duty BA flight crew .\n\nBA are now ignoring my e mails.\nUpon trying to claim the money back I find access to the booking is blocked as it’s in the past .\n\nThis is barring me from retrieving the seat numbers in order to claim my money back .\nComplete farce .\n\nWhy do we as consumers have to go through all these hoops to get our money back ?\nSurely once BA move you from your paid for seat they should refund."
  },
  {
    "reviewDescription": "BA return flight London to Amsterdam. 90 minutes late on the way out and two hours plus on return. Shocking. But typical of BA."
  },
  {
    "reviewDescription": "BA made a mistake with my e-voucher from a cancellation. This can't be handled on-line, so it took a week to find a number to call them on (their main number (0344-493-0787) refuses to transfer you, directs you to the website and then hangs up on you), get through to a human, sort it out, and book a return flight.\nFor family reasons I now need to change the departure point of one of the flights. Again, this can't be done on line, so I've spent two days trying to call them. My call was rejected 18 times - 90 seconds of recorded messages and then they simply hang up on you. On the 19th - 19.52 yesterday - I connected and spoke to a human. They were very slow, and at 20.10 my call was simply cut off without completing the change. I called in again at 08.00 this morning; Surprise, surprise I'm back in the \"not accepting calls, try again later, we're hanging up on you\" process. I'm infuriated!\nThe only reason I have to persist is that they have £1,000 of my money - they're sitting pretty while I'm given the run around."
  },
  {
    "reviewDescription": "Crap company, returning from holiday, got to bag check in suddenly the woman tells me that no check in luggage has been paid for, showed them conformation on phone and on paper print out, told me that was not showing on there computer, the manager says she is calling her manager-i speak a little French she seemed to be talking to someone regarding a bloke she meet on the weekend, asked to speak to someone else she brought over the bag boy pretending to work for BA, next called in security telling me and my family pay for the bags or they would be destroyed, worst company we have ever travelled with, unbelievably crap"
  },
  {
    "reviewDescription": "My wife I fly out to Dubai in 2 days. We have booked economy tickets but were tempted to upgrade to World Traveler Plus when offered a \"discount price available for a limited period\". There are no seats available in World Traveler Plus for our return flight. The cost of the upgrade for the outward journey would be £738 on top of our economy tickets making it less than £150 difference had we booked return flights in World Traveler Plus. I have been told that if I upgraded it could not be guaranteed that we could sit together and could only select seats once I upgraded. Naturally my wife and I would want to sit together, but, having upgraded the flight and finding we cannot, the option to downgrade would incur an administrative charge. NO DEAL!"
  },
  {
    "reviewDescription": "No spaces very very bad service. Better with wizz"
  },
  {
    "reviewDescription": "Trying to upload Advanced Passenger Information for a flight to the USA. BA Website won’t accept the correct input details; BA Helpline won’t accept calls - COMPLETE FARCE - Second Rate Service from. Third Rate Airline!!"
  },
  {
    "reviewDescription": "Incredibly bad customer service, I asked for a quote on flight change and they said they'd get back to me with quotes. Instead they changed my flight without telling me and refuse to honour my original flight date. Customer service is the worst I've ever experienced they never call you back."
  },
  {
    "reviewDescription": "Lost my luggage on flight out to NYC. I got it the day before I flew home. They lost it again on my return flight. Horrendous customer service at Heathrow Airport. Really inaccessible when trying to make contact, website is terrible to navigate. I asked for disability support, I was transferred on a flight with no support. Missed connecting flight due to delay. I could go on and on. Awful experience and ruined my trip"
  },
  {
    "reviewDescription": "As a less mobile person, I travel Prem class by BA since Covid out of loyalty. Unfortunately, I see BA slipping downhill. BA charges extra, extra for Prem Class but it's service is 1 star for the fare it charges passengers. The choice of meal menu is a Joke. The Prem class is a small cabin comparatively to other cabins, yet we get Leftovers after the middle row. We're offered one drink during the 14hr flt( btw flt was delayed 2hrs) and I dont take alcohol, couldnt offer me an extra cushion for my bad leg and back, because staff couldnt be bothered to look for one. As for myself, I don't drink, no xtra cushion, no choice of food during both meal times. So BA, what are passengers paying for? Please do not give excuses, BA, you can easily manage your meal supplies onboard. Passengers pay proper fare not to be treated like ' scrape bins' to be offered Leftovers. As a family have to think again if loyalty to British Airways is worth it? Possibly not!"
  },
  {
    "reviewDescription": "Scammers! Bumped from a flight Orlando to London, Delayed for over 6hrs with 2 kids. Applied for the statutory compensation we are entitled to which amounts to over 1k. BA have failed, and failed and failed to process our application. Excuses constantly made which i initially gullibly believed. Now 10 months later I realise it was all just a deliberate ploy to avoid paying. I am now going to have to issue a claim in the court. BA should hang their head in shame."
  },
  {
    "reviewDescription": "Flew to Milan and back. Very poor legroom. Agonisingly uncomfortable, and certainly dangerous if there was ever an incident. Staff didn’t care one jot. Altogether a very unpleasant experience"
  },
  {
    "reviewDescription": "Poor customer service. I appreciate it is my problem but no help whatsoever from BA. Having bought 12 return tickets for a forthcoming holiday to Rome one member can't make it. Don't want to cancel the ticket, just substitute another passenger even if I have to pay an admin fee. BA insist I have to cancel it for a refund and buy a new one. Result, £38 taxes only refunded meaning a loss of £450. For £38 I would sooner take the loss and do a no show rather than give BA the opportunity to sell a ticket twice. On principle unlikely to use BA again."
  },
  {
    "reviewDescription": "Hideous experience with British Airways trying to order an online meal. First of all trying to do it online. I couldn’t. Every time the screen said enter your Flight number it wouldn’t allow me. No explanation.\nI phoned up using a number of press this press that options until I got a human. After taking my details and verifying them, he said he couldn’t take payment over the phone and suggested that I do it in line. I gave up. What a pile of crap."
  },
  {
    "reviewDescription": "Consider the following experience and see if it is worth your time, money and sanity:\n1. Useless staff that refuse to help you in any ways and have the audacity to be rude to you (noticed this was prevalent mostly in staff of Indian/Pakistani origin)\n2. Don't know how to rebook a flight to save their own lives\n3. All you get for a cancelled flight was 10 pound gift vouchers to spend on refreshments on their ridiculously expensive stores (a win considered by broke and hungry people)\n4. Losing an entire day at a hotel because your flight was randomly cancelled.\n5. Having to contact the airlines from your country (in our case, Qatar Airways) to rebook a flight\n6. Going in the second day completely exhausted and only to have the rude staff chide you for having silly items like toothpaste/aerosols in your hand baggage\n7. Have rude staff make up fake issues about your boarding documents so that you don't get to board your flight. They will send you to different locations all around the airport over a silly issue that does not exist and will eat at the last bit of sanity you have left.\n\nDo I deserve to be disappointed? Yes. Honestly, as a tourist and a student, I expected so much more from the citizens of UK, who value punctuality and discipline quite highly. All I got from here is that they clearly don't value anything and anyone's time and any decency they show outside is merely an act. What an absolute shame."
  },
  {
    "reviewDescription": "Booked a holiday with flights for St Lucia. The holiday was fantastic!. And the BA sales staff were lovely!. Helpful and enthusiastic. Special thanks to \"Louise\" for fixing things. She was extremely professional and helpful. BUT and it's a big \"but\", there was a system/process error which resulted in ALL data for my wife and I including passport details being emailed to an unknown third party. BA reported the data breach internally, deleted the holiday and rebooked it. However, I will not use BA again. Data security is simply non existent. All one needs to completely bypass the normal ba.com login is the booking reference and surname to log in, make changes, view personal data, DOB, passport no, phone no's etc etc... absolutely shocking!. Thought I was seeing things. Also, in the last few days leading up to the holiday, we tried many ( dozens ) of time to contact BA but were told that BA was too busy and the call was ended. So I'd be very concerned about support should anything go wrong just prior to or during one's holiday. So, sorry BA. It's a 1 star review. BA staff wonderful. BA systems less so. I should add, that the actual flights and holiday were excellent in all respect. Such a pity about BA's system security and apparent lack of staff. There is no problem in getting through to sales, but I've never managed yet to get through to any other department. Will not use again."
  }
]