[
  {
    "reviewDescription": "A horrendous experience just had with these clowns. My flight was cancelled at 04:00 on the day of return for a 13:00 flight. They auto-allocated a flight for the the evening of the following day, no good to me. There was no support at the airport or via phone. They were useless. We had to pay for new flights, hotel for an unscheduled night, transfers, food, parking delay penalties and having to transfer from the wrong airport to go and pick up my car at the original airport.\n\nI cancelled the auto-rescheduled one and was sent an email with my refund of £0. Brilliant. I now find that I have a new booking for exactly one month after the original return flight (Like I'm going to stay abroad a month to catch it!) and finally I discover I can't cancel it as the BA system is telling me it was created by an external agent, which it wasn't!\n\nHow long have you been doing this??"
  },
  {
    "reviewDescription": "Scandalous service\n\nBooked a flight and paid deposit\n\nGo to pay balance and go through process clearing with my bank and then nothing\n\nTried to call and cut you of saying have too many calls.. terrible service"
  },
  {
    "reviewDescription": "Impossible to book flight on-line with connection error after calculating the price. Now impossible to get in touch via phone on 0344 493 0787. On hold for ages and then the lines hangs up. Any ideas as to how to contact British Airways? Do they even have an email address?"
  },
  {
    "reviewDescription": "I would like to give no stars if I could, as for the second time of flying with BA this year and paying £75 each to pre book our seats, both times we were told the seats were unavailable and were moved to other seats, in April they couldn’t give a reason why and after boarding we saw other people in our seats, the on board crew had no idea why we were changed and confirmed the people sitting in our seats had not paid for their seats, enquiring further we found out the lady and child in our seats had asked if they could be moved to a window seat!!!! After some time the cabin crew resolved it, but it was a horrible start to our 9 hour flight and our honeymoon! In October we again flew with BA and pre booked our seats thinking our first incounter was a one off, but apparently we were wrong, as at the gate we were told my seat was unavailable due to it being unable to recline…… I was fuming and said I was still prepared to sit in it for our 10 hour flight but the gate crew were insistent that we couldn’t have it, on boarding I explained to the crew we had been moved but I was happy to sit in a non reclining chair, the cabin crew were great and let us sit in our originally paid for seats, which proved that I was told a lie as my seat reclined perfectly!!! In April after many complaints I managed to get a £100 voucher to spend on another holiday, which we used in October, but had exactly the same fiasco, my complaint is still ongoing as BA’s complaint system is a shambles, I don’t expect to receive any good will jesture as it seems BA are out of goodwill and I won’t be flying with them again anyway! It seems pre-booking seats with BA is just another money making scheme!"
  },
  {
    "reviewDescription": "Miserable. Sat at gate for Malaga, flight late, told we have to put bags in hold despite flying hand luggage only. To do this we had to leave our seats and have been stood for 30 mins with our bags…….WORSE now the plane needs ‘some testing’ going to sit on floor. Total shambles …steer clear"
  },
  {
    "reviewDescription": "Booked a very special holiday for me and my partner, September arrived and we were on our way to lovely south of France, Booked Business Class for us both to start the holiday right.\nas we were checking I was told the flight was over booked and our seats wouldn't print onto the ticket for some reason.\nWe had already made sure the seats were booked when we had booked the flights nearly a year prior to going.\nUnfortunately when we arrived at the gate we was then told we would no longer be sat together and one of us would in fact have to go into economy.\nMy girlfriend is an extremely nervous flyer and so had to take extra tablets to remain calm, She didnt have any food which we had pre booked also and she was sat right down the bottom end of the flight.\nWe were held at the gate with another 4 or 5 couples all in the same predicament all due to the lovely money grabbing British airways over booking the flight.\n\nThey ended up refusing passengers in the end and even had people sat on the fold down chairs in the toilet area.\n\nwhen we eventually arrived in France late, we was waiting for our luggage to come.\nOur airtags stated that both our cases was infact still in Heathrow.\nWe then had to wait 4 days for them to eventually come into France by this point our holiday was ruined.\n\nBritish airways was absolutely shocking, we couldn't speak to anyone as all the phone numbers were no longer in use.\nWe felt stranded in a foreign country with no clothes and no one to help use with what to do next.\n\nEvery day we watched them case not moved as we were tracking with air tags.\nit was so frustrating not being able to plan our days in hope we would get the call to then drive all the way back to the air port 2 hours each way to collect our cases.\n\nwe ended up going out and buying new clothes toiletries and all the stuff to make the best of our ruined holiday, saving all the receipts thinking we would be able to claim it all back.\n\nhow wrong I was.\nBritish airways take zero responsibility and fob me off with going through my insurance.\n\nBritish airways only pay for basic essentials, Pants and toothpaste.\n\nI filed a complaint when I got back and requested my money back for business class and they haven't even had the decency to even respond.\n\nThey are an absolute joke of a company and I wish they would remove British out of there name because there is nothing British about them.\n\nDO NOT GIVE THEM YOUR MONEY, they cant even look after there staff let alone customers.\n\nOh and don't bother trying to cancel your flight either as they just take all of your money off you and give you nothing back."
  },
  {
    "reviewDescription": "You can't get help on the chat and they can't take a call. They are busy, call back later. What if it is a damn emergency.\nShocking shocking service and their website sucks."
  },
  {
    "reviewDescription": "Flight BA2202/BA2203. LGW to Cancun.\nJust returned home. I flew on the above flights in business class. The crew were an in all were excellent friendly and nothing was too much trouble. I did think the crew (particularly Mandy ) on the return flight seemed to offer a slightly more seamless personalised service. Negatives have to be flying them old B777 aircraft on the old club world seat. No storage hardly. Not much privacy and certainly cannot sleep on the b777 aircraft as engines very noisy. Please update your old club world product and aircraft on this route in order for me to fly this route again from Gatwick. Thanks"
  },
  {
    "reviewDescription": "This is pure love shown me. I missed my flight to Ghana due to a sensitive reason and I can’t believe the customer service agents I met at the Heathrow airport are humans. They must be angels. They fought their way to have me booked on the next flight and have the charges waved off. They even checked my luggages in so I didn’t have to carry them around and to top it all gave me shopping vouchers to buy food. Anna, Marrion and two other ladies I forgot their names have redeemed my faith in BA. God bless you all guys"
  },
  {
    "reviewDescription": "I made a flight booking on the BA website this afternoon and authorised the payment with my bank and then got a message saying that it was being processed which froze. I tried booking again using another tab, and the price had gone up. So, I telephoned the Avios helpline and spoke to someone after waiting 20 mins and was told that BA have dynamic pricing and the price went up after I had authorised payment, so it was blocked. I asked her to repeat this and then checked that I had hear correctly. How on earth can this be fair trading practice?"
  },
  {
    "reviewDescription": "I cancelled my booking due to unforeseen circumstances, this took months for someone to actually cancel it and at least about 20/25 phone calls as got told someone would call me but never did so had to chase again and again and explain the whole thing again then got told different reasons why it hadn’t been cancelled, but then eventually just a few weeks ago someone from refunds called to process the fully amount of the flights and to an account that I gave details of and told this would be refunded in next few days, I then got a refund to an account that had closed and not the account I had given details of , and not only that but only for £239 of a £1089 booking, I raised a complaint and they responded with only you only get part of your ticket refunded, I emailed back with an attachment of the email from British airways as proof of the full amount and account number that I was to be refunded to! This has been one of the worst and horrendous experiences of my life that should have been straight forward, even after all these months of getting this refund processed, with email of confirmation I am still having to deal with getting it sorted and getting my full refund to the correct account, no one has taken to consideration all these\nMonths of dealing with this and now once again having to deal with the refund and getting the money back, I actually cried when the email came back saying you got the refund, it was as though they did not read my email!! HORRENDOUS CUSTOMER CARE THAT ACTUALLY JUST TOCK BOXES AND SAY THEY WILL SORT AND ACTUALLY DO NOT DO ANYTHING!!!!!!!!"
  },
  {
    "reviewDescription": "Awful customer service cannot get hold of anyone on phone and the online chat was terrible all British airways do is rip of customers will never use this company again Virgin Atlantic all the way"
  },
  {
    "reviewDescription": "BA cancelled my flight home, the last flight of the day into Heathrow, and tried to push me onto another flight to Docklands 3 hours later! My car was at Heathrow! I didn't want to try and cross London late at night on public transport with luggage, especially as there were rail strikes announced around that time. I had to book a flight home with Lufthansa which cost €500 for an economy seat! But at least it got me home to Heathrow (all be it another terminal) on the Friday night so I could get home to family. I still have had no news on a refund of the €500 2 months on! It's such a shame, flying BA used to be such a pleasurable experience. They are now known in our office and at home as BA = Bl@@dy Awful. BA have cancelled or moved one leg of every journey we've booked this year. We are regrettably have to use other airlines now which have much better reliability and customer service."
  },
  {
    "reviewDescription": "Real time review… I have been flying ba for years and have not been on time on a single flight… it’s always because of catering being late … BA fix your catering this is embarrassing … ok we ‘ve left now after 5hours of waiting … bye"
  },
  {
    "reviewDescription": "They rudely refused my elderly in laws (76 years old) the special assistance line for check in because my in laws didn’t want a wheelchair."
  },
  {
    "reviewDescription": "I’m currently being held to ransom for a BA flight change through last minute .com\nI requested a flight change 2 weeks ago at a cost of 160 I accepted and was advised that it will take place in 4 days. A week later I receive a new email stating it will now cost 300 and I accepted and was required to wait 4 days.l so far no flight change. What’s your stop this process continuing until one the price is insanely high or two the flight is full?\nI made my request 2 weeks ago please honour this. As far as lastminute are concerned each time they state that the change request is being processed by the airline?? And they have no further input"
  },
  {
    "reviewDescription": "Arrived at my holiday destination with a luggage delay of 3 days for 3 of the family members.\nFlight cancelled to Glasgow at Heathrow so rescheduled it to a later flight which was an 11hr wait rather than 2. Compensation from BA was a £10 voucher which was extremely poor - that was meant to cover us for breakfast and lunch. Nowadays you probably cannot get a meal for £10 and under, maybe 10 years ago. To make it worse, the rescheduled flight was further delayed.\nSomething unrelated to BA, London Heathrow is probably the worse airport to stop at - so unorganised, passport/barding pass scanners defeat the purpose of efficiency as they always fail causing a pile up of travellers, and staff are extremely rude wherever you go.\nWhy would anyone pay for this level of service?"
  },
  {
    "reviewDescription": "i absolutely love this airline and will keep flying with them. I have flown with them for 9 years and are honestly the best . Our flight LHR-OSL was amazing and on time both ways . The service was impeccable and cant wait to fly with them again in December"
  },
  {
    "reviewDescription": "Why can I not use my travel voucher issued due to BA cancelling flights because of COVIT? I dont want the money back. Will be happy to use the voucher I was issued. Now they say it is no longer valid so I have lost all my money????"
  },
  {
    "reviewDescription": "Delayed BA flight Tenerife South to LGW. The only refreshment offered was a half glass water for a 4 hour flight. And a tiny slice of ‘banana cake’ that had a strongly cardboard texture and flavour.\n\nI am a BA Silver member, my partner Gold. We travel a lot with BA, but the decline in the last 5 years has been depressing and comprehensive. Many delayed or last minute cancelled flights wrecking plans. Dreadful communications. Absent customer service. Tired, frayed and dated cabins. An app that never works.\n\nShort haul now level with Ryanair at best. Long haul - probably Aeroflot.\n\nThis used to be a really excellent airline, but somewhere along the way they forgot the one thing that made them great- customer service."
  },
  {
    "reviewDescription": "I traveled to the US last month via British Airways. The flight attendant came to serve food, and I additionally asked for a drink. He said he will be back right, but disappeared. After about 30minuts, I pressed the call button and another flight attendant came to serve. I requested her for a drink and she said that they will serve drinks in another 15-20min, so please hold on. I said ok. She requested me to switch off the call button. I switched off the call button in good faith that she (or another colleague of hers) will return with a drink in a bit. No one came back until before the flight was about to land, when I got served water. I was left thirty for 7 hours on a 9 hours transatlantic British Airways flight on the Christmas eve."
  },
  {
    "reviewDescription": "You would think that if you had booked a holiday with your partner, so two seats, they would manage to assign you two seats together. But no, apparently that is not what you get, so for a 9 hour flight to our annual holiday I don't even get to sit next to my partner. Totally unacceptable."
  },
  {
    "reviewDescription": "For those who have managed to book flights but are otherwise delayed or stuck on runways I sympathise. I only wish to login to the BA site to see what I could book. Alas not possible because the BA site is not working (again)!\n\nBA is yet another organisation that has fallen into the trap of assuming FAQs and call centres will solve all their problems.\n\nFAQs generally list only the topics that organisations seem to think customers encounter - without giving any options for customers to describe topics that are not listed.\n\nI tried the BA 'helpline' number and followed the auto-messages to finally talk to someone. The first person tries to transfer me to another team that is 'supposed' to help - only for me to encounter another auto-message, at which point the call auto-terminates!\n\nThe second person advises that due to the high volume of calls to the 'helpline' my call has been diverted to her, who then tells me to try again later! No help at all really.\n\nMy answer to all this is that if any organisation is experiencing a high volume of calls to their helplines it means the services or products they are supposed to be offering are non-existant or faulty. Surely it is more cost effective to provide an efficient product and service than to spend millions on call centres who try - and fail - to provide some kind of resolution."
  },
  {
    "reviewDescription": "BA lost my luggage 10 days ago from a Ibiza to London city flight. The online tracker has not been updated after I was informed by customer service that it had been found still in Ibiza, this was nearly a week ago now and everyone I have spoke to since still says it was missing. I can’t understand how this sort of thing happens when I checked my bag In at the same time as my partner. I have special items and medication In that luggage that I need asap. Items that are in the bag are irreplaceable and the fact no one can give me an update as to where my belongings are is disgusting. After reading the reviews I can see that lost luggage is a regular occurrence with BA and I can guarantee I will never been using their service again. I might have considered staying a customer if their communication and updates would have be sufficient but making me wait with no update for this amount of time is awful."
  },
  {
    "reviewDescription": "Always helpful and obliging nothing but praise for these guys....."
  },
  {
    "reviewDescription": "Check in at Gatwick for Business class terrible. Hardly any staff on check in counters. Worse than most airlines economy check in. App is one of worst also and why do I need to pay even more to book a seat location at current inflated prices?"
  },
  {
    "reviewDescription": "Scammers! Bumped from a flight Orlando to London, Delayed for over 6hrs with 2 kids. Applied for the statutory compensation we are entitled to which amounts to over 1k. BA have failed, and failed and failed to process our application. Excuses constantly made which i initially gullibly believed. Now 10 months later I realise it was all just a deliberate ploy to avoid paying. I am now going to have to issue a claim in the court. BA should hang their head in shame."
  },
  {
    "reviewDescription": "The worst airline so far.\n\nPaid twice as what I would pay for the same flight with Ryanair, got the seats in the back without window, thought my head would explode during landing due to pressure.\n\nThought I would get a normal treatment as a Ukrainian (we don’t need visa to go to eu) got the same shitty Ryanair treatment with non existing visa check.\n\n\nAdditionally, was quite unlucky with my bag - had only one and was asked to keep it with me in my already quite claustrophobic due to window absence seat."
  },
  {
    "reviewDescription": "Cancelled flight. Awful customer service. Making customers wait for busses for hours in 30 degrees heat in Mexico. Advertised premium, even Ryanair is better"
  },
  {
    "reviewDescription": "My flight (BA 0239 on 18 Sept 22) was delayed by 15 hours. They refused to provide any compensation, because they said it was a 'technical problem'. I think this is illegal. It was certainly a terrible service (the management staff there were very rude to people, too)."
  },
  {
    "reviewDescription": "I cannot believe the amount of horrendous reviews I have read on this page regarding British Airways\n\nMy husband and I had two cancelled flights on Friday 1st July, where we had to seek alternative arrangements overnight in Pisa.\n\nThe flight was cancelled we were not even informed via e mail it was only when I went to check in online I was advised I would need to rebook on an alternative flight. This would of been a disaster if I had not tried to check in online as would not of known it was cancelled.\n\nWe were booked on a later flight BA0607 departing Pisa at 20.20. We were travelling with two other members of our family who were unable to check in online. On arrival at the airport we were informed that they had been bumped off of the flight completely as the flight was overbooked by 30 people which was a disaster as we had travelled to London Heathrow in their car.\n\nWe arrived at Pisa Airport in good time to be then advised that BA0607 had been further delayed to 23.30 then again until 01.30am on 02 August. we all finally boarded the plane to then sit on a hot plane on the runway for an hour and a half and then be advised by the pilot that the flight was cancelled again due to British Airways losing the slot.\n\nHe the advised they were struggling to get ground crew to get us off the plane with our baggage as Pisa Airport had closed. Finally the ground crew that were assisting the Easy Jet flight cam and got us off.\n\nThe pilot advised that we would all need to try and find our own accommodation for the night as there was nobody from British Airways to help at all. This was totally unacceptable considering we had already been separated from our family and even a disabled passenger was left to sit outside the airport all night.\n\nWe had to also find our own transport to the hotel which was difficult to get a taxi when the airport was closed.\n\nThe next day we received a text from British Airways advising the flight would leave at 2 pm, but again was delayed to 4 pm.\n\nI firmly believe that BA did not do enough to get us home on the same day, which is extremely disappointing as there were other flights departing that day from Florence and also an Easy Jet flight out of Pisa which left half empty as our friends had to book themselves onto this flight. You are normally my preferred airline but my views have changed after this trip."
  },
  {
    "reviewDescription": "Flight to Tenerife was cancelled the night before due to operational issues. Flights had to be booked via another airline which incurred last minute additional spending to us. I have been waiting for over 3 months now for my refund of money paid, Avios and Compensation. You cannot speak to anyone at BA you can only complete online forms. Nobody responds to you. Awful service, i've received better customer service from budget airlines."
  },
  {
    "reviewDescription": "We flew premium economy to NYC on the 10th of May. And what a pleasant experience that was. The plane was clean, fresh and modern, the air smelled clean, so first impressions were good. Then we were served snacks and a drink by a cheerful flight attendant. When I pointed out that there was milk in the snacks, she went and got me a bag of mixed nuts from the business class section. Then the meal came. I had pre-ordered a vegan meal for myself, my husband had a curry. The food was fantastic, everything was tasty and fresh. They even had soy milk for hot drinks. We want to thank BA and give Caroline a massive thank you as she went above and beyond to ensure the flight was a pleasant experience.\n\nWord of advice to BA, it might be time to find a better flight partner than AA as our return trip was below par."
  },
  {
    "reviewDescription": "Review of BA app which does not work .....\nWill not let me log in. Useless. I am sure my login details are correct, I restarted iphone, re-downloaded the app several times, cleared data from cache all to no avail. Budget airlines manage to have working app's! BA???? really?"
  },
  {
    "reviewDescription": "Our flight has been delayed for an hour, unacceptable when everyone is cramped in these tiny rows they call seats. The customer service is horrendous never ever fly with BA it’s a sugar honey ice tea airline, honestly your better off with EasyJet with Jess Glynn making you deaf the whole flight!😡"
  },
  {
    "reviewDescription": "I had a very disheartening experience flying with British Airways recently. Firstly, the staff at boarding were outright rude, lacking any sense of customer service or professionalism. This immediately set a negative tone for the flight.\n\nAdditionally, the airline’s policy on restroom access significantly impacted my comfort and convenience during the flight. Passengers without a First Class ticket were not allowed to use the bathrooms at the front of the plane, causing unnecessary congestion and discomfort. This rule resulted in long queues of over 15 people waiting for the two toilets at the back of the plane. The corridor was constantly crowded, making it difficult for passengers to navigate to and from their seats.\n\nAt one point, due to the cramped conditions in the corridor, a fellow passenger was forced to stand extremely close to me, invading my personal space significantly as others attempted to squeeze by. This was not only uncomfortable but also completely unacceptable. Imagine having an overweight person standing next to you, that tries to squeeze his ass on your space, bringing his ass next to your face, while trying to make space for a fellow passenger to walk by him to move back to his seat.\n\nOverall, my flight experience with British Airways was far from satisfactory. The treatment and policies displayed a lack of respect and consideration for passengers. I hope the airline reevaluates its customer service approach and policies to improve the experience for all passengers in the future."
  },
  {
    "reviewDescription": "British airways changed my booked seat without notifying us then placed 2 of our aisle seats to 2 middle seats. When we complained, the crew members were unhelpful and said they will complain on our behalf as they agreed with me it was an operational failure!\nI further complained about this and already chased once for a response. It's now been over 11 weeks and still no reply and unlikely to get a reply.\nCase number 01133502 and still waiting for your response!"
  },
  {
    "reviewDescription": "British airways equates cancelled and delayed flights. Horrible experience."
  },
  {
    "reviewDescription": "I was charged for an additional bag at Catania, DESPITE having a BA email receipt showing I had purchased the additional bag one week before my flight. The BA check-in at Catania said 'it wasn't on their system', and would not honour my receipt. I had to pay an additional €85 to get my bag onto the plane. Appaling service. Further damage is 8 WEEKs on and still no refund and it's still in the complaints queue!!\nI contacted BA 'customer service' online today, to complain about the dreadful service. They were not able to contact the team who review claims and comments as no-one is allowed to contact them!! So they referred me back to the complaints portal....goodness knows why as that is where I started. So I didn't get anything resolved and wasted 45 mins of my time.\nSean Doyle, you really need to look into your back office operations, and get it operating ASAP.\nForcing customers to pay double for something already purchased is outrageous."
  },
  {
    "reviewDescription": "Dubai to Heathrow. Cannot fault staff as so pleasant and professional. However, like others have mentioned the delays waiting on the ground to get off the flight was ridiculous. Got off and said to my partner that I’m not confident our bags will follow us to our connecting flight. Sure enough arrived at Newcastle and both cases still at Heathrow. Just to add there was a 30 minute delay departing to Newcastle. Oh and how could I forget they also cancelled our original flight from Dubai so we had to book another much earlier one. So inconvenient and pretty abysmal."
  },
  {
    "reviewDescription": "BA Lost then found luggage... refused to tell me where it was or how to get it back.\n\n- Lost luggage on return to London Gatwick\n- Unapologetic and dismissive about it, but promised to Courier it to me if found\n- Get home. BA call me up later and bark something like 'we have your bag, we will not courier it to you, its your fault, you have to come and pick it up' and then hang up on me. I didn't know who was calling/where from/how to get the bag.\n- BA don't update the lost luggage tracker info\n- BA don't answer about 200 calls to try and work out what is going on. BA Ignore emails and chat also.\n- Eventually I travel 200 miles back to Gatwick in the *hope* that i might be able to find it.\n- At the airport there is NO way to contact BA luggage at arrivals.\n- 10 members of British Airways staff at London Gatwick basically tell me to sod off and talk to someone else. 3 Tell me to go home and that they don't have my bag.\n- I only get heard when i eventually start making an embarrassing scene in the airport. The airport is chaos with no staff and people not being looked after\n- Eventually i borderline force someone to take me through security and passport control to Luggage Arrivals. My bag is sat *under their bloody desk* and they haven't bothered to update the tracker system. Again they are rude and unapologetic."
  },
  {
    "reviewDescription": "CAUTION - British Airways customers are being targeted by fraudsters who see them as potential victims against a backdrop of abysmal 'customer services'.\nAfter a negative review they make contact via a personal message mimicking British Airways. They request a phone number on the pretense that they want to discuss the experience (and no doubt will need bank details for compensation).\n\nI reported one scammer to Trip Advisor who have promptly taken the site down (perhaps British Airways could employ some of their Customer Service staff to do the job properly!).\n\n"
  },
  {
    "reviewDescription": "Hideous experience with British Airways trying to order an online meal. First of all trying to do it online. I couldn’t. Every time the screen said enter your Flight number it wouldn’t allow me. No explanation.\nI phoned up using a number of press this press that options until I got a human. After taking my details and verifying them, he said he couldn’t take payment over the phone and suggested that I do it in line. I gave up. What a pile of crap."
  },
  {
    "reviewDescription": "I agree with all those giving a 1 star review: emailed this morning that flight in 2 weeks cancelled. Followed instructions. Wasted time on phone that eventually pops up message that calls not being answered, try at a later date! This is after listening to platitudes about helping those travelling this month. Chatbot put me in touch with a person, I was 52nd in line. Half an hour to be contacted by Daniel who couldn’t help so joined a queue of just 12 but it took nearly 90 minutes for Joanne to touch base. To be fair to her she sorted reasonable alternative flights in a few minutes. It should not take 2 hrs to resolve. This is on the back of flights to Seville cancelled, alternatives a day before or after were £1000 more than the £500 originally paid. Still waiting for the refund 8 weeks later. At the gate at Heathrow last month when flight to Copenhagen cancelled and put on flight 8hrs later. Compensation for this has been received. I have booked on Quantas rather than BA to Oz and may take others’ advice and go on EasyJet or Ryan Air. Anyone want 280,000 Avios and an Executive Club Gold Card?\n\nThe leadership of BA must consider their positions as they are clearly incapable of providing a service."
  },
  {
    "reviewDescription": "Awful experience. Wrong information given when we discovered flight was cancelled. So disappointed. No confidence whatsoever in this company and will never use them again."
  },
  {
    "reviewDescription": "BA cancelled the final leg of my journey with less than 48 hours to go until I'm due to depart. They won't give me the option to amend my booking online and insist that I call them from Japan - no doubt to be held in a hold queue, being told that my call is 'very important to them'.\n\nUltimately, I will now be stranded in London awaiting my connecting flight for at least 4.5 hours, off the back of a previous 14 hour flight from Tokyo. Absolutely disgraceful.\n\nWhen the pandemic hit, many areas of the economy had to adapt quickly - schools, hospitals, public services, restaurants and care services to name but a few The fact that BA still cannot get their collective act together almost 3 years on speaks volumes about their competency as an organisation.\n\nI shall never be flying BA again if I can help it."
  },
  {
    "reviewDescription": "Absolutely appalling communication by both the refunds team and the customer service team. This relates to an appeal to BA to refund the cost of an upgraded flight which I cancelled, in October, due to a change in personal circumstances. I was fully prepared to forfeit the initial economy ticket price but not the upgraded fare to business. I gave over 12 weeks notice but BA were unmoving, however did state, in January, that it was under investigation. Now it’s 6 months on and still with no final response. Truly unacceptable, incompetent and totally without any service to the customer. Shame on you British Airways."
  },
  {
    "reviewDescription": "Had direct flights Edinburgh-Florence/ Florence-Edinburgh Sept 24- Oct 1st cancelled both ways! Outbound:- Unable to rebook online and failed 4 times to stay connected after 40 /30 minutes to Customer Services . No notification whatsoever until 20 minutes before boarding. Various reasons given (lack of staff, staff sickness, technical problems) but didn't believe any of them. We suspect they couldn't fill the plane. No food vouchers given at airport. No BA staff, but Menzies did help by booking us flights to London City, then we had to rebook from there(Amsterdam-Florence). All the responsibility was on us to sort out this mess. Arrived 9 hours later than expected.\nInbound- Again, cancelled, but informed by text 5 hours after flight due to leave! This time they rebooked 2 flights too many; impossible to confirm or reject any of them online, so tried Online Chat which actually was very good! Hotel overnight , taxi provided to airport and arrived home nearly 2 days later. KLM alternative flights were excellent.\nSo instead of direct flights we had ridiculous European diversions to London, Amsterdam and Paris. Overall a dreadful, highly stressful experience. Shockingly poor customer service. Amazed at how much BA has changed its operations and service in recent years. What a shame."
  },
  {
    "reviewDescription": "Massive change for BA and it’s not for the good . Recently flew to Washington From London Heathrow and everything was bad . We travelled club/business food was dreadful , cleanliness was non existent , the plane was so old there were ashtrays in the WC and the wc itself had lost all its colour and was just a brown hole . Incredible ."
  },
  {
    "reviewDescription": "Just returned from a long haul to Perth Australia, second leg of the trip from Singapore to Heathrow was absolutely amazing! May have helped that the plane wasn’t full so grabbed a row of three! Always had brilliant flights with BA, but this one was superb! The cabin crew and the guy who was our steward was amazing! They’ve had lots of issues but I can’t fault them on this long haul trip"
  }
]