[
  {
    "reviewDescription": "Check in was good...That's it! Mostly miserable, unwelcoming and missing staff all flight! Albeit first class attendants did smile! Travelled economy but worse than Ryan Air which at least you know what you are getting when you pay a cheaper price! And at least their staff are friendly! Seated in one of four seats, squashed in like sardines! Even moreso when ignorant passengers choose to recline seats and practically lay on your lap! Seat reclining should be banned! I managed! Practically ignored by miserable staff even when I always pleasantly smile! Food was inedible, cold and conjealed. When I did pleasantly complain asking for more nuts/pretzels I was told \"nobody else has complained and no snacks left!\" Fabulous customer care! No offer of drinks other than with food, had to call for service! Attitude was of rolled eyes \"you woke me up!\"Second flight with BA and now I remember why I have never rushed back! BA could learn so much from Emirates, Singapore, Etihad, Air New Zealand and any American Airline. My flight to Cape Town with BA was one of my most uncomfortable ever! I will definitely be trying a cheaper option next time I fly to SA and take my own food. I'm sure it cannot be any worse!\n"
  },
  {
    "reviewDescription": "SCAMMER THEY NEVER GAVE MY BACK MY MONEY AND THEY TOLD ME A CHEQUE HAS BEEN SHORTLY WITH ME..THIS WAS 22ND OF DECEMBER"
  },
  {
    "reviewDescription": "Can't upload covid documentation via the app, clicking on the link in email, orusing Chrome. So I can't check in online. Last time this happened I was downgraded and I'm still waiting for compensation 11 weeks later. This is the response: Error 403 - You don't have enough permissions to proceed further\n\nWhat a useless airline"
  },
  {
    "reviewDescription": "Case Number 02338330\n\nWhen dropping off my luggage at the luggage drop off at Toulouse airport, I had my travel pram confiscated from me and I was forced to take my sleeping 2 year old in my arms while traveling alone with him at 5.30am. I was told by the staff outsourced by British Airways to check in passengers (therefore an extension of your company) that only yoyo prams were accepted on board. I corrected her that it was \"yoyo type\" prams but she contested and told me that only yoyo prams would be allowed and if I insisted to keep my sleeping 2-year-old in his pram I would not be permitted to board the flight to London. This happened to 2 other families (that I know of) and we were forced to go to the oversized baggage area of the airport. To clarify my pram is the Silver Cross Jet stroller pushchair which I specifically purchased as it is conform to the British Airways specifications. I was then required to carry my toddler for 30 mins through security, and then again for another 40 mins while waiting to board the plane (I was \"allowed\" early boarding only to be moved from my seat to stand on the other side of the staff with no more options to sit down). At Heathrow, I was then required to carry my toddler again for approx. 40 mins to go through passport check and luggage claim (as mentioned previously, I was traveling alone with my child with no other support). All this, despite purchasing a very expensive pram to fit to your requirements and coming to the airport prepared with this pram. I'm sure you agree this is unacceptable and it is illegal to force passengers to purchase a specific brand of products in order to be able to keep their child in their travel pram. It is also illegal to discriminate against passengers because they have \"dared\" to travel with children.\n\nIn addition to this, once on the plane, I installed my Kids Fly Safe Cares Child Airplane Safety Harness for my son. The cabin crew then proceeded to tell me this was not allowed. I had to go on the website to show them that this was incorrect and I was in fact within my rights. Then, for landing, your crew had the gall to tell me to put the harness on my son and that it was \"mandatory\" to which I asked, if it was mandatory why did I bring the harness myself. It is also important to note that my son was not given a life jacket when boarding the plane which is against regulation.\n\nBasically, I was treated like a criminal during my entire journey and my crime was having a toddler. British Airways is by far the most discriminatory airline for parents traveling with children and this needs to change immediately, especially considering that I paid the same price as an adult for my 2-year-old to be on that flight and he was treated like an inconvenience.\n\nMy advice; don't treat a mom traveling alone at 5am with a sleeping toddler like rubbish, and don't confiscate her travel pram that is within regulation forcing her to have the worst travel experience possible."
  },
  {
    "reviewDescription": "Great in flight entertainment. Lost luggage but they found it and returned it. Customer service impossible to get hold of from abroad and not helpful. But flight was great."
  },
  {
    "reviewDescription": "Flew on 7/12 Madrid to London, chaps, rude and unhelpful staff, awful service, no apology. Shameful display."
  },
  {
    "reviewDescription": "As ever, cabin crew were grumpy and snooty.. seems the norm with BA. Will post again when I encounter a friendly member of cabin crew."
  },
  {
    "reviewDescription": "In Turkey and need to change flight. Tried Manage Booking, can’t change anything online, told to call. Tried chat, can’t process anything on line, told to call. Called, told wrong team and passed through to different team. Told they can’t help as pre-travel. Given email which rejects emails (later told shouldn’t have been given this email). Called again. Told to refer to text sent when we travelled…just after we told them phone has been stolen. Called again, given a couple of numbers (apparently they change them so customers don’t keep calling!). Neither worked. Beyond incompetent."
  },
  {
    "reviewDescription": "My husband and I booked with BA for our holiday to Tobago in January and flew economy. No problems, good food, comfy seats, great movies and friendly staff. We're using them again to go to the Maldives next year. Sorry to read all these bad reviews."
  },
  {
    "reviewDescription": "So, during last month , i sent a complaint by email to Calum Lamming the director of the BA couldnt give a damm department. The complaint was in regards to my daughters lost luggage and lack of care regards her late fight and onward journey chaos. After departing on the 9th of June, my daughter will return this week and still BA/Callum Lamming do not respond to emails. BA used to be the airline that meant something and one that you were proud to fly with, not anymore."
  }
]