[
  {
    "reviewDateOfExperience": "2025-01-17",
    "reviewTitle": "Absolutely horrible",
    "reviewRatingScore": 1,
    "reviewSummary": "The review expresses extreme dissatisfaction with the airline, criticizing its high prices, the condition of the planes, and the quality of customer service, while noting that the only competent aspect is the pilot."
  },
  {
    "reviewDateOfExperience": "2024-06-21",
    "reviewTitle": "BA YOU SHOULD BE ASHAMED OF YOURSELVES",
    "reviewRatingScore": 1,
    "reviewSummary": "A flight from Edinburgh to Rome via London Heathrow experienced significant delays due to passengers deciding not to fly and a broken conveyor belt, leading to a missed flight slot and a 7-hour delay at Heathrow. Despite being shown available seats on an earlier flight, the passengers were denied switching and after extensive communication, were initially promised compensation by the airline, but later only offered to cover extra taxi fare, leading to frustration over the handling of the situation."
  },
  {
    "reviewDateOfExperience": "2025-01-16",
    "reviewTitle": "BRITISH AIRWAYS AWFUL SERVICE",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer experienced significant disappointment with British Airways after paying for a seat upgrade for more legroom due to bad knees, only to be reassigned to a regular seat without explanation and facing difficulties in obtaining a refund. Despite filing a claim upon return, the customer has waited almost 3 months without reimbursement, encountering unhelpful customer service and communication barriers, including ineffective interactions with a chat robot and an inability to contact the relevant department directly."
  },
  {
    "reviewDateOfExperience": "2024-11-17",
    "reviewTitle": "British Airways happy to 'steal' from customers! Appalling treatment!",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer experienced significant frustration with British Airways' complex and inconsistent procedure for booking an additional seat for a cello, leading to misinformation and wasted time. Despite previous successful bookings, the confusion around the airline's policies and lack of staff knowledge resulted in the inability to book a cello seat alongside a passenger, perceived lack of empathy from the staff, and a refusal to refund £76 paid for a seat based on incorrect guidance, culminating in a strong admonishment of the airline's customer service."
  },
  {
    "reviewDateOfExperience": "2025-01-06",
    "reviewTitle": "DO NOT FLY WITH BA!",
    "reviewRatingScore": 1,
    "reviewSummary": "Despite arriving on time for a connecting flight from NCL to LHR, the passenger experienced a significant delay of 2 1/2 hours at baggage reclaim, leading to a missed connection and incurring additional costs for rebooking, accommodation, and meals. The lack of assistance from the BA service desk and unresponsiveness to complaints further exacerbated the customer's frustration with the overall poor service."
  },
  {
    "reviewDateOfExperience": "2024-10-16",
    "reviewTitle": "Very poor customer service",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer experienced very poor customer service with their flight cancellation, leading to limited communication and additional incurred costs. They also received no compensation from BA nor assistance with obtaining necessary information for a travel insurance claim."
  }
]