[
  {
    "reviewDateOfExperience": "2025-01-17",
    "reviewTitle": "Absolutely horrible",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses extreme dissatisfaction with the airline's prices, planes, and customer service, except for the pilot.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-06-21",
    "reviewTitle": "BA YOU SHOULD BE ASHAMED OF YOURSELVES",
    "reviewRatingScore": 1,
    "reviewSummary": "A flyer experienced significant delays due to a technical issue and passenger change, leading to a missed connection and poor customer service, including a difficult compensation process with the airline.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-16",
    "reviewTitle": "BRITISH AIRWAYS AWFUL SERVICE",
    "reviewRatingScore": 1,
    "reviewSummary": "After purchasing a seat upgrade for more legroom due to bad knees, the airline reassigned the reviewer to a regular seat and has not refunded the difference after 3 months, compounded by poor customer service.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2024-11-17",
    "reviewTitle": "British Airways happy to 'steal' from customers! Appalling treatment!",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer expresses extreme frustration and anger due to the complicated and ultimately unsuccessful process of booking an additional seat for a cello on British Airways, accusing them of poor customer service and refusing a refund.",
    "journeyStep": "Adding extras to the booking"
  },
  {
    "reviewDateOfExperience": "2025-01-06",
    "reviewTitle": "DO NOT FLY WITH BA!",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced significant delays in baggage retrieval causing them to miss a connecting flight, incur additional expenses, and received no assistance or response from the airline's customer service.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-10-16",
    "reviewTitle": "Very poor customer service",
    "reviewRatingScore": 1,
    "reviewSummary": "Flight was cancelled with limited communication, incurring additional costs without compensation or support for insurance claims from the airline.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-10-01",
    "reviewTitle": "Ridiculously expensive seats and luggages",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer expresses frustration over unexpected costs for seat selection and luggage, and dissatisfaction with the airline's lack of response to complaints and reviews.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-16",
    "reviewTitle": "What a joke of a company",
    "reviewRatingScore": 1,
    "reviewSummary": "This review expresses extreme dissatisfaction with various aspects of the airline, from booking troubles, poor customer service, devaluation of loyalty points, to subpar in-flight experiences. The reviewer also criticizes the company's leadership and compares the airline unfavorably with competitors.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-09",
    "reviewTitle": "BA data breach & account hacked no help",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer's airmiles account was hacked, and despite numerous contacts with BA to address the hacking and the stolen airmiles, resolution was slow, resulting in the customer being forced to purchase tickets with another airline. BA's communication and response deficiencies have left the customer seeking further action regarding the data breach.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-11-08",
    "reviewTitle": "Zero stars is not an option sadly",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced a frustrating ordeal with BA after a Loganair flight booked through BA was cancelled following a 3-hour delay, leading to over 70 days of disputing the cancellation versus delay status for a refund, highlighting poor customer service and inefficient complaint resolution.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2024-12-27",
    "reviewTitle": "No loyalty",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer is deeply disappointed with BA for not honoring an earned companion voucher due to their Executive Club's portal issues and feels the Avios scheme lacks proper loyalty rewards, leading to boycotting the airline.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2025-01-05",
    "reviewTitle": "Just wanted to say how good the cabin…",
    "reviewRatingScore": 5,
    "reviewSummary": "The reviewer expresses high satisfaction with the exceptional service provided by the cabin crew, especially Molly and Julie, as well as the pilots on their San Francisco to London Heathrow flight.",
    "journeyStep": "Arriving at the airport"
  },
  {
    "reviewDateOfExperience": "2025-01-14",
    "reviewTitle": "Flying back from Schipol in The…",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer experienced significant frustration when attempting to change to an earlier flight at the airport, resulting in confusion, an unintended cancellation, and a refusal for accommodation despite willingness to pay, ultimately wasting the customer's time and highlighting poor service.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-17",
    "reviewTitle": "Flights cancelled took 5 days and 1hr a…",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer experienced significant disruptions due to flight cancellations, incurring additional costs and receiving poor customer service from the airline.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-07-05",
    "reviewTitle": "Outstanding service when flying to…",
    "reviewRatingScore": 5,
    "reviewSummary": "Exceptional service experienced on a round trip to the United States, notably the respectful and kind treatment towards a disabled passenger from beginning to end.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-11-15",
    "reviewTitle": "Our flight was very late Manchester to…",
    "reviewRatingScore": 1,
    "reviewSummary": "Flight was significantly delayed, resulting in missed connections and the incurrence of £408 in extra costs, with the staff displaying no empathy and refusing to refund the additional expenses.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "Never again … an abysmal airline",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer had an extremely uncomfortable and unsatisfactory experience with BA on a long flight due to very uncomfortable seating, insufficient amenities, poor food quality, and post-flight delays due to a lack of bus drivers, all of which was deemed unacceptable especially considering the high cost.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "We had such a great experience with BA…",
    "reviewRatingScore": 5,
    "reviewSummary": "The customer had a pleasant experience with BA, highlighting the kindness and helpfulness of the staff during flight changes due to illness and LA wildfires.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "Fabulous service Heathrow to Madrid",
    "reviewRatingScore": 5,
    "reviewSummary": "Despite a 1.5-hour delay in taking off from Heathrow to Madrid, the crew, especially Captain Gary and flight attendants Diego and Olivia, offered exceptional service including free champagne to celebrate a passenger's birthday, making the experience memorable.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-13",
    "reviewTitle": "2 hours to reschedule a flight - without success!",
    "reviewRatingScore": 1,
    "reviewSummary": "The review describes a frustrating experience trying to reschedule an Avios reward flight with British Airways, including being rerouted across multiple hotlines.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-09-12",
    "reviewTitle": "Terrible treatment on a business class…",
    "reviewRatingScore": 1,
    "reviewSummary": "Received terrible treatment and poor customer service on a business class flight; including being seated separately without the possibility to change, leading to distress, and difficulty obtaining a refund for pre-selected seats.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-13",
    "reviewTitle": "Access to BA customer service",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer struggles to obtain a receipt for flights with BA, facing unresponsive service cases and disconnected live chats, leading to frustration and loss of faith in the airline.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-26",
    "reviewTitle": "Came here to write a one star review",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer is extremely dissatisfied with British Airways due to flight cancellations without alternatives, leading to a costly rebooking with another operator and an ignored complaint.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-09",
    "reviewTitle": "No catering on flight in business class",
    "reviewRatingScore": 1,
    "reviewSummary": "BA ignored and closed a complaint about the lack of catering on a business class flight without notifying the customer, leading to severe disappointment and reconsideration of future support.",
    "journeyStep": "Making follow-up complaints"
  },
  {
    "reviewDateOfExperience": "2024-12-30",
    "reviewTitle": "BA reveal themselves as vicious and uncaring",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced significant disruption with flight delays and cancellation, leading to a compromised accommodation situation that was not adequately resolved by the airline, highlighting a severe lack of customer service and protection.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-11-17",
    "reviewTitle": "This started with a cancelled flight",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced a sudden, unexplained cancellation of their return flight with difficulties in rebooking, incurred extra costs which were not promptly addressed, and faced customer service inadequacies, leaving them extremely frustrated.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-12",
    "reviewTitle": "Like many people said",
    "reviewRatingScore": 1,
    "reviewSummary": "The review expresses extreme dissatisfaction with the airline due to arrogant and extremely rude staff, lack of helpfulness, disorganization, and reduced services leading to being stranded.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-12",
    "reviewTitle": "Dear OWNERS of British Airlines",
    "reviewRatingScore": 1,
    "reviewSummary": "The passenger experienced significant flight delays and poor staff behavior including rudeness, specifically pointing out an incident with a chief flight attendant, leading to a diminished view of British Airways.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-12",
    "reviewTitle": "Great service",
    "reviewRatingScore": 5,
    "reviewSummary": "Lindsey provided exceptional service during the rebooking of a holiday, making the process simple and demonstrating great patience.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-12",
    "reviewTitle": "Unfriendly food disgusting hardly any…",
    "reviewRatingScore": 1,
    "reviewSummary": "The service on the long-haul flight was poor with unfriendly staff, disgusting food, and inadequate beverage services.",
    "journeyStep": "Arriving at the airport"
  },
  {
    "reviewDateOfExperience": "2025-01-11",
    "reviewTitle": "BA worst airline in the WORLD!!",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer expresses extreme dissatisfaction after their flight was cancelled for 'Commercial Reasons,' leading to significant additional expenses and a declined compensation claim. They vow to pursue legal action and highlight the irony of paying for a replacement flight that indirectly funded the same airline.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "Very disappointing flight",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced unresponsive and unfriendly service, disappointing in-flight meals, uncomfortable seating, and issues with seat selection and upgrade, all during their flight with British Airways.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-11",
    "reviewTitle": "Poor customer service",
    "reviewRatingScore": 1,
    "reviewSummary": "Encountered frustrating inconsistencies in cost calculations and unprofessional attitudes from staff during multiple attempts to resolve a booking issue, in stark contrast to the positive experience with Virgin Atlantic's customer service.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "They get such a slating but I actually like them and recently had a great experience with them",
    "reviewRatingScore": 5,
    "reviewSummary": "The customer's experience has significantly improved.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-03-13",
    "reviewTitle": "HORRIBLE CUSTOMER SERVICE",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer endured a frustrating experience trying to receive a refund from a canceled booking, enduring months of misleading information and poor customer service without satisfactory resolution.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2025-01-04",
    "reviewTitle": "Such arrogant staff and poor service all in all",
    "reviewRatingScore": 1,
    "reviewSummary": "The review describes an extremely negative experience with arrogant staff, poor and inadequate food, and unsatisfactory facilities and entertainment on a long-haul flight, resulting in no positive takeaway.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-08",
    "reviewTitle": "Possibly the Worst Website a Mediocre Airline Ever Had",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced multiple delays, missed flights, and the airline lost their bag twice, highlighting a series of negative experiences including poor website functionality.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-28",
    "reviewTitle": "Efficient helpful professional airline",
    "reviewRatingScore": 5,
    "reviewSummary": "The customer had a positive booking experience and praises the customer service desk at Sydney airport for exceptional support with a flight change.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "Don’t fly Ba you will never get onward taxi transport",
    "reviewRatingScore": 1,
    "reviewSummary": "The flight to Austin was cancelled unexpectedly, leading to a loss of £150 for the reviewer, who vows to refuse future bookings for clients flying with BA.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-08",
    "reviewTitle": "Gobsmackingly inept company",
    "reviewRatingScore": 1,
    "reviewSummary": "Experienced extreme frustration with British Airways' lost and found service and complaint submission process, encountering unresponsive contact methods and inoperative online forms.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "British Airways should leave the service industry",
    "reviewRatingScore": 1,
    "reviewSummary": "A delayed flight resulted in missed connections and significant distress for the travelers, compounded by poor customer service and humiliation by airline staff, affecting the traveler's important personal event and health.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "Last 2 flights lost all bags",
    "reviewRatingScore": 1,
    "reviewSummary": "Passenger experiences severe inconvenience and poor customer service leading to missing a connecting flight at Heathrow T5, with staff displaying unhelpful and dismissive behavior.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "No rules or regulations?",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer frustrated by unclear baggage fees and the absence of consistent regulations, leaving charges to the discretion of check-in staff.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-10-14",
    "reviewTitle": "AVOID",
    "reviewRatingScore": 1,
    "reviewSummary": "The review expresses frustration over the airline ignoring their situation regarding a need for immediate travel due to a medical emergency.",
    "journeyStep": "Making follow-up complaints"
  },
  {
    "reviewDateOfExperience": "2025-01-08",
    "reviewTitle": "An update and warning for those waiting for compensation and refunds from BA",
    "reviewRatingScore": 1,
    "reviewSummary": "After a cancellation due to technical faults leading to a 21-hour delay, the customer experienced poor service from BA's customer service, including being cut off multiple times and informed of a 2 to 3 months wait for claim processing.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2025-01-04",
    "reviewTitle": "Great Flight. Great Crew.BA0662",
    "reviewRatingScore": 5,
    "reviewSummary": "Exceptionally positive experience with British Airways from efficient check-in and boarding to attentive and caring service for a disabled passenger throughout the flight.",
    "journeyStep": "Arriving at the airport"
  },
  {
    "reviewDateOfExperience": "2024-12-22",
    "reviewTitle": "Horrible experience with someone with autism",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer felt abused by Heathrow security and British Airways staff during a negative encounter on December 22nd, emphasizing a particularly horrible experience with a security person.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-01-08",
    "reviewTitle": "The worlds worst airline (after Ryan…",
    "reviewRatingScore": 1,
    "reviewSummary": "Frustration due to high demand on the airline's website preventing timely booking.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2024-09-20",
    "reviewTitle": "Lack of customer care",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer expresses deep disappointment with BA after a cancelled flight led to missing an important family occasion and an unresolved request for compensation of the fare difference, despite a supposed full refund.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2025-01-08",
    "reviewTitle": "Worst airline in the uk",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses strong dissatisfaction with both the airline overall and its customer service, labeling it the worst in the UK.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-08",
    "reviewTitle": "I'd like to thank Kate Roche in…",
    "reviewRatingScore": 5,
    "reviewSummary": "Kate Roche in Customer Services provided exceptional assistance by combining two separate booking references to ensure a customer and their father were seated together, demonstrating outstanding manner and knowledge.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-07",
    "reviewTitle": "BA is killing itself off.",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses frustration and disappointment with British Airways' new loyalty scheme changes, feeling they make it significantly harder to qualify for Bronze despite years of loyalty.",
    "journeyStep": "Discovering the airline"
  },
  {
    "reviewDateOfExperience": "2025-01-08",
    "reviewTitle": "A final nail in the coffin!",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer is extremely dissatisfied with recent changes to the airline's rewards program, feeling betrayed and announcing intentions to leave the loyalty program.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2025-01-08",
    "reviewTitle": "Appalling Service from Customer Relations Team regarding a refund",
    "reviewRatingScore": 1,
    "reviewSummary": "Experienced appalling service from the Customer Relations team over a refund issue for a hold bag, leading to a decision not to use the airline in the future.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "I can't believe what used to be the…",
    "reviewRatingScore": 1,
    "reviewSummary": "A long-time loyal BA customer expresses frustration over being charged to seat his children next to him due to separate bookings, a problem arising from using a Companion Voucher and Barclays Upgrade, leading to contemplation of switching to Qatar Airways.",
    "journeyStep": "Making follow-up complaints"
  },
  {
    "reviewDateOfExperience": "2024-07-24",
    "reviewTitle": "I honestly cannot believe this company…",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer experienced over a 4-hour flight delay and misplaced baggage, followed by a lack of response from the airline to multiple complaints and a struggle to contact the complaints department.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-22",
    "reviewTitle": "We were booked to sit upstairs on the…",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer expresses frustration over being moved from their paid preferred seating without notification, leading to disappointment and no refund provided, spoiling the start of their Christmas holiday.",
    "journeyStep": "Selecting preferred seats"
  },
  {
    "reviewDateOfExperience": "2025-01-07",
    "reviewTitle": "They couldn’t care less",
    "reviewRatingScore": 1,
    "reviewSummary": "Flight was significantly delayed, resulting in an unexpected late landing, additional travel, and issues with luggage, coupled with poor customer service.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-01-07",
    "reviewTitle": "Unprofessional",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced multiple issues including a non-functional charger input, misleading directions at Sydney airport leading to missing a connecting flight, inadequate customer service from British Airways including a poorly timed compensation voucher, and difficulties obtaining a refund through a third-party company during COVID-related cancellations.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-03",
    "reviewTitle": "Poor service and no reward for loyalty",
    "reviewRatingScore": 1,
    "reviewSummary": "Experienced a significant delay in receiving priority luggage and dissatisfaction with recent executive club changes, leading to a decision to stop flying with the airline. Complaints made were not addressed, highlighting a decline in service quality and overall disappointment with the airline.",
    "journeyStep": "Making follow-up complaints"
  },
  {
    "reviewDateOfExperience": "2024-12-28",
    "reviewTitle": "Where to start 😡",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses strong frustration with BA due to cancelled and delayed flights, poor communication, and unhelpful staff attitudes, vowing never to fly with them again.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-03",
    "reviewTitle": "BA what a change in 25years!",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses strong disappointment with BA, noting significant decline in quality, including issues with the aircraft's condition, crew, amenities, and operational delays, leading to a decision not to fly with them again.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-03",
    "reviewTitle": "Had an issue through no fault of BA and…",
    "reviewRatingScore": 5,
    "reviewSummary": "The staff were helpful and understanding in rebooking flights for a party with older people without mentioning extra fees.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-04",
    "reviewTitle": "Incompetent service, & fail to respond to written complaint",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer faced flight cancellation, received false information about alternative flights, and experienced unhelpful customer service from BA, leading to cancellation of the entire booking and unresolved complaint despite contacting BA.",
    "journeyStep": "Making follow-up complaints"
  },
  {
    "reviewDateOfExperience": "2025-01-06",
    "reviewTitle": "A NIGHTMARE FOR OUR FAMILY!!!",
    "reviewRatingScore": 1,
    "reviewSummary": "Family's journey with British Airways from Prague to Los Angeles turned into a nightmare due to a 10-hour flight delay, a 48-hour layover, inadequate customer service, and poor accommodation handling, causing significant inconvenience and distress.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-11-23",
    "reviewTitle": "Overbooked and involuntarily canceled…",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer's flight to a funeral was cancelled due to overbooking, leading to significant financial loss and frustration due to no refund, rebooking options, or satisfactory customer service response.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-06",
    "reviewTitle": "Absolutely Shocking Customer Service for Refund",
    "reviewRatingScore": 1,
    "reviewSummary": "Flight cancelled 12 hours before departure, led to alternative arrangements and substantial inconvenience, with poor customer service and unresolved compensation claims.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-06",
    "reviewTitle": "Worse than Ryanair",
    "reviewRatingScore": 1,
    "reviewSummary": "The airline is compared unfavorably to a low-cost carrier, criticized for its high prices, problematic website, and inadequate customer service.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-10-14",
    "reviewTitle": "Avoid when possible",
    "reviewRatingScore": 1,
    "reviewSummary": "The airline cancelled the reviewer's flight due to operational issues, later falsely claimed it was weather-related to avoid compensation, and disappointed the reviewer with their policy on not including hold luggage for long-haul flights.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-10-11",
    "reviewTitle": "Overbooked flight",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer was put on standby and had to fly 24 hours later due to overbooking, incurring extra expenses, and received no response to their complaints.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2025-01-05",
    "reviewTitle": "Awful experience",
    "reviewRatingScore": 1,
    "reviewSummary": "Experienced significant delays during check-in and flight, along with lost luggage issues in Barcelona, compounded by unresponsive customer service.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-05",
    "reviewTitle": "Terrible changes to BA Executive Club",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer is dismayed by the changes to BA Executive Club's Silver Status requirements, feeling betrayed after decades of loyalty and considering switching airlines.",
    "journeyStep": "Evaluating airline reviews"
  },
  {
    "reviewDateOfExperience": "2024-12-31",
    "reviewTitle": "The best of the best - our pilot.",
    "reviewRatingScore": 5,
    "reviewSummary": "The reviewer expresses admiration for the pilot's skill during a particularly challenging landing, amid overall critiques of British Airways' decisions impacting its staff and product quality.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-04",
    "reviewTitle": "Disgrace Great British Airways",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses severe dissatisfaction with Great British Airways, citing delayed flights, begrudging service from the steward, significant luggage waiting times, and unhelpful airport customer service.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-16",
    "reviewTitle": "Smooth ride",
    "reviewRatingScore": 5,
    "reviewSummary": "The reviewer expresses deep appreciation for the exceptional care and assistance provided by the airline, including medical support and wheelchair assistance, contributing to a smooth and reassuring travel experience.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-06-28",
    "reviewTitle": "One of the worst airlines, ashamed its British",
    "reviewRatingScore": 1,
    "reviewSummary": "BA's mishandling of a honeymoon flight led to missed days and additional expenses, with ineffective customer service and communication about complaints, leading to a loss of customer trust and calls for regulatory intervention.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-04",
    "reviewTitle": "BA has gone from bad to worse- even…",
    "reviewRatingScore": 1,
    "reviewSummary": "Experienced terrible customer service and excessive baggage wait times at LHR; was informed by the staff that long waits are normal and that checking a bag was a foolish decision.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-11",
    "reviewTitle": "Autistic son assaulted by cabin crew",
    "reviewRatingScore": 1,
    "reviewSummary": "A customer alleges a serious incident on a flight where their autistic son was assaulted by a cabin crew member, expressing frustration over the lack of response from the airline.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-28",
    "reviewTitle": "I have been waiting nearly 2 weeks for…",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer is extremely disappointed due to no response from BA customer services for nearly 2 weeks after attempting to correct a booking mistake.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-10-18",
    "reviewTitle": "Still waiting for Refund",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses significant frustration with British Airways' customer support, citing inefficiency and lack of helpfulness in processing a family seat downgrading refund since October 18th, contrasting it with the positive experience with onboard staff.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2025-01-03",
    "reviewTitle": "Where are the £539 holidays to st kitts…",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer is frustrated because they cannot find the advertised £539 holidays to St. Kitts despite trying multiple dates and airports.",
    "journeyStep": "Evaluating airline reviews"
  },
  {
    "reviewDateOfExperience": "2025-01-03",
    "reviewTitle": "Shit",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses frustration over the disorganization, leading to hours wasted at the airport.",
    "journeyStep": "Arriving at the airport"
  },
  {
    "reviewDateOfExperience": "2025-01-03",
    "reviewTitle": "The worst customer service",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer had a very negative experience with extremely poor customer service and criticized the lack of seating comfort and removal of overhead air fans as cost-cutting measures.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-30",
    "reviewTitle": "bad crew member David",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced rudeness and unprofessionalism from the crew on their flight from JFK to London Heathrow, with a specific incident involving a crew member named David who loudly refused to address their discomfort caused by another passenger's reclined seat.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "Atrocious",
    "reviewRatingScore": 1,
    "reviewSummary": "The review expresses extreme dissatisfaction with the airline's pricing, ground staff, and customer service.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-01",
    "reviewTitle": "The only gripe I have is their policy…",
    "reviewRatingScore": 3,
    "reviewSummary": "The customer is frustrated with the hand luggage policy leading to cramped legroom due to oversized suitcases in the cabin.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2025-01-03",
    "reviewTitle": "Greed",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer expresses extreme dissatisfaction with being charged an additional £336 to pre-assign seats after purchasing two Business Class seats for over £6000, criticizing the airline's management and practices.",
    "journeyStep": "Selecting preferred seats"
  },
  {
    "reviewDateOfExperience": "2024-12-05",
    "reviewTitle": "Baby not allowed in a lounge with Gold Card!",
    "reviewRatingScore": 1,
    "reviewSummary": "Experienced disappointing service, including lounge access issues, lack of assistance with a baby stroller, and slow response times to assistance requests on a flight with a 3-year-old.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-10-15",
    "reviewTitle": "Pathetic and misleading customer service",
    "reviewRatingScore": 1,
    "reviewSummary": "Experienced luggage delay and damage with poor follow-up on compensation claims, leading to frustration.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "Shocking customer service - Lies and no complaints procedure",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer service agents were dishonest and rude, and the complaints process is ineffective, leading to frustration and a decision to avoid future bookings with the airline.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "The slowest most clunky IT of any airline",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses extreme frustration with the airline's IT systems, highlighting the slow and unreliable app and website, difficulties linking membership benefits to bookings, and compares the airline's inferior online check-in process unfavorably with budget airlines.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2025-01-01",
    "reviewTitle": "Truly the WORST airline out there - 0 stars!!!",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses extreme dissatisfaction with British Airways' customer service, highlighting a lack of accountability among staff and a non-responsive complaints system.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "Paid for extra legroom (£24) on website…",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer is frustrated after paying for extra legroom but not receiving it and finds contacting customer service for resolution impossible, swearing never to fly with the airline again.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-08-30",
    "reviewTitle": "DO NOT FLY BA IF YOU CAN AVOID IT",
    "reviewRatingScore": 1,
    "reviewSummary": "After paying to upgrade for comfort due to a recent hip replacement, the reviewer was involuntarily downgraded without a clear explanation or satisfactory compensation from the airline, leading to a frustrating and drawn-out process for refunding the difference between economy and premium economy fares.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "BA change my flight and give me a 5…",
    "reviewRatingScore": 1,
    "reviewSummary": "BA changed the customer's flight to a longer connection and then charged £300 plus fare difference for switching to a more convenient flight, disappointing the customer with long wait times and perceived unreasonable costs.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2025-01-01",
    "reviewTitle": "British Airways - Disgraceful National airline!",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced a last-minute cancellation of their flight from Heathrow to Johannesburg without prior notice, attributing this to an alleged 'technical issue' similar to past incidents, and expresses frustration over the airline's repeated delays and poor handling of compensation claims.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-31",
    "reviewTitle": "My Sister & Brother-in-law travelled…",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses disappointment over the airline's lack of complimentary treats for New Year's Eve, labeling them stingy.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-08-01",
    "reviewTitle": "Transfer delays from Heathrow to local…",
    "reviewRatingScore": 1,
    "reviewSummary": "Passenger experiences significant delays and issues during a flight transfer at Heathrow, leading to missed connection, lost luggage, and dissatisfaction with staff and process, despite on-time initial flight.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-07-08",
    "reviewTitle": "Insect Infestation On Board / 7 months…",
    "reviewRatingScore": 1,
    "reviewSummary": "A family suffered health issues due to an insect infestation on a flight, with no subsequent resolution from the airline despite multiple contacts and an ongoing legal process.",
    "journeyStep": "Making follow-up complaints"
  },
  {
    "reviewDateOfExperience": "2024-12-20",
    "reviewTitle": "very expensive",
    "reviewRatingScore": 3,
    "reviewSummary": "The review expresses dissatisfaction with the high prices compared to low-cost airlines offering similar services for cheaper fares.",
    "journeyStep": "Evaluating airline reviews"
  },
  {
    "reviewDateOfExperience": "2024-12-31",
    "reviewTitle": "Here are my experiences of last 3…",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer faced repeated issues with British Airways, including forgotten and left behind luggage in two separate instances, and a cancelled flight followed by chaotic reassignment efforts by the staff.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-27",
    "reviewTitle": "Lost my bag and made me incur several additional fees",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer's holiday was ruined due to British Airways' mishandling of their luggage, lack of assistance, and subsequent poor customer service, resulting in stress and frustration without resolution.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-08",
    "reviewTitle": "Shocking customer care and…",
    "reviewRatingScore": 1,
    "reviewSummary": "Passenger expresses extreme dissatisfaction with BA's handling of a significant delay for flight 154 from Bridgetown to London, citing poor customer care, lack of honesty, and insufficient support for stranded passengers, including vulnerable individuals.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-28",
    "reviewTitle": "Legroom in Economy is crippling.",
    "reviewRatingScore": 2,
    "reviewSummary": "The customer expresses frustration with the lack of quality in the gluten-free meal options in Premium Economy, highlighting the food's dryness and lack of variety.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-06-18",
    "reviewTitle": "I will never fly BA again",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer vows not to fly with the airline again due to a negative experience involving lost baggage and lack of accountability or compensation from the airline, ruining their holiday.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2024-12-31",
    "reviewTitle": "Extremely disappointing experience with British Airways",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer faced an unpleasant surprise with a hidden baggage fee that was not clearly communicated online, resulting in a hefty penalty at the airport and a vow to never fly with British Airways again.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-27",
    "reviewTitle": "I booked a holiday to Budapest through…",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer expresses frustration over not receiving a refund for an unsatisfactory trip and prematurely booked a return flight with another airline, vowing never to use Love Holidays or British Airways again.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2024-12-30",
    "reviewTitle": "WARNING: TIER program ENDED by gangster BA now need to spend more than $12k to qualify as silver elite",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer is outraged by BA's dramatic changes to its tier program, requiring significantly higher spending for status, and has demanded refunds for future flights booked before these changes.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2024-12-28",
    "reviewTitle": "Full marks to BA",
    "reviewRatingScore": 5,
    "reviewSummary": "The reviewer praises British Airways for exceptional service during their recent flight to Chicago, highlighting efficient check-in, comfortable new pods, and a satisfying in-flight experience, despite acknowledging their bias as an IAG shareholder.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-30",
    "reviewTitle": "Not a good company",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer experienced extremely poor customer service at Heathrow Airport, finding the staff to be rude and unhelpful, even refusing to communicate or provide solutions for issues.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-10-27",
    "reviewTitle": "I will never fly with British Airways again. They must have the worst customer service of any company anywhere!",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced significant distress due to overbooked flights, inadequate communication from British Airways (BA) and their contractor Menzies, leading to an unintended extended stay at the airport and difficulty in seeking compensation.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-29",
    "reviewTitle": "Another fine mess BA",
    "reviewRatingScore": 1,
    "reviewSummary": "A pallet of bags failed to make it onto the BA flight from Geneva to LHR, with no communication from the flight crew to passengers, leading to extended waits at baggage claim and a negative perception of BA's service quality, especially in Business Class.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-11-15",
    "reviewTitle": "Don't bother paying for business class",
    "reviewRatingScore": 1,
    "reviewSummary": "Despite on-time flights and a great menu, the customer was deeply disappointed by the shabby cabin condition, lack of business class lounge access at Port of Spain due to refurbishments, and the unsatisfactory handling of their complaint about these issues, including a delayed and ultimately unhelpful response from the airline.",
    "journeyStep": "Making follow-up complaints"
  },
  {
    "reviewDateOfExperience": "2024-12-29",
    "reviewTitle": "Truly disgraceful website and app",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer experienced severe frustration due to technological issues with BA's website and app, preventing them from accessing their account and viewing their bookings.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-08-20",
    "reviewTitle": "Poor customer service",
    "reviewRatingScore": 1,
    "reviewSummary": "Experienced two unexplained consecutive flight cancellations with BA, leading to inconvenience and a problematic insurance claim process due to lack of formal cancellation proof.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-29",
    "reviewTitle": "Flight home cancelled",
    "reviewRatingScore": 1,
    "reviewSummary": "Flight home was cancelled without any alternatives or customer service assistance provided, leading to a negative experience.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-29",
    "reviewTitle": "Online check in failure again",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses frustration with the inability to check in for their flight due to persistent errors on both the app and website, displaying dissatisfaction with the airline's IT platform.",
    "journeyStep": "Checking in for the flight"
  },
  {
    "reviewDateOfExperience": "2024-12-28",
    "reviewTitle": "Extremely disappointing experience",
    "reviewRatingScore": 1,
    "reviewSummary": "Experienced a significant five-hour flight delay due to fog at London Gatwick Airport with minimal information or support provided during the wait.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-28",
    "reviewTitle": "Gone down the pan",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced a cancelled first flight, endured a lengthy and frustrating process with customer service to resolve it, and criticized the airline's app for its ineffectiveness in obtaining boarding passes and prioritizing data collection.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-27",
    "reviewTitle": "Woke Airline please please read this.",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced repeated delays and cancelations across multiple flights, criticized the airline's handling of allergies and club class services, experienced poor customer service, and voiced overall frustration with the airline's management and policies.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-09-18",
    "reviewTitle": "Every time I fly with BA, I think it can't get worse",
    "reviewRatingScore": 1,
    "reviewSummary": "Flight from Nice to the UK was cancelled last minute, re-routed via Frankfurt causing double the journey time; BA ignored inquiries about a more convenient alternative flight from Marseilles, likely to minimize compensation.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-28",
    "reviewTitle": "Fdont travel with this shower…",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer expresses frustration over a mishandled flight cancellation by BA and Opodo, including false claims of ticket use, lack of apology, and inadequate response to complaints, highlighting ongoing issues and dissatisfaction with customer service.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2024-12-28",
    "reviewTitle": "0 stars",
    "reviewRatingScore": 1,
    "reviewSummary": "Flight home was cancelled 5 hours before departure due to foggy weather, without prior warning or information on compensation, and previous flight to London was also delayed with poor customer service response.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-28",
    "reviewTitle": "Is there a way to to give less then 1…",
    "reviewRatingScore": 1,
    "reviewSummary": "Flights were cancelled just 4 hours before departure without any offered compensation or rebooking options, and the customer service showed no empathy.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-27",
    "reviewTitle": "Terrible service",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced a significant delay on their Manchester to Heathrow flight, leading to a missed connection to Newark, and found BA's customer service insufficient and frustrating.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-09-27",
    "reviewTitle": "Very pleasantly surprised by level of service. A different world compared to RyanAir etc.",
    "reviewRatingScore": 5,
    "reviewSummary": "The reviewer expresses high satisfaction with British Airways, highlighting the smooth check-in and boarding process, friendly staff, and complimentary amenities, contrasting it with past negative experiences with other airlines.",
    "journeyStep": "Arriving at the airport"
  },
  {
    "reviewDateOfExperience": "2024-12-27",
    "reviewTitle": "BA has really lost its shine - don’t bother paying for business class",
    "reviewRatingScore": 1,
    "reviewSummary": "The business class experience from London to Shanghai was disappointing due to outdated and worn seats, malfunctioning entertainment systems, and inadequate seating arrangements, feeling substandard.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-26",
    "reviewTitle": "Booked my tickets with my partner for…",
    "reviewRatingScore": 1,
    "reviewSummary": "Experienced financial and service issues with seat upgrades and poor in-flight treatment; expresses disappointment and advises against using the airline.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-27",
    "reviewTitle": "LYING, CHEATING, RATS",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer experienced extremely poor service with rude staff and misleading information regarding an upgrade for a flight, leading to higher than quoted prices.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-27",
    "reviewTitle": "Not the world's worst airline, but pretty freekin' close",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses extreme dissatisfaction with British Airways, highlighting frequent cancellations, poor customer service, and a cumbersome digital experience. Despite being a former loyal customer, they now view the airline as the worst they have ever flown, citing deception in service quality and an organizational focus on avoiding compensation.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-26",
    "reviewTitle": "Absolutely unbelievably bad service",
    "reviewRatingScore": 1,
    "reviewSummary": "Paid in advance for seat reservations to ensure family could sit together, but BA did not honor the reservations, leading to separated seats while still charging the card.",
    "journeyStep": "Selecting preferred seats"
  },
  {
    "reviewDateOfExperience": "2024-12-26",
    "reviewTitle": "Terrible service / terrible app",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer is frustrated with the airline's inefficient process of requesting passport information for every flight, comparing it unfavorably with another airline's better system.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-26",
    "reviewTitle": "British Airways ( thieving company )",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer expresses extreme dissatisfaction with the airline's seating charges, labeling it as robbery and lamenting a lack of alternatives to their destination. The review highlights a deep disappointment with customer care practices.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-10-21",
    "reviewTitle": "If you don't buy your seat on BA…",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer is dissatisfied with British Airways, citing poor seat allocation, decreasing amenities like food and comfort, and strict cabin baggage policies, feeling treated poorly.",
    "journeyStep": "Selecting preferred seats"
  },
  {
    "reviewDateOfExperience": "2024-12-19",
    "reviewTitle": "Arrogant and rude BA staff at the gate…",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced extremely rude and arrogant behavior from British Airways (BA) staff at Heathrow, involving threats over cabin luggage and refusal to provide names for complaints.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-02",
    "reviewTitle": "Poor standards. Avoid it like a plaque",
    "reviewRatingScore": 1,
    "reviewSummary": "Passenger experienced extremely disrespectful and unprofessional service from a staff member named Taylor, which included mocking a dietary need due to diabetes and using profane language. A complaint was filed onboard with crew manager Stephanie, who offered an apology but no immediate resolution.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-07",
    "reviewTitle": "Flew on 7/12 Madrid to London",
    "reviewRatingScore": 1,
    "reviewSummary": "Rude and unhelpful staff with awful service during a flight from Madrid to London, without any apology for the shameful display.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-11-24",
    "reviewTitle": "Adding insult to incompetence!",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer's flight was cancelled without prior notice from BA, leading to poor communication and customer service experiences, including difficulty in obtaining refunds or compensation.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-24",
    "reviewTitle": "Worst than Bucket Airlines",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced severe inconvenience when their flight times were significantly changed, leading to difficulties with customer service when trying to address these issues, specifically regarding a late checkout due to the new flight schedule.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-23",
    "reviewTitle": "After a difficult day",
    "reviewRatingScore": 5,
    "reviewSummary": "The customer faced a distressing experience being refused onto the flight due to an ESTA issue, with initial poor staff response, but was later assisted by a helpful employee named Harvey who rebooked the flight, restoring their faith in customer service.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-10-19",
    "reviewTitle": "Atrocious customer service for flight cancellation",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer expresses extreme dissatisfaction with the airline's service, highlighting a cancelled flight, downgrade, and unfulfilled financial reimbursements despite legal obligations.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2024-12-20",
    "reviewTitle": "This would be funny if it were not true",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer's flight was cancelled, leading to a complex rebooking process. They experienced significant issues with lost luggage containing essential medicine, poor customer service response, and additional unexpected costs.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-23",
    "reviewTitle": "Fly ABBA",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer experienced a frustrating issue with a booking error where a ticket had an incorrect passenger name, and BA's inflexible policy forced the customer to purchase a new ticket as they only allow name changes within 24 hours of booking.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-14",
    "reviewTitle": "Don’t Book BA they don’t honour their bookings.",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer experienced a lack of seat availability on a pre-booked direct flight, resulting in being placed on a later, non-direct flight, with no responses to complaints made.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-19",
    "reviewTitle": "Not the best, not even in top 10.",
    "reviewRatingScore": 2,
    "reviewSummary": "Customer expresses dissatisfaction with limited beverage service and perceived neglect from crew on a 12-hour BA flight, also criticizing staff appearance compared to other airlines.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-07",
    "reviewTitle": "I don't know where to start.",
    "reviewRatingScore": 1,
    "reviewSummary": "After a botched flight change and upgrade process, the customer experienced prolonged neglect and failure in service from the airline, culminating in ignored requests for a call recording under ICO law, and a lost official complaint.",
    "journeyStep": "Making follow-up complaints"
  },
  {
    "reviewDateOfExperience": "2024-12-16",
    "reviewTitle": "Delayed Response from British Airways for Invoice Request",
    "reviewRatingScore": 2,
    "reviewSummary": "The customer expresses disappointment in British Airways' customer service due to their lack of responsiveness in providing an invoice for insurance purposes, which contrasts with the efficient service received from Ryanair and easyJet.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-20",
    "reviewTitle": "Consistently poor customer service",
    "reviewRatingScore": 1,
    "reviewSummary": "After persistent issues linking a hotel reservation with 'My Disney Experience' and receiving unhelpful and indifferent service from BA's customer service, the reviewer found resolution and superior service directly from Walt Disney Travel Company.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-11-11",
    "reviewTitle": "B.A lost my luggage and claim not sorted",
    "reviewRatingScore": 1,
    "reviewSummary": "B.A lost the customer's luggage in early November, with no response to their claim or updates on the process, highlighting poor customer relations and potential legal action due to non-payment of the claim.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2024-12-08",
    "reviewTitle": "Utter joke of an airline",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses extreme dissatisfaction with the airline's response to complaints about two very long and unpleasant flights, mocking the compensation offered.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2024-11-21",
    "reviewTitle": "BA has untrained agents",
    "reviewRatingScore": 1,
    "reviewSummary": "During a bereavement, the customer encountered untrained agents providing conflicting information about flight changes and fee waivers, leading to dissatisfaction with customer service and the refusal of a requested refund.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-20",
    "reviewTitle": "Dedicated to ruining your travel plans",
    "reviewRatingScore": 1,
    "reviewSummary": "Experiences severe issues with booking cancellations and changes to inconvenient times, alongside poor customer service unable to effectively address these issues.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-20",
    "reviewTitle": "Awful App and Last Minute Notice about Delays",
    "reviewRatingScore": 1,
    "reviewSummary": "The check-in process is frustrating and inefficient, and flight delays are poorly communicated, causing unnecessary waiting times at the gate.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-19",
    "reviewTitle": "Normally mediocre - but Andrew was amazing",
    "reviewRatingScore": 5,
    "reviewSummary": "The reviewer praised Andrew for his professionalism in handling a customer's complaint about overhead locker space on flight BA781.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-20",
    "reviewTitle": "Absolute garbage: stone age baggage policy",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer expresses extreme dissatisfaction with the airline's baggage policy, feeling embarrassed to pay 70£ for overweight baggage where budget airlines did not charge them.",
    "journeyStep": "Adding extras to the booking"
  },
  {
    "reviewDateOfExperience": "2024-12-16",
    "reviewTitle": "Computer really does say no and repeatedly so",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer experienced extreme frustration with BA's service regarding a significant flight time change, leading to over 7 hours of wasted time in unsuccessful attempts through various contact channels to alter the booking or lodge a complaint, only to be offered an unsatisfactory refund.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-19",
    "reviewTitle": "As always an exemplary pleasure to fly…",
    "reviewRatingScore": 5,
    "reviewSummary": "The review positively highlights the efficient and attentive service provided by the British Airways flight crew, despite a slight delay and baggage service issues.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-08-23",
    "reviewTitle": "Pretty much guaranteed to be delayed",
    "reviewRatingScore": 1,
    "reviewSummary": "Flights are consistently delayed, and in-flight services are mediocre at best; customer service follow-up regarding delays is a frustrating process.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-17",
    "reviewTitle": "Case claim closed without the feedback",
    "reviewRatingScore": 1,
    "reviewSummary": "Flight cancellation led to booking with another airline and an unresolved claim for a refund, with poor customer service response times.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2024-12-01",
    "reviewTitle": "The worst customer service ever",
    "reviewRatingScore": 1,
    "reviewSummary": "Experienced extremely poor customer service on a flight, particularly during a health issue; a cabin crew member, Rochelle, was dismissive when asked for help, leading to a significantly negative experience.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-18",
    "reviewTitle": "BA cancelling confirmed flights for July 2025???",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer's flight from Dusseldorf to LHR booked for July 2025 was cancelled by BA, leading them to cancel their trip and decide against using BA in the future due to a similar past experience.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-18",
    "reviewTitle": "Absolutely useless website",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer expresses extreme frustration with the complicated and unsecure booking process through the airline's loyalty program, implying a lack of ease and security.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2024-12-18",
    "reviewTitle": "Avoid at all cost - BA is a soaring disappointment through and through and an utter disgrace for a \"flagship\" national carrier airline.",
    "reviewRatingScore": 1,
    "reviewSummary": "The review expresses extreme dissatisfaction with the airline's lack of compassion for travel changes due to medical reasons and poor customer service experience.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-11",
    "reviewTitle": "Our baggage did not follow us to our…",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced lost baggage on a flight to Berlin with BA, and their complaint and request for compensation for emergency purchases were cancelled, highlighting a lack of recourse.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2024-11-08",
    "reviewTitle": "Unacceptable.",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer expresses frustration over a last-minute paid seat reservation change and the prolonged process of obtaining a refund.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2024-12-16",
    "reviewTitle": "Don’t even want to give 1 star.",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses extreme dissatisfaction with a flight cancellation to Abu Dhabi without a given reason, and frustration over delays in receiving a refund after the airline had held their money for over three months.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-04",
    "reviewTitle": "Would not advise booking a holiday…",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer regrets booking early with BA due to a family issue preventing travel on the booked dates, and is disappointed by BA's inflexibility regarding changes or cancellations compared to other airlines, despite finding their service good.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2024-10-15",
    "reviewTitle": "I had the absolute worst experience…",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer experienced discrimination and poor customer service with British Airways, including unacknowledged emails and a closed case without resolution.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-16",
    "reviewTitle": "Go elsewhere",
    "reviewRatingScore": 1,
    "reviewSummary": "Flights to Italy were canceled two months after booking without a clear reason, and the customer is unable to access the website for further assistance, expressing frustration with the airline's service quality compared to others.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-15",
    "reviewTitle": "Flight diverted - Support ZERO",
    "reviewRatingScore": 1,
    "reviewSummary": "The flight was unexpectedly diverted, leading to significant delays, additional travel costs, and a missed event, with no support or reimbursement provided by the airline despite initial promises.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-08-22",
    "reviewTitle": "Gross Negligence by British Airways: Life-Threatening Handling of Nut Allergies",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses extreme dissatisfaction with British Airways due to their failure to accommodate severe nut allergies, resulting in a dangerously negligent experience that caused significant distress and safety concerns for the reviewer's family.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-08",
    "reviewTitle": "AWFUL!!!!!",
    "reviewRatingScore": 1,
    "reviewSummary": "Extremely negative flight experience with inattentive and unwelcoming staff, uncomfortable seating, and poor quality food; comparing unfavorably to other airlines.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-18",
    "reviewTitle": "Seat Overselling Practices and unusable amex vouchers",
    "reviewRatingScore": 1,
    "reviewSummary": "The review expresses frustration over frequent flight cancellations due to overbooking, devaluation of the companion voucher from the BA Amex card, reduced availability of reward flights, and a perception that the airline prioritizes business travelers or those willing to pay high prices.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-17",
    "reviewTitle": "Check in online è impossibile!",
    "reviewRatingScore": 1,
    "reviewSummary": "Frustrated with the airline's online check-in system issues for several months, forcing last-minute checks or airport check-ins.",
    "journeyStep": "Checking in for the flight"
  },
  {
    "reviewDateOfExperience": "2024-12-17",
    "reviewTitle": "Extremely disappointing experience with…",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer had an extremely disappointing experience with British Airways due to subpar seating arrangements, tiny seats with high prices, and a lack of value compared to other airlines, vowing never to fly with them again.",
    "journeyStep": "Evaluating airline reviews"
  },
  {
    "reviewDateOfExperience": "2024-10-29",
    "reviewTitle": "Never a good experience",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer consistently encounters terrible customer service, leading to a never good experience.",
    "journeyStep": "Seeking customer service assistance"
  },
  {
    "reviewDateOfExperience": "2024-12-17",
    "reviewTitle": "Whoever runs IT should be fired",
    "reviewRatingScore": 1,
    "reviewSummary": "The review expresses extreme frustration with the company's technical incompetence, highlighting consistent errors and failures on the website.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2024-11-23",
    "reviewTitle": "British Airways a National Disgrace!",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses extreme dissatisfaction with British Airways, citing a delay without prior notice, inadequate care and service during the delay, crew indifference, and poor post-flight support, including missed connection handling and ineffective customer service communications.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-17",
    "reviewTitle": "I am so disappointed with BA",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer expresses extreme disappointment with BA, mainly due to unresolved claims for a cancelled flight and poor customer service, including neglect in basic flight maintenance like sewage tank emptying.",
    "journeyStep": "Requesting refunds or compensation"
  },
  {
    "reviewDateOfExperience": "2024-12-17",
    "reviewTitle": "I am booked with BA for the first time",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced extremely rude service from a staff member at Manchester airport during check-in, leading to a decision to never fly with British Airways again.",
    "journeyStep": "Checking in for the flight"
  },
  {
    "reviewDateOfExperience": "2024-12-16",
    "reviewTitle": "BA very poor sad to say",
    "reviewRatingScore": 3,
    "reviewSummary": "The flight experienced a delay without any communication or apology, and the check-in process was chaotic.",
    "journeyStep": "Experiencing flight delays or cancellations"
  },
  {
    "reviewDateOfExperience": "2024-12-16",
    "reviewTitle": "the usual",
    "reviewRatingScore": 1,
    "reviewSummary": "Experienced repeated prompts to check in online that failed without explanation, leading to extra costs for luggage collection and taxi due to inability to obtain a boarding pass.",
    "journeyStep": "Checking in for the flight"
  }
]