[
  {
    "reviewDateOfExperience": "2025-01-17",
    "reviewTitle": "Absolutely horrible",
    "reviewRatingScore": 1,
    "reviewSummary": "This review expresses a strong negative sentiment towards the airline, criticizing the prices, planes, and customer service, with the exception of the pilot.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2024-06-21",
    "reviewTitle": "BA YOU SHOULD BE ASHAMED OF YOURSELVES",
    "reviewRatingScore": 1,
    "reviewSummary": "A flight from Edinburgh to Rome via Heathrow faced significant delays due to passengers deciding not to fly and a broken conveyor belt, leading to missed connections and poor customer service from BA, including a refusal to reimburse adequately.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-16",
    "reviewTitle": "BRITISH AIRWAYS AWFUL SERVICE",
    "reviewRatingScore": 1,
    "reviewSummary": "After a seat upgrade for better legroom due to bad knees, the reviewer was shifted back to a regular seat without explanation and has struggled for almost 3 months to get a refund, experiencing very poor customer service.",
    "journeyStep": "Seat selection and special requests"
  },
  {
    "reviewDateOfExperience": "2024-11-17",
    "reviewTitle": "British Airways happy to 'steal' from customers! Appalling treatment!",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer is extremely upset with British Airways due to the complicated and ultimately unsuccessful process of booking an additional seat for a cello, leading to a loss of £76 and a refusal to refund. Despite previous experiences of booking a cello seat, BA staff provided conflicting information and showed a lack of concern for the customer's situation, forcing them to find an alternative last-minute flight.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2025-01-06",
    "reviewTitle": "DO NOT FLY WITH BA!",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced significant delays in baggage retrieval at T5, causing them to miss a connecting flight from T2. They had to book an alternative flight, accommodations, and cater for their meals due to the delay. They received no assistance from the airline's service desk or complaints channel, describing the experience as atrocious.",
    "journeyStep": "Checking in luggage"
  },
  {
    "reviewDateOfExperience": "2024-10-16",
    "reviewTitle": "Very poor customer service",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer experienced very poor customer service with their flight cancellation, faced limited communication, incurred additional costs, and received no compensation or support from BA.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2024-10-01",
    "reviewTitle": "Ridiculously expensive seats and luggages",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer expresses frustration over additional costs for seat selection and luggage, feeling misled by pricing policies. They also mention poor customer service response to complaints.",
    "journeyStep": "Seat selection and special requests"
  },
  {
    "reviewDateOfExperience": "2025-01-16",
    "reviewTitle": "What a joke of a company",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses extreme dissatisfaction with the airline, highlighting issues with website glitches during booking, poor customer service including inability to change flights, and a poor in-flight experience characterized by inadequate staff attitude, disappointing boarding process, insufficient legroom, and substandard meal offerings. They motivate the CEO to improve and compare negatively to other airlines.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2024-12-09",
    "reviewTitle": "BA data breach & account hacked no help",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced a severe issue with their airmiles account being hacked and improperly handled by BA, leading to frustration and the eventual necessity to book flights with another airline using cash. Despite attempts to resolve the data breach and reclaim stolen airmiles, communication barriers and lengthy resolution times exacerbated the situation. The reviewer is seeking a response from BA regarding this mishandling before taking further action.",
    "journeyStep": "Discovering airline and flight options"
  },
  {
    "reviewDateOfExperience": "2024-11-08",
    "reviewTitle": "Zero stars is not an option sadly",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses extreme dissatisfaction with the service received after their flight was cancelled and incorrectly reported as late. Despite multiple attempts to resolve the issue, communication with the customer service was highly inefficient, ultimately leading to a prolonged dispute and promised refund.",
    "journeyStep": "Receiving booking confirmation"
  },
  {
    "reviewDateOfExperience": "2024-12-27",
    "reviewTitle": "No loyalty",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer is disappointed with British Airways due to issues redeeming a companion voucher and the airline's loyalty scheme, leading to BA being blacklisted by the customer.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2025-01-05",
    "reviewTitle": "Just wanted to say how good the cabin…",
    "reviewRatingScore": 5,
    "reviewSummary": "The review expresses gratitude and high praise for the cabin crew's excellent service, specifically naming Molly and Julie, and acknowledges the pilots' grand performance from the San Francisco to London Heathrow flight on January 5th.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-14",
    "reviewTitle": "Flying back from Schipol in The…",
    "reviewRatingScore": 1,
    "reviewSummary": "Alex Henderson experienced significant frustration when attempting to change flights at Schipol Airport, encountering unhelpful service from BA both at the check-in desk and over the phone, resulting in being mistakenly removed from the original flight and considerable time and effort to rectify the mishap. Despite efforts, the desired change to an earlier flight wasn't achieved, leading to disappointment and criticism of BA's customer service.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2024-12-17",
    "reviewTitle": "Flights cancelled took 5 days and 1hr a…",
    "reviewRatingScore": 1,
    "reviewSummary": "Flights were canceled, leading to a laborious and costly 5-day ordeal to resolve, including expensive changes to hotel and taxi arrangements, with poor customer service from the airline.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2024-07-05",
    "reviewTitle": "Outstanding service when flying to…",
    "reviewRatingScore": 5,
    "reviewSummary": "The service was outstanding on a flight to and from the United States, with special commendation for the respectful and kind treatment of a disabled daughter throughout the journey.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2024-11-15",
    "reviewTitle": "Our flight was very late Manchester to…",
    "reviewRatingScore": 1,
    "reviewSummary": "The flight from Manchester to Heathrow was significantly delayed, causing the passengers to miss their connections and arrive 17 hours late with £408 in additional costs. The staff offered no assistance or empathy, and the airline refused to refund the extra costs.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "Never again … an abysmal airline",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer had a very uncomfortable and disappointing experience with BA on a long flight due to extremely uncomfortable seating, poor in-flight amenities and service, and a long delay after landing due to external operational issues.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "We had such a great experience with BA…",
    "reviewRatingScore": 5,
    "reviewSummary": "The customer appreciated the kind and helpful service from BA's team while moving their flight twice due to illness and LA wildfires, highlighting it as a refreshing experience.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "Fabulous service Heathrow to Madrid",
    "reviewRatingScore": 5,
    "reviewSummary": "The flight from Heathrow to Madrid was delayed by 1.5 hours, but the exceptional service from the captain and crew, including special attention for a birthday celebration with complimentary champagne, made the experience memorable and praiseworthy.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-13",
    "reviewTitle": "2 hours to reschedule a flight - without success!",
    "reviewRatingScore": 1,
    "reviewSummary": "The process of trying to reschedule an Avios reward flight with British Airways was incredibly frustrating, involving two hours of searching for the correct contact number and three failed attempts due to being referred to different hotlines, ultimately leading to giving up due to poor customer service.",
    "journeyStep": "Discovering airline and flight options"
  },
  {
    "reviewDateOfExperience": "2024-09-12",
    "reviewTitle": "Terrible treatment on a business class…",
    "reviewRatingScore": 1,
    "reviewSummary": "Terrible experience on a business class flight due to being seated separately after a plane change, refusal to accommodate seating requests leading to distress, and poor customer service including a difficult refund process and unsatisfactory resolution.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-13",
    "reviewTitle": "Access to BA customer service",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer is extremely frustrated trying to obtain a receipt for flights with BA, experiencing unresponsive customer service and repeated disconnections during live chats, leading to disillusionment with the airline's overall service quality.",
    "journeyStep": "Receiving booking confirmation"
  },
  {
    "reviewDateOfExperience": "2024-12-26",
    "reviewTitle": "Came here to write a one star review",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses extreme dissatisfaction with British Airways due to a cancelled flight on Boxing Day, lack of alternative flight options provided, and poor customer service in handling their complaint, resulting in a costly rebooking with another airline.",
    "journeyStep": "Receiving booking confirmation"
  },
  {
    "reviewDateOfExperience": "2024-12-09",
    "reviewTitle": "No catering on flight in business class",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses disappointment as BA, despite their frequent travel and status, did not cater to their business class flight and closed their complaint without response, leading the reviewer to reconsider future support for the airline.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2024-12-30",
    "reviewTitle": "BA reveal themselves as vicious and uncaring",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer faced a series of issues starting with a cancelled flight and a significant delay, leading to hotel booking problems upon arrival. The treatment from the airline, BA, was very disappointing, particularly regarding the refusal to refund two lost nights despite multiple communication attempts. The experience left the customer warning others about the airline's lack of customer care and protection.",
    "journeyStep": "Receiving booking confirmation"
  },
  {
    "reviewDateOfExperience": "2024-11-17",
    "reviewTitle": "This started with a cancelled flight",
    "reviewRatingScore": 1,
    "reviewSummary": "The review describes a frustrating experience with a flight cancellation, lack of assistance or clear communication from the airline, difficulty in rebooking and securing refunds for additional charges, and an unresolved claim for reimbursement of extra expenses due to the delay. The customer service was described as unhelpful, leading to significant dissatisfaction and the decision not to book with the airline again.",
    "journeyStep": "Receiving booking confirmation"
  },
  {
    "reviewDateOfExperience": "2025-01-12",
    "reviewTitle": "Like many people said",
    "reviewRatingScore": 1,
    "reviewSummary": "Reviewer describes the airline staff as arrogant, rude, unhelpful, and disorganized, stating this is the worst airline they've ever flown with and expressing they will no longer use their services.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-12",
    "reviewTitle": "Dear OWNERS of British Airlines",
    "reviewRatingScore": 1,
    "reviewSummary": "The passenger experiences significant delays and crew replacement issues on flight BA 0552, noting the staff's rudeness and lack of communication. They express disappointment with British Airways, equating it to a budget carrier because of the poor service quality. MR. INCOGNITO, a chief flight attendant, is singled out for particularly bad behavior.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-12",
    "reviewTitle": "Great service",
    "reviewRatingScore": 5,
    "reviewSummary": "Had to rebook holiday; received amazing service from Lindsey, who made the process simple and showed lots of patience.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2025-01-12",
    "reviewTitle": "Unfriendly food disgusting hardly any…",
    "reviewRatingScore": 1,
    "reviewSummary": "The passenger experienced unfriendly service and found the food to be disgusting, with hardly any drinks offered during the long haul flight.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-11",
    "reviewTitle": "BA worst airline in the WORLD!!",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses extreme dissatisfaction with British Airways for cancelling their return flight for commercial reasons, declining compensation for significant additional expenses, and causing prolonged stress. They intend to pursue the issue through an ombudsman and legal action, highlighting a systemic issue with customer service and accountability.",
    "journeyStep": "Receiving booking confirmation"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "Very disappointing flight",
    "reviewRatingScore": 1,
    "reviewSummary": "The passenger experienced poor service from the airline staff, disappointing meal quality, and uncomfortable seating, leaving them deeply disappointed with their journey on British Airways from Heathrow to Johannesburg.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-11",
    "reviewTitle": "Poor customer service",
    "reviewRatingScore": 1,
    "reviewSummary": "Experienced significant difficulties and inconsistencies when booking a flight for a family holiday, including long wait times and poor customer service from British Airways, in stark contrast to the positive experience with Virgin Atlantic's efficient and professional customer service.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "They get such a slating but I actually like them and recently had a great experience with them",
    "reviewRatingScore": 5,
    "reviewSummary": "The customer experience has greatly improved.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2024-03-13",
    "reviewTitle": "HORRIBLE CUSTOMER SERVICE",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer experienced significant issues with a refund going to the wrong account, leading to 4-5 months of misleading and unhelpful customer service, including false promises of management callbacks and a complaint resolution considered unsatisfactory.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2025-01-04",
    "reviewTitle": "Such arrogant staff and poor service all in all",
    "reviewRatingScore": 1,
    "reviewSummary": "The service was arrogant and poor, with senior staff making obnoxious comments. The food, facilities, and entertainment for the long-haul flight were inadequate. There was nothing positive to note at the end of the journey.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-08",
    "reviewTitle": "Possibly the Worst Website a Mediocre Airline Ever Had",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer had a challenging experience with multiple flights being either delayed or rescheduled, leading to missed connections and their baggage being lost twice. They expressed frustration with the airline's punctuality, handling of luggage, and website functionality.",
    "journeyStep": "Checking in luggage"
  },
  {
    "reviewDateOfExperience": "2024-12-28",
    "reviewTitle": "Efficient helpful professional airline",
    "reviewRatingScore": 5,
    "reviewSummary": "The customer had a great booking experience and praised the customer service desk at Sydney airport for exceptional support with a flight change, promising to fly with BA again.",
    "journeyStep": "Receiving booking confirmation"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "Don’t fly Ba you will never get onward taxi transport",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer had to face a financial loss because a flight to Austin was cancelled last minute by BA, leaving the clients uninformed until the early morning.",
    "journeyStep": "Receiving booking confirmation"
  },
  {
    "reviewDateOfExperience": "2025-01-08",
    "reviewTitle": "Gobsmackingly inept company",
    "reviewRatingScore": 1,
    "reviewSummary": "Extremely frustrated with British Airways' customer service after leaving an item on the plane; unable to report or resolve the issue due to unresponsive contact methods and a malfunctioning complaints form.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "British Airways should leave the service industry",
    "reviewRatingScore": 1,
    "reviewSummary": "Experienced significant delays and mistreatment by airline staff, missing a connecting flight and subsequent arrangements for a wedding in India, leading to emotional distress and health issues. The airline's response to complaints was dismissive and mocking, exacerbating the situation and resulting in a negative customer service experience.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "Last 2 flights lost all bags",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced significant frustration due to a staff member's unhelpful attitude at Heathrow T5, leading to a missed connection and a forced 3-hour wait, compounding previous issues with lost luggage. The interaction with the staff member escalated to the involvement of security, worsening the situation. Fed up with the service after 30 years, the reviewer vows to switch airlines.",
    "journeyStep": "Boarding the flight"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "No rules or regulations?",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer service was unable to provide clear guidelines on oversized baggage fees, stating it depends on the check-in attendant's discretion.",
    "journeyStep": "Checking in luggage"
  },
  {
    "reviewDateOfExperience": "2024-10-14",
    "reviewTitle": "AVOID",
    "reviewRatingScore": 1,
    "reviewSummary": "The review expresses frustration that the airline ignored their situation, regarding a family health emergency due to a cancer diagnosis.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2025-01-08",
    "reviewTitle": "An update and warning for those waiting for compensation and refunds from BA",
    "reviewRatingScore": 1,
    "reviewSummary": "After a 21-hour delay caused by a cancelled flight from LHR to SFO due to technical issues, the customer experienced extremely poor customer service from BA, including difficulty reaching customer support, being cut off due to high call volumes, and receiving an unhelpful response about a compensation claim that was automatically closed with a promise of contact in 2 to 3 months.",
    "journeyStep": "Receiving booking confirmation"
  },
  {
    "reviewDateOfExperience": "2025-01-04",
    "reviewTitle": "Great Flight. Great Crew.BA0662",
    "reviewRatingScore": 5,
    "reviewSummary": "The review positively mentions efficient passenger assistance and scooter check-in at Larnaca, exceptional service by the flight and cabin crew for a disabled passenger, contributing to a perfect end to their holiday.",
    "journeyStep": "Boarding the flight"
  },
  {
    "reviewDateOfExperience": "2024-12-22",
    "reviewTitle": "Horrible experience with someone with autism",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer had a very unpleasant experience with a rude security personnel at Heathrow on the 22nd of December and felt abused by both Heathrow security and British Airways staff, especially noting their position on the autistic spectrum.",
    "journeyStep": "Going through security"
  },
  {
    "reviewDateOfExperience": "2024-01-08",
    "reviewTitle": "The worlds worst airline (after Ryan…",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses frustration with the airline, ranking it poorly in comparison to others, and mentions experiencing high demand issues on the airline's website.",
    "journeyStep": "Discovering airline and flight options"
  },
  {
    "reviewDateOfExperience": "2024-09-20",
    "reviewTitle": "Lack of customer care",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses deep disappointment with British Airways after their flight was cancelled, leading to a missed important family occasion and additional financial burden despite being refunded. The customer service ignored their request for the difference in cost for three months, only to respond on Christmas Day with a dismissal.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2025-01-08",
    "reviewTitle": "Worst airline in the uk",
    "reviewRatingScore": 1,
    "reviewSummary": "The review describes this as the worst airline in the UK with terrible customer service.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-08",
    "reviewTitle": "I'd like to thank Kate Roche in…",
    "reviewRatingScore": 5,
    "reviewSummary": "Kate Roche in Customer Services at Birmingham provided exceptional help by ensuring the reviewer and their father were seated together and on the same flights, combining two separate reference numbers for convenience.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2025-01-07",
    "reviewTitle": "BA is killing itself off.",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer is extremely disappointed with British Airways' new loyalty scheme, feeling it makes it unreasonably difficult to qualify for even the lowest status of Bronze despite years of loyal flying, hinting at a switch to competitors like EasyJet.",
    "journeyStep": "Discovering airline and flight options"
  },
  {
    "reviewDateOfExperience": "2025-01-08",
    "reviewTitle": "A final nail in the coffin!",
    "reviewRatingScore": 1,
    "reviewSummary": "The review expresses extreme disappointment with British Airways, focusing on a rewards program shake-up that undermines long-term loyalty, indicating a departure from the airline as soon as possible.",
    "journeyStep": "Discovering airline and flight options"
  },
  {
    "reviewDateOfExperience": "2025-01-08",
    "reviewTitle": "Appalling Service from Customer Relations Team regarding a refund",
    "reviewRatingScore": 1,
    "reviewSummary": "Appalling service from the Customer Relations team regarding a baggage payment issue, with no resolution or updates provided after 3 months, leading to a decision not to use BA in the future.",
    "journeyStep": "Checking in luggage"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "I can't believe what used to be the…",
    "reviewRatingScore": 1,
    "reviewSummary": "Despite long loyalty to BA including Gold Guestlist status, the customer faced technical issues during booking requiring separate transactions and extra charges to seat children together for a trip to Japan, which led to considering switching to Qatar Airways.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2024-07-24",
    "reviewTitle": "I honestly cannot believe this company…",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer experienced a significant delay and lost luggage with their BA flight, alongside poor customer service in addressing these issues, leading to frustration and consideration of legal action.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2024-12-22",
    "reviewTitle": "We were booked to sit upstairs on the…",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer was upset because they had paid for specific seats upstairs on the A380 for a Christmas trip, but were moved without notification, and hadn't received a refund, leading to disappointment.",
    "journeyStep": "Seat selection and special requests"
  },
  {
    "reviewDateOfExperience": "2025-01-07",
    "reviewTitle": "They couldn’t care less",
    "reviewRatingScore": 1,
    "reviewSummary": "Flight from Oslo was significantly delayed, resulting in an unplanned landing in Birmingham and subsequent busing to Heathrow, with an issue of delayed hand luggage and an overall lack of customer care.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2024-01-07",
    "reviewTitle": "Unprofessional",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer had a frustrating experience with a non-functional charger input, miscommunications leading to confusion at Sydney for a connecting flight, and poor post-travel customer service from British Airways, including a £50 voucher that was impractical and issues with a third-party company leading to a financial loss.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-03",
    "reviewTitle": "Poor service and no reward for loyalty",
    "reviewRatingScore": 1,
    "reviewSummary": "Experienced a significant delay in priority luggage retrieval at Heathrow T5, leading to frustration and dissatisfaction with BA's overall service decline, including aircraft condition and staff attitude, prompting a switch to other airlines.",
    "journeyStep": "Checking in luggage"
  },
  {
    "reviewDateOfExperience": "2024-12-28",
    "reviewTitle": "Where to start 😡",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced cancelled and delayed flights, poor communication, and unprofessional behavior from the staff, leading to a strong recommendation against flying with BA.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-03",
    "reviewTitle": "BA what a change in 25years!",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer faced multiple disappointments with British Airways after a 25-year hiatus, including poor aircraft condition, substandard in-flight service, and a significant delay in luggage retrieval, leading to a declaration of not flying with them again.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-03",
    "reviewTitle": "Had an issue through no fault of BA and…",
    "reviewRatingScore": 5,
    "reviewSummary": "The reviewer had to change flights due to an issue not caused by the airline, and found the staff to be extremely helpful and understanding, especially noteworthy was the absence of extra fees for the rebooking process.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2024-12-04",
    "reviewTitle": "Incompetent service, & fail to respond to written complaint",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer's return flight was cancelled, leading to a cancellation of their entire booking due to misinformation about alternative flights. Upon discovering alternative options were available, efforts to reinstate the booking at the original price were denied. Despite filing a formal complaint, the customer received no further communication, leading to dissatisfaction with the airline's customer service.",
    "journeyStep": "Receiving booking confirmation"
  },
  {
    "reviewDateOfExperience": "2025-01-06",
    "reviewTitle": "A NIGHTMARE FOR OUR FAMILY!!!",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer's family faced a multi-day delay due to a missed connecting flight, compounded by poor service and lack of assistance from British Airways, both at the airport and at an accommodating hotel far from the city center. The ordeal was stressful, especially with a child and a daughter with a health condition, leading to a nightmare experience overall. The lack of empathy, customer service, and accountability from the airline and hotel staff left the family feeling abandoned, ignored, and considering it a completely unacceptable travel experience.",
    "journeyStep": "Boarding the flight"
  },
  {
    "reviewDateOfExperience": "2024-11-23",
    "reviewTitle": "Overbooked and involuntarily canceled…",
    "reviewRatingScore": 1,
    "reviewSummary": "The review expresses significant distress about an overbooked flight to a grandmother's funeral, resulting in a cancelation without refund or rebooking options, and poor customer service experience with British Airways. The customer lamented the financial and emotional toll taken due to the company's policy on overbooking and handling of the situation, contrasting it with other airlines' practices.",
    "journeyStep": "Receiving booking confirmation"
  },
  {
    "reviewDateOfExperience": "2025-01-06",
    "reviewTitle": "Absolutely Shocking Customer Service for Refund",
    "reviewRatingScore": 1,
    "reviewSummary": "Flight was cancelled 12 hours before departure, alternative flight was offered 2.5 days later causing significant inconvenience and financial stress. Had to book a new flight, struggle with transportation, and face issues with compensation claim and refund process, leading to dissatisfaction with the airline's customer service.",
    "journeyStep": "Receiving booking confirmation"
  },
  {
    "reviewDateOfExperience": "2025-01-06",
    "reviewTitle": "Worse than Ryanair",
    "reviewRatingScore": 1,
    "reviewSummary": "The review expresses severe dissatisfaction with the airline, comparing it unfavorably to Ryanair, noting frequent issues with the website and extremely limited customer service.",
    "journeyStep": "Discovering airline and flight options"
  },
  {
    "reviewDateOfExperience": "2024-10-14",
    "reviewTitle": "Avoid when possible",
    "reviewRatingScore": 1,
    "reviewSummary": "The airline's cancellation and rebooking process was highly disappointing, leading to missed meetings due to a flight being rescheduled a full day later, attributed first to operational issues then changed to weather conditions, likely to avoid compensation. Additionally criticized for not including hold luggage on long-haul flights, indicating a significant drop in the airline's service quality.",
    "journeyStep": "Booking the flight"
  },
  {
    "reviewDateOfExperience": "2024-10-11",
    "reviewTitle": "Overbooked flight",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer was put on standby because the flight was overbooked by 12 people, leading to a delayed flight, additional expenses for taxis and food, and a missed day of the trip, with no response to complaints.",
    "journeyStep": "Arriving at airport"
  },
  {
    "reviewDateOfExperience": "2025-01-05",
    "reviewTitle": "Awful experience",
    "reviewRatingScore": 1,
    "reviewSummary": "Terrible experience with over 40 minutes spent on baggage check-in and a flight delay exceeding one hour, capped by lost luggage and no customer service response.",
    "journeyStep": "Checking in luggage"
  },
  {
    "reviewDateOfExperience": "2025-01-05",
    "reviewTitle": "Terrible changes to BA Executive Club",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer expresses significant dismay at changes to BA Executive Club, making achieving and retaining Silver Status seemingly impossible, leading to reconsideration of their loyalty after 33 years.",
    "journeyStep": "Discovering airline and flight options"
  },
  {
    "reviewDateOfExperience": "2024-12-31",
    "reviewTitle": "The best of the best - our pilot.",
    "reviewRatingScore": 5,
    "reviewSummary": "The reviewer highly praises the pilot of British Airways flight BA 212 for an immaculate landing under treacherous wind conditions, expressing gratitude and admiration for the pilot's skill despite criticizing the airline's overall deterioration.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-04",
    "reviewTitle": "Disgrace Great British Airways",
    "reviewRatingScore": 1,
    "reviewSummary": "The review expresses extreme dissatisfaction with multiple aspects of the experience, including delayed flights, poor in-flight service when requesting water, a significant delay in luggage handling, and unhelpful customer service at the airport.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2024-12-16",
    "reviewTitle": "Smooth ride",
    "reviewRatingScore": 5,
    "reviewSummary": "The reviewer appreciated the helpful medical assistance team and the care received during their long haul flight, including wheelchair assistance and oxygen provision.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2024-06-28",
    "reviewTitle": "One of the worst airlines, ashamed its British",
    "reviewRatingScore": 1,
    "reviewSummary": "Flew BA for our honeymoon, which led to missing a day of the honeymoon due to their mistakes, incurring extra expenses that BA refuses to compensate. The customer service was non-responsive and refused to engage beyond email, which they also didn't reply to, leading to frustration and a call for regulatory intervention.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-04",
    "reviewTitle": "BA has gone from bad to worse- even…",
    "reviewRatingScore": 1,
    "reviewSummary": "The review expresses extreme dissatisfaction with British Airways' customer service, comparing negatively to low-cost operators despite premium pricing, and highlights a specific incident of long wait for baggage at LHR, with dismissive customer service response.",
    "journeyStep": "Checking in luggage"
  },
  {
    "reviewDateOfExperience": "2024-12-11",
    "reviewTitle": "Autistic son assaulted by cabin crew",
    "reviewRatingScore": 1,
    "reviewSummary": "Reviewer expresses strong dissatisfaction, reporting an incident where their autistic son was assaulted by a cabin crew member, highlighting a lack of response from the airline despite their previous complaint. The reviewer also hints at escalating the matter publicly through social media.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2024-12-28",
    "reviewTitle": "I have been waiting nearly 2 weeks for…",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer is highly disappointed due to a lack of response from BA customer services for 2 weeks after attempting to correct a booking error that involved the wrong surname.",
    "journeyStep": "Receiving booking confirmation"
  },
  {
    "reviewDateOfExperience": "2024-10-18",
    "reviewTitle": "Still waiting for Refund",
    "reviewRatingScore": 1,
    "reviewSummary": "The review expresses frustration with British Airways customer support for issues related to obtaining a refund for a seat downgrade, highlighting a lack of help and communication despite the in-flight staff being pleasant.",
    "journeyStep": "Seat selection and special requests"
  },
  {
    "reviewDateOfExperience": "2025-01-03",
    "reviewTitle": "Where are the £539 holidays to st kitts…",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer is frustrated as they cannot find the advertised £539 holidays to St. Kitts despite trying various dates and airports, and is willing to travel the next day.",
    "journeyStep": "Discovering airline and flight options"
  },
  {
    "reviewDateOfExperience": "2025-01-03",
    "reviewTitle": "Shit",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses strong dissatisfaction with significant organizational issues, leading to wasted hours at the airport.",
    "journeyStep": "Arriving at airport"
  },
  {
    "reviewDateOfExperience": "2025-01-03",
    "reviewTitle": "The worst customer service",
    "reviewRatingScore": 1,
    "reviewSummary": "The review highlights extremely negative experiences with British Airways (BA), focusing on terrible customer service, inadequate seating leg space in economy compared to budget airlines, and the removal of overhead air fans as a cost-cutting measure.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2024-12-30",
    "reviewTitle": "bad crew member David",
    "reviewRatingScore": 1,
    "reviewSummary": "During a flight from JFK to London Heathrow, the reviewer experienced unprofessional behavior from flight crew members because of sports team affiliations, and a situation where their daughter was uncomfortable due to a passenger reclining their seat fully. Despite requesting a minor adjustment, the crew member, David, responded rudely and shouted at the reviewer and their husband, exacerbating the situation and leaving a negative impression on the family.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "Atrocious",
    "reviewRatingScore": 1,
    "reviewSummary": "The review highlights extremely negative experiences with the airline's pricing, ground staff, and customer service, indicating a deep level of dissatisfaction.",
    "journeyStep": "Discovering airline and flight options"
  },
  {
    "reviewDateOfExperience": "2025-01-01",
    "reviewTitle": "The only gripe I have is their policy…",
    "reviewRatingScore": 3,
    "reviewSummary": "The reviewer expresses frustration over British Airways' hand luggage policy, leading to overcrowded overhead compartments and discomfort due to lack of legroom caused by having to place bags under the seat.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-03",
    "reviewTitle": "Greed",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer expresses frustration over having to pay an additional £336 for pre-assigning seats after purchasing two Business Class tickets for over £6000, accusing the airline of prioritizing profits over staff and customer satisfaction.",
    "journeyStep": "Seat selection and special requests"
  },
  {
    "reviewDateOfExperience": "2024-12-05",
    "reviewTitle": "Baby not allowed in a lounge with Gold Card!",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer faced multiple issues: being denied lounge access for their baby, lack of assistance with a baby stroller on board, and poor in-flight service including unresponsive staff to assistance calls in Premium Economy. They express strong disappointment with BA's service quality compared to other airlines.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2024-10-15",
    "reviewTitle": "Pathetic and misleading customer service",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced significant delays and issues with their luggage, including it being left at the source airport and delivered damaged, followed by unresponsive customer service regarding refunds for replacements, causing frustration.",
    "journeyStep": "Checking in luggage"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "Shocking customer service - Lies and no complaints procedure",
    "reviewRatingScore": 1,
    "reviewSummary": "Customer service agents were misleading and rude, and the complaints process is ineffective, leading to a lack of trust and reluctance to use the service again.",
    "journeyStep": "Receiving booking confirmation"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "The slowest most clunky IT of any airline",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses extreme frustration with the airline's slow and unreliable IT system, including difficulties using the app, website, and linking membership benefits. They compare unfavorably to budget airlines' IT systems and criticize the 24-hour window for online check-in.",
    "journeyStep": "Online check-in or app usage"
  },
  {
    "reviewDateOfExperience": "2025-01-01",
    "reviewTitle": "Truly the WORST airline out there - 0 stars!!!",
    "reviewRatingScore": 1,
    "reviewSummary": "British Airways' customer service is severely criticized for being non-existent, with no staff taking responsibility or responding to complaints effectively, leaving the reviewer extremely dissatisfied.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "Paid for extra legroom (£24) on website…",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer regrets paying £24 for extra legroom due to a subsequent price drop to £6 and faces difficulty in contacting the airline for a resolution, expressing extreme dissatisfaction and a firm decision to never fly with the airline again.",
    "journeyStep": "Seat selection and special requests"
  },
  {
    "reviewDateOfExperience": "2024-08-30",
    "reviewTitle": "DO NOT FLY BA IF YOU CAN AVOID IT",
    "reviewRatingScore": 1,
    "reviewSummary": "After opting for a premium economy upgrade due to health reasons, the reviewer was involuntarily downgraded without explanation or adequate customer service, leading to an unresolved request for a refund of the price difference 18 weeks later despite multiple contacts with the airline.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2025-01-02",
    "reviewTitle": "BA change my flight and give me a 5…",
    "reviewRatingScore": 1,
    "reviewSummary": "BA changed the customer's flight to have a 5-hour connection at DFW, and when the customer attempted to change to a more convenient flight, they encountered an online change issue, a long wait time for customer service, and were quoted a £300 change fee plus fare difference without a clear price for the new flight. The customer feels insulted and considers BA's practices a rip-off.",
    "journeyStep": "Discovering airline and flight options"
  },
  {
    "reviewDateOfExperience": "2025-01-01",
    "reviewTitle": "British Airways - Disgraceful National airline!",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced a last-minute flight cancellation without explanation while at Heathrow for a flight to Johannesburg, expressing frustration over repeated 'technical issue' delays with British Airways and a delayed compensation claim.",
    "journeyStep": "Waiting at the gate"
  },
  {
    "reviewDateOfExperience": "2024-12-31",
    "reviewTitle": "My Sister & Brother-in-law travelled…",
    "reviewRatingScore": 1,
    "reviewSummary": "My Sister & Brother-in-law had a disappointing experience without complimentary chocolates to celebrate New Year's Eve, indicating perceived stinginess.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2024-08-01",
    "reviewTitle": "Transfer delays from Heathrow to local…",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer experienced significant delays during their transfer at Heathrow, leading to a missed flight and a lack of assistance or compensation from staff. Despite no official flight delay, the process of taxiing, disembarking, and going through security again was excessively long and poorly managed, with dissatisfaction expressed towards both the airport's and airline's handling of the situation. The ordeal resulted in reaching their final destination 9 hours late, with their luggage delayed by a week.",
    "journeyStep": "Going through security"
  },
  {
    "reviewDateOfExperience": "2024-07-08",
    "reviewTitle": "Insect Infestation On Board / 7 months…",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer reports a severe insect infestation on flight BA 119 leading to health issues for his family, with no effective resolution from the airline for 7 months, highlighting a significant concern for safety and customer care.",
    "journeyStep": "Experiencing in-flight service"
  },
  {
    "reviewDateOfExperience": "2024-12-20",
    "reviewTitle": "very expensive",
    "reviewRatingScore": 3,
    "reviewSummary": "The reviewer is dissatisfied with the high cost of the airline, stating that low-cost airlines provide similar services at much cheaper fares.",
    "journeyStep": "Experiencing in-flight service"
  }
]