[
  {
    "reviewDateOfExperience": "2025-01-17",
    "reviewTitle": "Absolutely horrible",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer had a highly negative experience, criticizing everything from the prices and planes to the customer service, with the only positive mention being the pilot.",
    "journeyStep": "In-flight experience"
  },
  {
    "reviewDateOfExperience": "2024-06-21",
    "reviewTitle": "BA YOU SHOULD BE ASHAMED OF YOURSELVES",
    "reviewRatingScore": 1,
    "reviewSummary": "The flight from Edinburgh to Rome, through London Heathrow, was significantly delayed due to passengers deciding not to fly and a conveyor belt issue, causing a missed connection and a subsequent 7-hour delay, inadequately compensated with a £10 meal voucher. Despite an earlier flight being available and shown to the airline staff, the travelers were unable to board it and experienced a challenging compensation process that took nearly 8 months, with the airline ultimately denying adequate compensation.",
    "journeyStep": "Filing compensation claims"
  },
  {
    "reviewDateOfExperience": "2025-01-16",
    "reviewTitle": "BRITISH AIRWAYS AWFUL SERVICE",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer paid for a seat upgrade for extra legroom due to bad knees but was reassigned to a regular seat without explanation and has been waiting nearly 3 months to receive a refund, experiencing poor customer service throughout the process.",
    "journeyStep": "Filing compensation claims"
  },
  {
    "reviewDateOfExperience": "2024-11-17",
    "reviewTitle": "British Airways happy to 'steal' from customers! Appalling treatment!",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer is extremely dissatisfied and frustrated with British Airways' handling and conflicting information regarding booking an additional seat for a cello, leading to financial loss and a forced last-minute alternative arrangement. Despite past successful experiences, the complex and poorly managed process culminated in a refusal to accommodate the cello as cabin baggage, contrary to the airline's guidelines. The customer accuses BA of indifference and effectively stealing money, with unresolved requests for refunds and lack of follow-up from management.",
    "journeyStep": "Selecting flights"
  },
  {
    "reviewDateOfExperience": "2025-01-06",
    "reviewTitle": "DO NOT FLY WITH BA!",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer experienced a significant delay in baggage reclaim leading to a missed connecting flight, incurring additional costs for accommodation and alternative travel arrangements. Despite the inconvenience, the customer's complaints were dismissed, and follow-up through the complaints channel received no response, leading to a highly negative experience.",
    "journeyStep": "Baggage reclaim"
  },
  {
    "reviewDateOfExperience": "2024-10-16",
    "reviewTitle": "Very poor customer service",
    "reviewRatingScore": 1,
    "reviewSummary": "Flight was cancelled with limited communication, resulting in additional costs without compensation or support for insurance claims from the airline.",
    "journeyStep": "Filing compensation claims"
  },
  {
    "reviewDateOfExperience": "2024-10-01",
    "reviewTitle": "Ridiculously expensive seats and luggages",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer is frustrated with unexpected additional costs for seats and luggage after purchasing tickets, which exceeded the cost of the most expensive ticket. They plan to avoid the airline in the future due to these costs and the lack of responses to complaints.",
    "journeyStep": "Purchasing tickets"
  },
  {
    "reviewDateOfExperience": "2025-01-16",
    "reviewTitle": "What a joke of a company",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses strong dissatisfaction with multiple failures including a glitchy website, poor customer service, diminishing value of Avios points, and subpar in-flight experiences. They conclude with a critique of leadership and customer service, comparing negatively to competitors.",
    "journeyStep": "Browsing for flights"
  },
  {
    "reviewDateOfExperience": "2024-12-09",
    "reviewTitle": "BA data breach & account hacked no help",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer faced a severe issue with their airmiles account being hacked, leading to poor customer service and unaddressed security concerns over weeks. Despite efforts to rectify the situation, including a significant data breach, the airline's response was inadequate, ultimately forcing the customer to book with another airline. The customer's requests for a proper investigation and communication were consistently ignored or mishandled.",
    "journeyStep": "Browsing for flights"
  },
  {
    "reviewDateOfExperience": "2024-11-08",
    "reviewTitle": "Zero stars is not an option sadly",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer experienced a significant service failure when a flight booked through BA was cancelled after a 3-hour delay, and BA mistakenly marked it as only 52 minutes late. The customer spent over 70 days trying to prove the cancellation to BA, facing a lack of support and communication from the customer service department. Despite eventual agreement on the flight cancellation, the refund process was promised to take an additional 10 days.",
    "journeyStep": "Filing compensation claims"
  },
  {
    "reviewDateOfExperience": "2024-12-27",
    "reviewTitle": "No loyalty",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer expresses deep disappointment with BA due to an expired companion voucher they couldn't use because of issues with the Executive Club portal and feels the Avios scheme does not adequately reward loyalty, leading to BA being blacklisted by the customer.",
    "journeyStep": "Filing compensation claims"
  },
  {
    "reviewDateOfExperience": "2025-01-05",
    "reviewTitle": "Just wanted to say how good the cabin…",
    "reviewRatingScore": 5,
    "reviewSummary": "The customer had an excellent in-flight experience, praising the cabin crew, particularly Molly and Julie, for their service, and acknowledging the pilots' great job on the flight from San Francisco to London Heathrow.",
    "journeyStep": "In-flight experience"
  },
  {
    "reviewDateOfExperience": "2025-01-14",
    "reviewTitle": "Flying back from Schipol in The…",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced significant frustration trying to change their flight at Schipol airport, with BA staff both at the counter and on the phone providing unhelpful service which led to an accidental cancellation of their original booking. Eventually, the reviewer was placed back on their original flight, but not without undue stress and annoyance. The reviewer's attempts to change flights to return home earlier were met with refusal, wasting their time and highlighting a stark lack of consideration for customer convenience.",
    "journeyStep": "Baggage check-in"
  },
  {
    "reviewDateOfExperience": "2024-12-17",
    "reviewTitle": "Flights cancelled took 5 days and 1hr a…",
    "reviewRatingScore": 1,
    "reviewSummary": "The flight was cancelled, causing a significant inconvenience and additional costs for changing hotel dates and taxi arrangements. The customer service, particularly from one representative, was unhelpful, suggesting the cancellation of the holiday.",
    "journeyStep": "Filing compensation claims"
  },
  {
    "reviewDateOfExperience": "2024-07-05",
    "reviewTitle": "Outstanding service when flying to…",
    "reviewRatingScore": 5,
    "reviewSummary": "The service received during the flights to and from the United States of America, especially when traveling with a disabled daughter, was outstanding, marked by respect and kindness throughout the entire journey.",
    "journeyStep": "In-flight experience"
  },
  {
    "reviewDateOfExperience": "2024-11-15",
    "reviewTitle": "Our flight was very late Manchester to…",
    "reviewRatingScore": 1,
    "reviewSummary": "The flight from Manchester to Heathrow was severely delayed, causing the passenger to miss two connections to Bangkok and arrive 17 hours late, incurring extra costs of £408 with no refunds offered. The staff showed no empathy and offered no assistance, leading to a very negative overall experience.",
    "journeyStep": "Filing compensation claims"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "Never again … an abysmal airline",
    "reviewRatingScore": 3,
    "reviewSummary": "The reviewer had a highly unpleasant experience on a BA flight to and from Heathrow to Johannesburg, citing extremely uncomfortable seating, poor quality food, and a distressing delay upon landing due to a lack of bus drivers to transport passengers to the terminal. The discomfort was exacerbated by the plane being too warm and lacking adjustable fans, leading to physical agony for the reviewer, particularly due to pre-existing health issues.",
    "journeyStep": "In-flight experience"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "We had such a great experience with BA…",
    "reviewRatingScore": 5,
    "reviewSummary": "The reviewer had a positive experience with BA, highlighting the helpful and kind support received while changing their flight dates due to illness and the LA wildfires. They appreciated the exceptional service contrasted with typical call centre experiences.",
    "journeyStep": "Purchasing tickets"
  },
  {
    "reviewDateOfExperience": "2025-01-10",
    "reviewTitle": "Fabulous service Heathrow to Madrid",
    "reviewRatingScore": 4,
    "reviewSummary": "Despite a 1.5-hour delay due to issues in Madrid, the flight from Heathrow to Madrid was made exceptional by the attentive and caring nature of the staff, including personal recommendations and celebratory gestures. The crew, including the Captain, maintained positive communication and customer service, enhancing the overall in-flight experience.",
    "journeyStep": "In-flight experience"
  },
  {
    "reviewDateOfExperience": "2025-01-13",
    "reviewTitle": "2 hours to reschedule a flight - without success!",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer had a frustrating experience trying to reschedule an Avios reward flight with British Airways, spending 2 hours and making three failed attempts due to being referred to different hotlines.",
    "journeyStep": "Filing compensation claims"
  },
  {
    "reviewDateOfExperience": "2024-09-12",
    "reviewTitle": "Terrible treatment on a business class…",
    "reviewRatingScore": 2,
    "reviewSummary": "Experienced terrible treatment on a business class flight due to being seated separately after a change in plane type, with repeated requests to change seats denied. Felt extremely distressed as a nervous flyer, and faced atrocious customer service when seeking a refund for paid seat selection, taking four months of effort. The resolution offered was an unsatisfactory e-voucher instead of cash.",
    "journeyStep": "In-flight experience"
  },
  {
    "reviewDateOfExperience": "2025-01-13",
    "reviewTitle": "Access to BA customer service",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer is frustrated with the inability to obtain a receipt for flights taken with BA, citing two unfruitfully managed cases and issues with disconnected live chats. The inefficiency has led the reviewer to question BA's overall business management and has negatively impacted their perception of the airline.",
    "journeyStep": "Filing compensation claims"
  },
  {
    "reviewDateOfExperience": "2024-12-26",
    "reviewTitle": "Came here to write a one star review",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer expresses extreme dissatisfaction with British Airways for cancelling their flight on Boxing Day without offering alternative carriers, leading to significant additional costs and ineffective customer service response.",
    "journeyStep": "Filing compensation claims"
  },
  {
    "reviewDateOfExperience": "2024-12-09",
    "reviewTitle": "No catering on flight in business class",
    "reviewRatingScore": 1,
    "reviewSummary": "The customer expressed disappointment due to lack of catering on a business class flight and BA's subsequent lack of response and closure of the complaint without notification, indicating it may deter future support.",
    "journeyStep": "Filing compensation claims"
  },
  {
    "reviewDateOfExperience": "2024-12-30",
    "reviewTitle": "BA reveal themselves as vicious and uncaring",
    "reviewRatingScore": 1,
    "reviewSummary": "The reviewer experienced significant issues with their flight and hotel booking through BA, including a flight cancellation, an over 6-hour delay without communication, and being informed that their hotel booking was cancelled upon late arrival. Despite eventually getting a room, they were frustrated with BA's refusal to refund the lost nights and the lack of protection or resolution options from BA, labeling the company as uncaring and warning potential customers.",
    "journeyStep": "Filing compensation claims"
  }
]
